Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE


/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x10000000)

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)
#define I2S2ext_BASE          (APB1PERIPH_BASE + 0x3400)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00)
#define I2S3ext_BASE          (APB1PERIPH_BASE + 0x4000)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x5C00)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)

/*!< APB2 peripherals */
#define TIM1_BASE             (APB2PERIPH_BASE + 0x0000)
#define USART1_BASE           (APB2PERIPH_BASE + 0x1000)
#define USART6_BASE           (APB2PERIPH_BASE + 0x1400)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x2000)
#define ADC_BASE              (APB2PERIPH_BASE + 0x2300)
#define SDIO_BASE             (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)
#define SPI4_BASE             (APB2PERIPH_BASE + 0x3400)
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x3800)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x3C00)
#define TIM9_BASE             (APB2PERIPH_BASE + 0x4000)
#define TIM10_BASE            (APB2PERIPH_BASE + 0x4400)
#define TIM11_BASE            (APB2PERIPH_BASE + 0x4800)
#define SPI5_BASE             (APB2PERIPH_BASE + 0x5000)

/*!< AHB1 peripherals */
#define GPIOA_BASE            (AHB1PERIPH_BASE + 0x0000)
#define GPIOB_BASE            (AHB1PERIPH_BASE + 0x0400)
#define GPIOC_BASE            (AHB1PERIPH_BASE + 0x0800)
#define GPIOD_BASE            (AHB1PERIPH_BASE + 0x0C00)
#define GPIOE_BASE            (AHB1PERIPH_BASE + 0x1000)
#define GPIOH_BASE            (AHB1PERIPH_BASE + 0x1C00)
#define CRC_BASE              (AHB1PERIPH_BASE + 0x3000)
#define RCC_BASE              (AHB1PERIPH_BASE + 0x3800)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x3C00)
#define DMA1_BASE             (AHB1PERIPH_BASE + 0x6000)
#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8)
#define DMA2_BASE             (AHB1PERIPH_BASE + 0x6400)
#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8)

/* Debug MCU registers base address */
#define DBGMCU_BASE           (0xE0042000UL)

/*!< USB registers base address */
#define USB_OTG_FS_PERIPH_BASE               (0x50000000UL)

#define USB_OTG_GLOBAL_BASE                  (0x000UL)
#define USB_OTG_DEVICE_BASE                  (0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE             (0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            (0xB00UL)
#define USB_OTG_EP_REG_SIZE                  (0x20UL)
#define USB_OTG_HOST_BASE                    (0x400UL)
#define USB_OTG_HOST_PORT_BASE               (0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE            (0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            (0x20UL)
#define USB_OTG_PCGCCTL_BASE                 (0xE00UL)
#define USB_OTG_FIFO_BASE                    (0x1000UL)
#define USB_OTG_FIFO_SIZE                    (0x1000UL)

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define ADC                 ((ADC_Common_TypeDef *) ADC_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE)
#define SPI4                ((SPI_TypeDef *) SPI4_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define TIM9                ((TIM_TypeDef *) TIM9_BASE)
#define TIM10               ((TIM_TypeDef *) TIM10_BASE)
#define TIM11               ((TIM_TypeDef *) TIM11_BASE)
#define SPI5                ((SPI_TypeDef *) SPI5_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Stream0        ((DMA_Stream_TypeDef *) DMA1_Stream0_BASE)
#define DMA1_Stream1        ((DMA_Stream_TypeDef *) DMA1_Stream1_BASE)
#define DMA1_Stream2        ((DMA_Stream_TypeDef *) DMA1_Stream2_BASE)
#define DMA1_Stream3        ((DMA_Stream_TypeDef *) DMA1_Stream3_BASE)
#define DMA1_Stream4        ((DMA_Stream_TypeDef *) DMA1_Stream4_BASE)
#define DMA1_Stream5        ((DMA_Stream_TypeDef *) DMA1_Stream5_BASE)
#define DMA1_Stream6        ((DMA_Stream_TypeDef *) DMA1_Stream6_BASE)
#define DMA1_Stream7        ((DMA_Stream_TypeDef *) DMA1_Stream7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Stream0        ((DMA_Stream_TypeDef *) DMA2_Stream0_BASE)
#define DMA2_Stream1        ((DMA_Stream_TypeDef *) DMA2_Stream1_BASE)
#define DMA2_Stream2        ((DMA_Stream_TypeDef *) DMA2_Stream2_BASE)
#define DMA2_Stream3        ((DMA_Stream_TypeDef *) DMA2_Stream3_BASE)
#define DMA2_Stream4        ((DMA_Stream_TypeDef *) DMA2_Stream4_BASE)
#define DMA2_Stream5        ((DMA_Stream_TypeDef *) DMA2_Stream5_BASE)
#define DMA2_Stream6        ((DMA_Stream_TypeDef *) DMA2_Stream6_BASE)
#define DMA2_Stream7        ((DMA_Stream_TypeDef *) DMA2_Stream7_BASE)

#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)

#define USB_OTG_FS          ((USB_OTG_GlobalTypeDef *) USB_OTG_FS_PERIPH_BASE)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for ADC_SR register  ********************/
#define  ADC_SR_AWD                          (0x00000001UL)       /*!<Analog watchdog flag */
#define  ADC_SR_EOC                          (0x00000002UL)       /*!<End of conversion */
#define  ADC_SR_JEOC                         (0x00000004UL)       /*!<Injected channel end of conversion */
#define  ADC_SR_JSTRT                        (0x00000008UL)       /*!<Injected channel Start flag */
#define  ADC_SR_STRT                         (0x00000010UL)       /*!<Regular channel Start flag */
#define  ADC_SR_OVR                          (0x00000020UL)       /*!<Overrun flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define  ADC_CR1_AWDCH                       (0x0000001FUL)        /*!<AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_CR1_AWDCH_0                     (0x00000001UL)        /*!<Bit 0 */
#define  ADC_CR1_AWDCH_1                     (0x00000002UL)        /*!<Bit 1 */
#define  ADC_CR1_AWDCH_2                     (0x00000004UL)        /*!<Bit 2 */
#define  ADC_CR1_AWDCH_3                     (0x00000008UL)        /*!<Bit 3 */
#define  ADC_CR1_AWDCH_4                     (0x00000010UL)        /*!<Bit 4 */
#define  ADC_CR1_EOCIE                       (0x00000020UL)        /*!<Interrupt enable for EOC */
#define  ADC_CR1_AWDIE                       (0x00000040UL)        /*!<AAnalog Watchdog interrupt enable */
#define  ADC_CR1_JEOCIE                      (0x00000080UL)        /*!<Interrupt enable for injected channels */
#define  ADC_CR1_SCAN                        (0x00000100UL)        /*!<Scan mode */
#define  ADC_CR1_AWDSGL                      (0x00000200UL)        /*!<Enable the watchdog on a single channel in scan mode */
#define  ADC_CR1_JAUTO                       (0x00000400UL)        /*!<Automatic injected group conversion */
#define  ADC_CR1_DISCEN                      (0x00000800UL)        /*!<Discontinuous mode on regular channels */
#define  ADC_CR1_JDISCEN                     (0x00001000UL)        /*!<Discontinuous mode on injected channels */
#define  ADC_CR1_DISCNUM                     (0x0000E000UL)        /*!<DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define  ADC_CR1_DISCNUM_0                   (0x00002000UL)        /*!<Bit 0 */
#define  ADC_CR1_DISCNUM_1                   (0x00004000UL)        /*!<Bit 1 */
#define  ADC_CR1_DISCNUM_2                   (0x00008000UL)        /*!<Bit 2 */
#define  ADC_CR1_JAWDEN                      (0x00400000UL)        /*!<Analog watchdog enable on injected channels */
#define  ADC_CR1_AWDEN                       (0x00800000UL)        /*!<Analog watchdog enable on regular channels */
#define  ADC_CR1_RES                         (0x03000000UL)        /*!<RES[2:0] bits (Resolution) */
#define  ADC_CR1_RES_0                       (0x01000000UL)        /*!<Bit 0 */
#define  ADC_CR1_RES_1                       (0x02000000UL)        /*!<Bit 1 */
#define  ADC_CR1_OVRIE                       (0x04000000UL)         /*!<overrun interrupt enable */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define  ADC_CR2_ADON                        (0x00000001UL)        /*!<A/D Converter ON / OFF */
#define  ADC_CR2_CONT                        (0x00000002UL)        /*!<Continuous Conversion */
#define  ADC_CR2_DMA                         (0x00000100UL)        /*!<Direct Memory access mode */
#define  ADC_CR2_DDS                         (0x00000200UL)        /*!<DMA disable selection (Single ADC) */
#define  ADC_CR2_EOCS                        (0x00000400UL)        /*!<End of conversion selection */
#define  ADC_CR2_ALIGN                       (0x00000800UL)        /*!<Data Alignment */
#define  ADC_CR2_JEXTSEL                     (0x000F0000UL)        /*!<JEXTSEL[3:0] bits (External event select for injected group) */
#define  ADC_CR2_JEXTSEL_0                   (0x00010000UL)        /*!<Bit 0 */
#define  ADC_CR2_JEXTSEL_1                   (0x00020000UL)        /*!<Bit 1 */
#define  ADC_CR2_JEXTSEL_2                   (0x00040000UL)        /*!<Bit 2 */
#define  ADC_CR2_JEXTSEL_3                   (0x00080000UL)        /*!<Bit 3 */
#define  ADC_CR2_JEXTEN                      (0x00300000UL)        /*!<JEXTEN[1:0] bits (External Trigger Conversion mode for injected channelsp) */
#define  ADC_CR2_JEXTEN_0                    (0x00100000UL)        /*!<Bit 0 */
#define  ADC_CR2_JEXTEN_1                    (0x00200000UL)        /*!<Bit 1 */
#define  ADC_CR2_JSWSTART                    (0x00400000UL)        /*!<Start Conversion of injected channels */
#define  ADC_CR2_EXTSEL                      (0x0F000000UL)        /*!<EXTSEL[3:0] bits (External Event Select for regular group) */
#define  ADC_CR2_EXTSEL_0                    (0x01000000UL)        /*!<Bit 0 */
#define  ADC_CR2_EXTSEL_1                    (0x02000000UL)        /*!<Bit 1 */
#define  ADC_CR2_EXTSEL_2                    (0x04000000UL)        /*!<Bit 2 */
#define  ADC_CR2_EXTSEL_3                    (0x08000000UL)        /*!<Bit 3 */
#define  ADC_CR2_EXTEN                       (0x30000000UL)        /*!<EXTEN[1:0] bits (External Trigger Conversion mode for regular channelsp) */
#define  ADC_CR2_EXTEN_0                     (0x10000000UL)        /*!<Bit 0 */
#define  ADC_CR2_EXTEN_1                     (0x20000000UL)        /*!<Bit 1 */
#define  ADC_CR2_SWSTART                     (0x40000000UL)        /*!<Start Conversion of regular channels */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define  ADC_SMPR1_SMP10                     (0x00000007UL)        /*!<SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMPR1_SMP10_0                   (0x00000001UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP10_1                   (0x00000002UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP10_2                   (0x00000004UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP11                     (0x00000038UL)        /*!<SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMPR1_SMP11_0                   (0x00000008UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP11_1                   (0x00000010UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP11_2                   (0x00000020UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP12                     (0x000001C0UL)        /*!<SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMPR1_SMP12_0                   (0x00000040UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP12_1                   (0x00000080UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP12_2                   (0x00000100UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP13                     (0x00000E00UL)        /*!<SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMPR1_SMP13_0                   (0x00000200UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP13_1                   (0x00000400UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP13_2                   (0x00000800UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP14                     (0x00007000UL)        /*!<SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMPR1_SMP14_0                   (0x00001000UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP14_1                   (0x00002000UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP14_2                   (0x00004000UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP15                     (0x00038000UL)        /*!<SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMPR1_SMP15_0                   (0x00008000UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP15_1                   (0x00010000UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP15_2                   (0x00020000UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP16                     (0x001C0000UL)        /*!<SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMPR1_SMP16_0                   (0x00040000UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP16_1                   (0x00080000UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP16_2                   (0x00100000UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP17                     (0x00E00000UL)        /*!<SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMPR1_SMP17_0                   (0x00200000UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP17_1                   (0x00400000UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP17_2                   (0x00800000UL)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP18                     (0x07000000UL)        /*!<SMP18[2:0] bits (Channel 18 Sample time selection) */
#define  ADC_SMPR1_SMP18_0                   (0x01000000UL)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP18_1                   (0x02000000UL)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP18_2                   (0x04000000UL)        /*!<Bit 2 */

