Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/******************  Bit definition for ADC_SMPR2 register  *******************/
#define  ADC_SMPR2_SMP0                      (0x00000007UL)        /*!<SMP0[2:0] bits (Channel 0 Sample time selection) */
#define  ADC_SMPR2_SMP0_0                    (0x00000001UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP0_1                    (0x00000002UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP0_2                    (0x00000004UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP1                      (0x00000038UL)        /*!<SMP1[2:0] bits (Channel 1 Sample time selection) */
#define  ADC_SMPR2_SMP1_0                    (0x00000008UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP1_1                    (0x00000010UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP1_2                    (0x00000020UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP2                      (0x000001C0UL)        /*!<SMP2[2:0] bits (Channel 2 Sample time selection) */
#define  ADC_SMPR2_SMP2_0                    (0x00000040UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP2_1                    (0x00000080UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP2_2                    (0x00000100UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP3                      (0x00000E00UL)        /*!<SMP3[2:0] bits (Channel 3 Sample time selection) */
#define  ADC_SMPR2_SMP3_0                    (0x00000200UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP3_1                    (0x00000400UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP3_2                    (0x00000800UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP4                      (0x00007000UL)        /*!<SMP4[2:0] bits (Channel 4 Sample time selection) */
#define  ADC_SMPR2_SMP4_0                    (0x00001000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP4_1                    (0x00002000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP4_2                    (0x00004000UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP5                      (0x00038000UL)        /*!<SMP5[2:0] bits (Channel 5 Sample time selection) */
#define  ADC_SMPR2_SMP5_0                    (0x00008000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP5_1                    (0x00010000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP5_2                    (0x00020000UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP6                      (0x001C0000UL)        /*!<SMP6[2:0] bits (Channel 6 Sample time selection) */
#define  ADC_SMPR2_SMP6_0                    (0x00040000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP6_1                    (0x00080000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP6_2                    (0x00100000UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP7                      (0x00E00000UL)        /*!<SMP7[2:0] bits (Channel 7 Sample time selection) */
#define  ADC_SMPR2_SMP7_0                    (0x00200000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP7_1                    (0x00400000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP7_2                    (0x00800000UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP8                      (0x07000000UL)        /*!<SMP8[2:0] bits (Channel 8 Sample time selection) */
#define  ADC_SMPR2_SMP8_0                    (0x01000000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP8_1                    (0x02000000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP8_2                    (0x04000000UL)        /*!<Bit 2 */
#define  ADC_SMPR2_SMP9                      (0x38000000UL)        /*!<SMP9[2:0] bits (Channel 9 Sample time selection) */
#define  ADC_SMPR2_SMP9_0                    (0x08000000UL)        /*!<Bit 0 */
#define  ADC_SMPR2_SMP9_1                    (0x10000000UL)        /*!<Bit 1 */
#define  ADC_SMPR2_SMP9_2                    (0x20000000UL)        /*!<Bit 2 */

/******************  Bit definition for ADC_JOFR1 register  *******************/
#define  ADC_JOFR1_JOFFSET1                  (0x0FFFUL)            /*!<Data offset for injected channel 1 */

/******************  Bit definition for ADC_JOFR2 register  *******************/
#define  ADC_JOFR2_JOFFSET2                  (0x0FFFUL)            /*!<Data offset for injected channel 2 */

/******************  Bit definition for ADC_JOFR3 register  *******************/
#define  ADC_JOFR3_JOFFSET3                  (0x0FFFUL)            /*!<Data offset for injected channel 3 */

/******************  Bit definition for ADC_JOFR4 register  *******************/
#define  ADC_JOFR4_JOFFSET4                  (0x0FFFUL)            /*!<Data offset for injected channel 4 */

/*******************  Bit definition for ADC_HTR register  ********************/
#define  ADC_HTR_HT                          (0x0FFFUL)            /*!<Analog watchdog high threshold */

/*******************  Bit definition for ADC_LTR register  ********************/
#define  ADC_LTR_LT                          (0x0FFFUL)            /*!<Analog watchdog low threshold */

/*******************  Bit definition for ADC_SQR1 register  *******************/
#define  ADC_SQR1_SQ13                       (0x0000001FUL)        /*!<SQ13[4:0] bits (13th conversion in regular sequence) */
#define  ADC_SQR1_SQ13_0                     (0x00000001UL)        /*!<Bit 0 */
#define  ADC_SQR1_SQ13_1                     (0x00000002UL)        /*!<Bit 1 */
#define  ADC_SQR1_SQ13_2                     (0x00000004UL)        /*!<Bit 2 */
#define  ADC_SQR1_SQ13_3                     (0x00000008UL)        /*!<Bit 3 */
#define  ADC_SQR1_SQ13_4                     (0x00000010UL)        /*!<Bit 4 */
#define  ADC_SQR1_SQ14                       (0x000003E0UL)        /*!<SQ14[4:0] bits (14th conversion in regular sequence) */
#define  ADC_SQR1_SQ14_0                     (0x00000020UL)        /*!<Bit 0 */
#define  ADC_SQR1_SQ14_1                     (0x00000040UL)        /*!<Bit 1 */
#define  ADC_SQR1_SQ14_2                     (0x00000080UL)        /*!<Bit 2 */
#define  ADC_SQR1_SQ14_3                     (0x00000100UL)        /*!<Bit 3 */
#define  ADC_SQR1_SQ14_4                     (0x00000200UL)        /*!<Bit 4 */
#define  ADC_SQR1_SQ15                       (0x00007C00UL)        /*!<SQ15[4:0] bits (15th conversion in regular sequence) */
#define  ADC_SQR1_SQ15_0                     (0x00000400UL)        /*!<Bit 0 */
#define  ADC_SQR1_SQ15_1                     (0x00000800UL)        /*!<Bit 1 */
#define  ADC_SQR1_SQ15_2                     (0x00001000UL)        /*!<Bit 2 */
#define  ADC_SQR1_SQ15_3                     (0x00002000UL)        /*!<Bit 3 */
#define  ADC_SQR1_SQ15_4                     (0x00004000UL)        /*!<Bit 4 */
#define  ADC_SQR1_SQ16                       (0x000F8000UL)        /*!<SQ16[4:0] bits (16th conversion in regular sequence) */
#define  ADC_SQR1_SQ16_0                     (0x00008000UL)        /*!<Bit 0 */
#define  ADC_SQR1_SQ16_1                     (0x00010000UL)        /*!<Bit 1 */
#define  ADC_SQR1_SQ16_2                     (0x00020000UL)        /*!<Bit 2 */
#define  ADC_SQR1_SQ16_3                     (0x00040000UL)        /*!<Bit 3 */
#define  ADC_SQR1_SQ16_4                     (0x00080000UL)        /*!<Bit 4 */
#define  ADC_SQR1_L                          (0x00F00000UL)        /*!<L[3:0] bits (Regular channel sequence length) */
#define  ADC_SQR1_L_0                        (0x00100000UL)        /*!<Bit 0 */
#define  ADC_SQR1_L_1                        (0x00200000UL)        /*!<Bit 1 */
#define  ADC_SQR1_L_2                        (0x00400000UL)        /*!<Bit 2 */
#define  ADC_SQR1_L_3                        (0x00800000UL)        /*!<Bit 3 */

/*******************  Bit definition for ADC_SQR2 register  *******************/
#define  ADC_SQR2_SQ7                        (0x0000001FUL)        /*!<SQ7[4:0] bits (7th conversion in regular sequence) */
#define  ADC_SQR2_SQ7_0                      (0x00000001UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ7_1                      (0x00000002UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ7_2                      (0x00000004UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ7_3                      (0x00000008UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ7_4                      (0x00000010UL)        /*!<Bit 4 */
#define  ADC_SQR2_SQ8                        (0x000003E0UL)        /*!<SQ8[4:0] bits (8th conversion in regular sequence) */
#define  ADC_SQR2_SQ8_0                      (0x00000020UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ8_1                      (0x00000040UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ8_2                      (0x00000080UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ8_3                      (0x00000100UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ8_4                      (0x00000200UL)        /*!<Bit 4 */
#define  ADC_SQR2_SQ9                        (0x00007C00UL)        /*!<SQ9[4:0] bits (9th conversion in regular sequence) */
#define  ADC_SQR2_SQ9_0                      (0x00000400UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ9_1                      (0x00000800UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ9_2                      (0x00001000UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ9_3                      (0x00002000UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ9_4                      (0x00004000UL)        /*!<Bit 4 */
#define  ADC_SQR2_SQ10                       (0x000F8000UL)        /*!<SQ10[4:0] bits (10th conversion in regular sequence) */
#define  ADC_SQR2_SQ10_0                     (0x00008000UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ10_1                     (0x00010000UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ10_2                     (0x00020000UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ10_3                     (0x00040000UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ10_4                     (0x00080000UL)        /*!<Bit 4 */
#define  ADC_SQR2_SQ11                       (0x01F00000UL)        /*!<SQ11[4:0] bits (11th conversion in regular sequence) */
#define  ADC_SQR2_SQ11_0                     (0x00100000UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ11_1                     (0x00200000UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ11_2                     (0x00400000UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ11_3                     (0x00800000UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ11_4                     (0x01000000UL)        /*!<Bit 4 */
#define  ADC_SQR2_SQ12                       (0x3E000000UL)        /*!<SQ12[4:0] bits (12th conversion in regular sequence) */
#define  ADC_SQR2_SQ12_0                     (0x02000000UL)        /*!<Bit 0 */
#define  ADC_SQR2_SQ12_1                     (0x04000000UL)        /*!<Bit 1 */
#define  ADC_SQR2_SQ12_2                     (0x08000000UL)        /*!<Bit 2 */
#define  ADC_SQR2_SQ12_3                     (0x10000000UL)        /*!<Bit 3 */
#define  ADC_SQR2_SQ12_4                     (0x20000000UL)        /*!<Bit 4 */

