Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*******************  Bit definition for ADC_SQR3 register  *******************/
#define  ADC_SQR3_SQ1                        (0x0000001FUL)        /*!<SQ1[4:0] bits (1st conversion in regular sequence) */
#define  ADC_SQR3_SQ1_0                      (0x00000001UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ1_1                      (0x00000002UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ1_2                      (0x00000004UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ1_3                      (0x00000008UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ1_4                      (0x00000010UL)        /*!<Bit 4 */
#define  ADC_SQR3_SQ2                        (0x000003E0UL)        /*!<SQ2[4:0] bits (2nd conversion in regular sequence) */
#define  ADC_SQR3_SQ2_0                      (0x00000020UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ2_1                      (0x00000040UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ2_2                      (0x00000080UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ2_3                      (0x00000100UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ2_4                      (0x00000200UL)        /*!<Bit 4 */
#define  ADC_SQR3_SQ3                        (0x00007C00UL)        /*!<SQ3[4:0] bits (3rd conversion in regular sequence) */
#define  ADC_SQR3_SQ3_0                      (0x00000400UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ3_1                      (0x00000800UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ3_2                      (0x00001000UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ3_3                      (0x00002000UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ3_4                      (0x00004000UL)        /*!<Bit 4 */
#define  ADC_SQR3_SQ4                        (0x000F8000UL)        /*!<SQ4[4:0] bits (4th conversion in regular sequence) */
#define  ADC_SQR3_SQ4_0                      (0x00008000UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ4_1                      (0x00010000UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ4_2                      (0x00020000UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ4_3                      (0x00040000UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ4_4                      (0x00080000UL)        /*!<Bit 4 */
#define  ADC_SQR3_SQ5                        (0x01F00000UL)        /*!<SQ5[4:0] bits (5th conversion in regular sequence) */
#define  ADC_SQR3_SQ5_0                      (0x00100000UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ5_1                      (0x00200000UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ5_2                      (0x00400000UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ5_3                      (0x00800000UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ5_4                      (0x01000000UL)        /*!<Bit 4 */
#define  ADC_SQR3_SQ6                        (0x3E000000UL)        /*!<SQ6[4:0] bits (6th conversion in regular sequence) */
#define  ADC_SQR3_SQ6_0                      (0x02000000UL)        /*!<Bit 0 */
#define  ADC_SQR3_SQ6_1                      (0x04000000UL)        /*!<Bit 1 */
#define  ADC_SQR3_SQ6_2                      (0x08000000UL)        /*!<Bit 2 */
#define  ADC_SQR3_SQ6_3                      (0x10000000UL)        /*!<Bit 3 */
#define  ADC_SQR3_SQ6_4                      (0x20000000UL)        /*!<Bit 4 */

/*******************  Bit definition for ADC_JSQR register  *******************/
#define  ADC_JSQR_JSQ1                       (0x0000001FUL)        /*!<JSQ1[4:0] bits (1st conversion in injected sequence) */
#define  ADC_JSQR_JSQ1_0                     (0x00000001UL)        /*!<Bit 0 */
#define  ADC_JSQR_JSQ1_1                     (0x00000002UL)        /*!<Bit 1 */
#define  ADC_JSQR_JSQ1_2                     (0x00000004UL)        /*!<Bit 2 */
#define  ADC_JSQR_JSQ1_3                     (0x00000008UL)        /*!<Bit 3 */
#define  ADC_JSQR_JSQ1_4                     (0x00000010UL)        /*!<Bit 4 */
#define  ADC_JSQR_JSQ2                       (0x000003E0UL)        /*!<JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define  ADC_JSQR_JSQ2_0                     (0x00000020UL)        /*!<Bit 0 */
#define  ADC_JSQR_JSQ2_1                     (0x00000040UL)        /*!<Bit 1 */
#define  ADC_JSQR_JSQ2_2                     (0x00000080UL)        /*!<Bit 2 */
#define  ADC_JSQR_JSQ2_3                     (0x00000100UL)        /*!<Bit 3 */
#define  ADC_JSQR_JSQ2_4                     (0x00000200UL)        /*!<Bit 4 */
#define  ADC_JSQR_JSQ3                       (0x00007C00UL)        /*!<JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define  ADC_JSQR_JSQ3_0                     (0x00000400UL)        /*!<Bit 0 */
#define  ADC_JSQR_JSQ3_1                     (0x00000800UL)        /*!<Bit 1 */
#define  ADC_JSQR_JSQ3_2                     (0x00001000UL)        /*!<Bit 2 */
#define  ADC_JSQR_JSQ3_3                     (0x00002000UL)        /*!<Bit 3 */
#define  ADC_JSQR_JSQ3_4                     (0x00004000UL)        /*!<Bit 4 */
#define  ADC_JSQR_JSQ4                       (0x000F8000UL)        /*!<JSQ4[4:0] bits (4th conversion in injected sequence) */
#define  ADC_JSQR_JSQ4_0                     (0x00008000UL)        /*!<Bit 0 */
#define  ADC_JSQR_JSQ4_1                     (0x00010000UL)        /*!<Bit 1 */
#define  ADC_JSQR_JSQ4_2                     (0x00020000UL)        /*!<Bit 2 */
#define  ADC_JSQR_JSQ4_3                     (0x00040000UL)        /*!<Bit 3 */
#define  ADC_JSQR_JSQ4_4                     (0x00080000UL)        /*!<Bit 4 */
#define  ADC_JSQR_JL                         (0x00300000UL)        /*!<JL[1:0] bits (Injected Sequence length) */
#define  ADC_JSQR_JL_0                       (0x00100000UL)        /*!<Bit 0 */
#define  ADC_JSQR_JL_1                       (0x00200000UL)        /*!<Bit 1 */

/*******************  Bit definition for ADC_JDR1 register  *******************/
#define  ADC_JDR1_JDATA                      (0xFFFFUL)            /*!<Injected data */

/*******************  Bit definition for ADC_JDR2 register  *******************/
#define  ADC_JDR2_JDATA                      (0xFFFFUL)            /*!<Injected data */

/*******************  Bit definition for ADC_JDR3 register  *******************/
#define  ADC_JDR3_JDATA                      (0xFFFFUL)            /*!<Injected data */

/*******************  Bit definition for ADC_JDR4 register  *******************/
#define  ADC_JDR4_JDATA                      (0xFFFFUL)            /*!<Injected data */

