Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bit definition for ADC_DR register  ********************/
#define  ADC_DR_DATA                         (0x0000FFFFUL)        /*!<Regular data */
#define  ADC_DR_ADC2DATA                     (0xFFFF0000UL)        /*!<ADC2 data */

/*******************  Bit definition for ADC_CSR register  ********************/
#define  ADC_CSR_AWD1                        (0x00000001UL)        /*!<ADC1 Analog watchdog flag */
#define  ADC_CSR_EOC1                        (0x00000002UL)        /*!<ADC1 End of conversion */
#define  ADC_CSR_JEOC1                       (0x00000004UL)        /*!<ADC1 Injected channel end of conversion */
#define  ADC_CSR_JSTRT1                      (0x00000008UL)        /*!<ADC1 Injected channel Start flag */
#define  ADC_CSR_STRT1                       (0x00000010UL)        /*!<ADC1 Regular channel Start flag */
#define  ADC_CSR_DOVR1                       (0x00000020UL)        /*!<ADC1 DMA overrun  flag */
#define  ADC_CSR_AWD2                        (0x00000100UL)        /*!<ADC2 Analog watchdog flag */
#define  ADC_CSR_EOC2                        (0x00000200UL)        /*!<ADC2 End of conversion */
#define  ADC_CSR_JEOC2                       (0x00000400UL)        /*!<ADC2 Injected channel end of conversion */
#define  ADC_CSR_JSTRT2                      (0x00000800UL)        /*!<ADC2 Injected channel Start flag */
#define  ADC_CSR_STRT2                       (0x00001000UL)        /*!<ADC2 Regular channel Start flag */
#define  ADC_CSR_DOVR2                       (0x00002000UL)        /*!<ADC2 DMA overrun  flag */
#define  ADC_CSR_AWD3                        (0x00010000UL)        /*!<ADC3 Analog watchdog flag */
#define  ADC_CSR_EOC3                        (0x00020000UL)        /*!<ADC3 End of conversion */
#define  ADC_CSR_JEOC3                       (0x00040000UL)        /*!<ADC3 Injected channel end of conversion */
#define  ADC_CSR_JSTRT3                      (0x00080000UL)        /*!<ADC3 Injected channel Start flag */
#define  ADC_CSR_STRT3                       (0x00100000UL)        /*!<ADC3 Regular channel Start flag */
#define  ADC_CSR_DOVR3                       (0x00200000UL)        /*!<ADC3 DMA overrun  flag */

/*******************  Bit definition for ADC_CCR register  ********************/
#define  ADC_CCR_MULTI                       (0x0000001FUL)        /*!<MULTI[4:0] bits (Multi-ADC mode selection) */
#define  ADC_CCR_MULTI_0                     (0x00000001UL)        /*!<Bit 0 */
#define  ADC_CCR_MULTI_1                     (0x00000002UL)        /*!<Bit 1 */
#define  ADC_CCR_MULTI_2                     (0x00000004UL)        /*!<Bit 2 */
#define  ADC_CCR_MULTI_3                     (0x00000008UL)        /*!<Bit 3 */
#define  ADC_CCR_MULTI_4                     (0x00000010UL)        /*!<Bit 4 */
#define  ADC_CCR_DELAY                       (0x00000F00UL)        /*!<DELAY[3:0] bits (Delay between 2 sampling phases) */
#define  ADC_CCR_DELAY_0                     (0x00000100UL)        /*!<Bit 0 */
#define  ADC_CCR_DELAY_1                     (0x00000200UL)        /*!<Bit 1 */
#define  ADC_CCR_DELAY_2                     (0x00000400UL)        /*!<Bit 2 */
#define  ADC_CCR_DELAY_3                     (0x00000800UL)        /*!<Bit 3 */
#define  ADC_CCR_DDS                         (0x00002000UL)        /*!<DMA disable selection (Multi-ADC mode) */
#define  ADC_CCR_DMA                         (0x0000C000UL)        /*!<DMA[1:0] bits (Direct Memory Access mode for multimode) */
#define  ADC_CCR_DMA_0                       (0x00004000UL)        /*!<Bit 0 */
#define  ADC_CCR_DMA_1                       (0x00008000UL)        /*!<Bit 1 */
#define  ADC_CCR_ADCPRE                      (0x00030000UL)        /*!<ADCPRE[1:0] bits (ADC prescaler) */
#define  ADC_CCR_ADCPRE_0                    (0x00010000UL)        /*!<Bit 0 */
#define  ADC_CCR_ADCPRE_1                    (0x00020000UL)        /*!<Bit 1 */
#define  ADC_CCR_VBATE                       (0x00400000UL)        /*!<VBAT Enable */
#define  ADC_CCR_TSVREFE                     (0x00800000UL)        /*!<Temperature Sensor and VREFINT Enable */

/*******************  Bit definition for ADC_CDR register  ********************/
#define  ADC_CDR_DATA1                      (0x0000FFFFUL)         /*!<1st data of a pair of regular conversions */
#define  ADC_CDR_DATA2                      (0xFFFF0000UL)         /*!<2nd data of a pair of regular conversions */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define  CRC_DR_DR                           (0xFFFFFFFFUL) /*!< Data register bits */


/*******************  Bit definition for CRC_IDR register  ********************/
#define  CRC_IDR_IDR                         (0xFFUL)        /*!< General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CR register  ********************/
#define  CRC_CR_RESET                        (0x01UL)        /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/
#define DMA_SxCR_CHSEL                       (0x0E000000UL)
#define DMA_SxCR_CHSEL_0                     (0x02000000UL)
#define DMA_SxCR_CHSEL_1                     (0x04000000UL)
#define DMA_SxCR_CHSEL_2                     (0x08000000UL)
#define DMA_SxCR_MBURST                      (0x01800000UL)
#define DMA_SxCR_MBURST_0                    (0x00800000UL)
#define DMA_SxCR_MBURST_1                    (0x01000000UL)
#define DMA_SxCR_PBURST                      (0x00600000UL)
#define DMA_SxCR_PBURST_0                    (0x00200000UL)
#define DMA_SxCR_PBURST_1                    (0x00400000UL)
#define DMA_SxCR_ACK                         (0x00100000UL)
#define DMA_SxCR_CT                          (0x00080000UL)
#define DMA_SxCR_DBM                         (0x00040000UL)
#define DMA_SxCR_PL                          (0x00030000UL)
#define DMA_SxCR_PL_0                        (0x00010000UL)
#define DMA_SxCR_PL_1                        (0x00020000UL)
#define DMA_SxCR_PINCOS                      (0x00008000UL)
#define DMA_SxCR_MSIZE                       (0x00006000UL)
#define DMA_SxCR_MSIZE_0                     (0x00002000UL)
#define DMA_SxCR_MSIZE_1                     (0x00004000UL)
#define DMA_SxCR_PSIZE                       (0x00001800UL)
#define DMA_SxCR_PSIZE_0                     (0x00000800UL)
#define DMA_SxCR_PSIZE_1                     (0x00001000UL)
#define DMA_SxCR_MINC                        (0x00000400UL)
#define DMA_SxCR_PINC                        (0x00000200UL)
#define DMA_SxCR_CIRC                        (0x00000100UL)
#define DMA_SxCR_DIR                         (0x000000C0UL)
#define DMA_SxCR_DIR_0                       (0x00000040UL)
#define DMA_SxCR_DIR_1                       (0x00000080UL)
#define DMA_SxCR_PFCTRL                      (0x00000020UL)
#define DMA_SxCR_TCIE                        (0x00000010UL)
#define DMA_SxCR_HTIE                        (0x00000008UL)
#define DMA_SxCR_TEIE                        (0x00000004UL)
#define DMA_SxCR_DMEIE                       (0x00000002UL)
#define DMA_SxCR_EN                          (0x00000001UL)

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define DMA_SxNDT                            (0x0000FFFFUL)
#define DMA_SxNDT_0                          (0x00000001UL)
#define DMA_SxNDT_1                          (0x00000002UL)
#define DMA_SxNDT_2                          (0x00000004UL)
#define DMA_SxNDT_3                          (0x00000008UL)
#define DMA_SxNDT_4                          (0x00000010UL)
#define DMA_SxNDT_5                          (0x00000020UL)
#define DMA_SxNDT_6                          (0x00000040UL)
#define DMA_SxNDT_7                          (0x00000080UL)
#define DMA_SxNDT_8                          (0x00000100UL)
#define DMA_SxNDT_9                          (0x00000200UL)
#define DMA_SxNDT_10                         (0x00000400UL)
#define DMA_SxNDT_11                         (0x00000800UL)
#define DMA_SxNDT_12                         (0x00001000UL)
#define DMA_SxNDT_13                         (0x00002000UL)
#define DMA_SxNDT_14                         (0x00004000UL)
#define DMA_SxNDT_15                         (0x00008000UL)

/********************  Bits definition for DMA_SxFCR register  ****************/
#define DMA_SxFCR_FEIE                       (0x00000080UL)
#define DMA_SxFCR_FS                         (0x00000038UL)
#define DMA_SxFCR_FS_0                       (0x00000008UL)
#define DMA_SxFCR_FS_1                       (0x00000010UL)
#define DMA_SxFCR_FS_2                       (0x00000020UL)
#define DMA_SxFCR_DMDIS                      (0x00000004UL)
#define DMA_SxFCR_FTH                        (0x00000003UL)
#define DMA_SxFCR_FTH_0                      (0x00000001UL)
#define DMA_SxFCR_FTH_1                      (0x00000002UL)

