Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bits definition for DMA_LISR register  *****************/
#define DMA_LISR_TCIF3                       (0x08000000UL)
#define DMA_LISR_HTIF3                       (0x04000000UL)
#define DMA_LISR_TEIF3                       (0x02000000UL)
#define DMA_LISR_DMEIF3                      (0x01000000UL)
#define DMA_LISR_FEIF3                       (0x00400000UL)
#define DMA_LISR_TCIF2                       (0x00200000UL)
#define DMA_LISR_HTIF2                       (0x00100000UL)
#define DMA_LISR_TEIF2                       (0x00080000UL)
#define DMA_LISR_DMEIF2                      (0x00040000UL)
#define DMA_LISR_FEIF2                       (0x00010000UL)
#define DMA_LISR_TCIF1                       (0x00000800UL)
#define DMA_LISR_HTIF1                       (0x00000400UL)
#define DMA_LISR_TEIF1                       (0x00000200UL)
#define DMA_LISR_DMEIF1                      (0x00000100UL)
#define DMA_LISR_FEIF1                       (0x00000040UL)
#define DMA_LISR_TCIF0                       (0x00000020UL)
#define DMA_LISR_HTIF0                       (0x00000010UL)
#define DMA_LISR_TEIF0                       (0x00000008UL)
#define DMA_LISR_DMEIF0                      (0x00000004UL)
#define DMA_LISR_FEIF0                       (0x00000001UL)

/********************  Bits definition for DMA_HISR register  *****************/
#define DMA_HISR_TCIF7                       (0x08000000UL)
#define DMA_HISR_HTIF7                       (0x04000000UL)
#define DMA_HISR_TEIF7                       (0x02000000UL)
#define DMA_HISR_DMEIF7                      (0x01000000UL)
#define DMA_HISR_FEIF7                       (0x00400000UL)
#define DMA_HISR_TCIF6                       (0x00200000UL)
#define DMA_HISR_HTIF6                       (0x00100000UL)
#define DMA_HISR_TEIF6                       (0x00080000UL)
#define DMA_HISR_DMEIF6                      (0x00040000UL)
#define DMA_HISR_FEIF6                       (0x00010000UL)
#define DMA_HISR_TCIF5                       (0x00000800UL)
#define DMA_HISR_HTIF5                       (0x00000400UL)
#define DMA_HISR_TEIF5                       (0x00000200UL)
#define DMA_HISR_DMEIF5                      (0x00000100UL)
#define DMA_HISR_FEIF5                       (0x00000040UL)
#define DMA_HISR_TCIF4                       (0x00000020UL)
#define DMA_HISR_HTIF4                       (0x00000010UL)
#define DMA_HISR_TEIF4                       (0x00000008UL)
#define DMA_HISR_DMEIF4                      (0x00000004UL)
#define DMA_HISR_FEIF4                       (0x00000001UL)

/********************  Bits definition for DMA_LIFCR register  ****************/
#define DMA_LIFCR_CTCIF3                     (0x08000000UL)
#define DMA_LIFCR_CHTIF3                     (0x04000000UL)
#define DMA_LIFCR_CTEIF3                     (0x02000000UL)
#define DMA_LIFCR_CDMEIF3                    (0x01000000UL)
#define DMA_LIFCR_CFEIF3                     (0x00400000UL)
#define DMA_LIFCR_CTCIF2                     (0x00200000UL)
#define DMA_LIFCR_CHTIF2                     (0x00100000UL)
#define DMA_LIFCR_CTEIF2                     (0x00080000UL)
#define DMA_LIFCR_CDMEIF2                    (0x00040000UL)
#define DMA_LIFCR_CFEIF2                     (0x00010000UL)
#define DMA_LIFCR_CTCIF1                     (0x00000800UL)
#define DMA_LIFCR_CHTIF1                     (0x00000400UL)
#define DMA_LIFCR_CTEIF1                     (0x00000200UL)
#define DMA_LIFCR_CDMEIF1                    (0x00000100UL)
#define DMA_LIFCR_CFEIF1                     (0x00000040UL)
#define DMA_LIFCR_CTCIF0                     (0x00000020UL)
#define DMA_LIFCR_CHTIF0                     (0x00000010UL)
#define DMA_LIFCR_CTEIF0                     (0x00000008UL)
#define DMA_LIFCR_CDMEIF0                    (0x00000004UL)
#define DMA_LIFCR_CFEIF0                     (0x00000001UL)

/********************  Bits definition for DMA_HIFCR  register  ****************/
#define DMA_HIFCR_CTCIF7                     (0x08000000UL)
#define DMA_HIFCR_CHTIF7                     (0x04000000UL)
#define DMA_HIFCR_CTEIF7                     (0x02000000UL)
#define DMA_HIFCR_CDMEIF7                    (0x01000000UL)
#define DMA_HIFCR_CFEIF7                     (0x00400000UL)
#define DMA_HIFCR_CTCIF6                     (0x00200000UL)
#define DMA_HIFCR_CHTIF6                     (0x00100000UL)
#define DMA_HIFCR_CTEIF6                     (0x00080000UL)
#define DMA_HIFCR_CDMEIF6                    (0x00040000UL)
#define DMA_HIFCR_CFEIF6                     (0x00010000UL)
#define DMA_HIFCR_CTCIF5                     (0x00000800UL)
#define DMA_HIFCR_CHTIF5                     (0x00000400UL)
#define DMA_HIFCR_CTEIF5                     (0x00000200UL)
#define DMA_HIFCR_CDMEIF5                    (0x00000100UL)
#define DMA_HIFCR_CFEIF5                     (0x00000040UL)
#define DMA_HIFCR_CTCIF4                     (0x00000020UL)
#define DMA_HIFCR_CHTIF4                     (0x00000010UL)
#define DMA_HIFCR_CTEIF4                     (0x00000008UL)
#define DMA_HIFCR_CDMEIF4                    (0x00000004UL)
#define DMA_HIFCR_CFEIF4                     (0x00000001UL)


/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for EXTI_IMR register  *******************/
#define  EXTI_IMR_MR0                        (0x00000001UL)        /*!< Interrupt Mask on line 0 */
#define  EXTI_IMR_MR1                        (0x00000002UL)        /*!< Interrupt Mask on line 1 */
#define  EXTI_IMR_MR2                        (0x00000004UL)        /*!< Interrupt Mask on line 2 */
#define  EXTI_IMR_MR3                        (0x00000008UL)        /*!< Interrupt Mask on line 3 */
#define  EXTI_IMR_MR4                        (0x00000010UL)        /*!< Interrupt Mask on line 4 */
#define  EXTI_IMR_MR5                        (0x00000020UL)        /*!< Interrupt Mask on line 5 */
#define  EXTI_IMR_MR6                        (0x00000040UL)        /*!< Interrupt Mask on line 6 */
#define  EXTI_IMR_MR7                        (0x00000080UL)        /*!< Interrupt Mask on line 7 */
#define  EXTI_IMR_MR8                        (0x00000100UL)        /*!< Interrupt Mask on line 8 */
#define  EXTI_IMR_MR9                        (0x00000200UL)        /*!< Interrupt Mask on line 9 */
#define  EXTI_IMR_MR10                       (0x00000400UL)        /*!< Interrupt Mask on line 10 */
#define  EXTI_IMR_MR11                       (0x00000800UL)        /*!< Interrupt Mask on line 11 */
#define  EXTI_IMR_MR12                       (0x00001000UL)        /*!< Interrupt Mask on line 12 */
#define  EXTI_IMR_MR13                       (0x00002000UL)        /*!< Interrupt Mask on line 13 */
#define  EXTI_IMR_MR14                       (0x00004000UL)        /*!< Interrupt Mask on line 14 */
#define  EXTI_IMR_MR15                       (0x00008000UL)        /*!< Interrupt Mask on line 15 */
#define  EXTI_IMR_MR16                       (0x00010000UL)        /*!< Interrupt Mask on line 16 */
#define  EXTI_IMR_MR17                       (0x00020000UL)        /*!< Interrupt Mask on line 17 */
#define  EXTI_IMR_MR18                       (0x00040000UL)        /*!< Interrupt Mask on line 18 */
#define  EXTI_IMR_MR19                       (0x00080000UL)        /*!< Interrupt Mask on line 19 */
#define  EXTI_IMR_MR20                       (0x00100000UL)        /*!< Interrupt Mask on line 20 */
#define  EXTI_IMR_MR21                       (0x00200000UL)        /*!< Interrupt Mask on line 21 */
#define  EXTI_IMR_MR22                       (0x00400000UL)        /*!< Interrupt Mask on line 22 */

/*******************  Bit definition for EXTI_EMR register  *******************/
#define  EXTI_EMR_MR0                        (0x00000001UL)        /*!< Event Mask on line 0 */
#define  EXTI_EMR_MR1                        (0x00000002UL)        /*!< Event Mask on line 1 */
#define  EXTI_EMR_MR2                        (0x00000004UL)        /*!< Event Mask on line 2 */
#define  EXTI_EMR_MR3                        (0x00000008UL)        /*!< Event Mask on line 3 */
#define  EXTI_EMR_MR4                        (0x00000010UL)        /*!< Event Mask on line 4 */
#define  EXTI_EMR_MR5                        (0x00000020UL)        /*!< Event Mask on line 5 */
#define  EXTI_EMR_MR6                        (0x00000040UL)        /*!< Event Mask on line 6 */
#define  EXTI_EMR_MR7                        (0x00000080UL)        /*!< Event Mask on line 7 */
#define  EXTI_EMR_MR8                        (0x00000100UL)        /*!< Event Mask on line 8 */
#define  EXTI_EMR_MR9                        (0x00000200UL)        /*!< Event Mask on line 9 */
#define  EXTI_EMR_MR10                       (0x00000400UL)        /*!< Event Mask on line 10 */
#define  EXTI_EMR_MR11                       (0x00000800UL)        /*!< Event Mask on line 11 */
#define  EXTI_EMR_MR12                       (0x00001000UL)        /*!< Event Mask on line 12 */
#define  EXTI_EMR_MR13                       (0x00002000UL)        /*!< Event Mask on line 13 */
#define  EXTI_EMR_MR14                       (0x00004000UL)        /*!< Event Mask on line 14 */
#define  EXTI_EMR_MR15                       (0x00008000UL)        /*!< Event Mask on line 15 */
#define  EXTI_EMR_MR16                       (0x00010000UL)        /*!< Event Mask on line 16 */
#define  EXTI_EMR_MR17                       (0x00020000UL)        /*!< Event Mask on line 17 */
#define  EXTI_EMR_MR18                       (0x00040000UL)        /*!< Event Mask on line 18 */
#define  EXTI_EMR_MR19                       (0x00080000UL)        /*!< Event Mask on line 19 */
#define  EXTI_EMR_MR20                       (0x00100000UL)        /*!< Event Mask on line 20 */
#define  EXTI_EMR_MR21                       (0x00200000UL)        /*!< Event Mask on line 21 */
#define  EXTI_EMR_MR22                       (0x00400000UL)        /*!< Event Mask on line 22 */

/******************  Bit definition for EXTI_RTSR register  *******************/
#define  EXTI_RTSR_TR0                       (0x00000001UL)        /*!< Rising trigger event configuration bit of line 0 */
#define  EXTI_RTSR_TR1                       (0x00000002UL)        /*!< Rising trigger event configuration bit of line 1 */
#define  EXTI_RTSR_TR2                       (0x00000004UL)        /*!< Rising trigger event configuration bit of line 2 */
#define  EXTI_RTSR_TR3                       (0x00000008UL)        /*!< Rising trigger event configuration bit of line 3 */
#define  EXTI_RTSR_TR4                       (0x00000010UL)        /*!< Rising trigger event configuration bit of line 4 */
#define  EXTI_RTSR_TR5                       (0x00000020UL)        /*!< Rising trigger event configuration bit of line 5 */
#define  EXTI_RTSR_TR6                       (0x00000040UL)        /*!< Rising trigger event configuration bit of line 6 */
#define  EXTI_RTSR_TR7                       (0x00000080UL)        /*!< Rising trigger event configuration bit of line 7 */
#define  EXTI_RTSR_TR8                       (0x00000100UL)        /*!< Rising trigger event configuration bit of line 8 */
#define  EXTI_RTSR_TR9                       (0x00000200UL)        /*!< Rising trigger event configuration bit of line 9 */
#define  EXTI_RTSR_TR10                      (0x00000400UL)        /*!< Rising trigger event configuration bit of line 10 */
#define  EXTI_RTSR_TR11                      (0x00000800UL)        /*!< Rising trigger event configuration bit of line 11 */
#define  EXTI_RTSR_TR12                      (0x00001000UL)        /*!< Rising trigger event configuration bit of line 12 */
#define  EXTI_RTSR_TR13                      (0x00002000UL)        /*!< Rising trigger event configuration bit of line 13 */
#define  EXTI_RTSR_TR14                      (0x00004000UL)        /*!< Rising trigger event configuration bit of line 14 */
#define  EXTI_RTSR_TR15                      (0x00008000UL)        /*!< Rising trigger event configuration bit of line 15 */
#define  EXTI_RTSR_TR16                      (0x00010000UL)        /*!< Rising trigger event configuration bit of line 16 */
#define  EXTI_RTSR_TR17                      (0x00020000UL)        /*!< Rising trigger event configuration bit of line 17 */
#define  EXTI_RTSR_TR18                      (0x00040000UL)        /*!< Rising trigger event configuration bit of line 18 */
#define  EXTI_RTSR_TR19                      (0x00080000UL)        /*!< Rising trigger event configuration bit of line 19 */
#define  EXTI_RTSR_TR20                      (0x00100000UL)        /*!< Rising trigger event configuration bit of line 20 */
#define  EXTI_RTSR_TR21                      (0x00200000UL)        /*!< Rising trigger event configuration bit of line 21 */
#define  EXTI_RTSR_TR22                      (0x00400000UL)        /*!< Rising trigger event configuration bit of line 22 */

/******************  Bit definition for EXTI_FTSR register  *******************/
#define  EXTI_FTSR_TR0                       (0x00000001UL)        /*!< Falling trigger event configuration bit of line 0 */
#define  EXTI_FTSR_TR1                       (0x00000002UL)        /*!< Falling trigger event configuration bit of line 1 */
#define  EXTI_FTSR_TR2                       (0x00000004UL)        /*!< Falling trigger event configuration bit of line 2 */
#define  EXTI_FTSR_TR3                       (0x00000008UL)        /*!< Falling trigger event configuration bit of line 3 */
#define  EXTI_FTSR_TR4                       (0x00000010UL)        /*!< Falling trigger event configuration bit of line 4 */
#define  EXTI_FTSR_TR5                       (0x00000020UL)        /*!< Falling trigger event configuration bit of line 5 */
#define  EXTI_FTSR_TR6                       (0x00000040UL)        /*!< Falling trigger event configuration bit of line 6 */
#define  EXTI_FTSR_TR7                       (0x00000080UL)        /*!< Falling trigger event configuration bit of line 7 */
#define  EXTI_FTSR_TR8                       (0x00000100UL)        /*!< Falling trigger event configuration bit of line 8 */
#define  EXTI_FTSR_TR9                       (0x00000200UL)        /*!< Falling trigger event configuration bit of line 9 */
#define  EXTI_FTSR_TR10                      (0x00000400UL)        /*!< Falling trigger event configuration bit of line 10 */
#define  EXTI_FTSR_TR11                      (0x00000800UL)        /*!< Falling trigger event configuration bit of line 11 */
#define  EXTI_FTSR_TR12                      (0x00001000UL)        /*!< Falling trigger event configuration bit of line 12 */
#define  EXTI_FTSR_TR13                      (0x00002000UL)        /*!< Falling trigger event configuration bit of line 13 */
#define  EXTI_FTSR_TR14                      (0x00004000UL)        /*!< Falling trigger event configuration bit of line 14 */
#define  EXTI_FTSR_TR15                      (0x00008000UL)        /*!< Falling trigger event configuration bit of line 15 */
#define  EXTI_FTSR_TR16                      (0x00010000UL)        /*!< Falling trigger event configuration bit of line 16 */
#define  EXTI_FTSR_TR17                      (0x00020000UL)        /*!< Falling trigger event configuration bit of line 17 */
#define  EXTI_FTSR_TR18                      (0x00040000UL)        /*!< Falling trigger event configuration bit of line 18 */
#define  EXTI_FTSR_TR19                      (0x00080000UL)        /*!< Falling trigger event configuration bit of line 19 */
#define  EXTI_FTSR_TR20                      (0x00100000UL)        /*!< Falling trigger event configuration bit of line 20 */
#define  EXTI_FTSR_TR21                      (0x00200000UL)        /*!< Falling trigger event configuration bit of line 21 */
#define  EXTI_FTSR_TR22                      (0x00400000UL)        /*!< Falling trigger event configuration bit of line 22 */

/******************  Bit definition for EXTI_SWIER register  ******************/
#define  EXTI_SWIER_SWIER0                   (0x00000001UL)        /*!< Software Interrupt on line 0 */
#define  EXTI_SWIER_SWIER1                   (0x00000002UL)        /*!< Software Interrupt on line 1 */
#define  EXTI_SWIER_SWIER2                   (0x00000004UL)        /*!< Software Interrupt on line 2 */
#define  EXTI_SWIER_SWIER3                   (0x00000008UL)        /*!< Software Interrupt on line 3 */
#define  EXTI_SWIER_SWIER4                   (0x00000010UL)        /*!< Software Interrupt on line 4 */
#define  EXTI_SWIER_SWIER5                   (0x00000020UL)        /*!< Software Interrupt on line 5 */
#define  EXTI_SWIER_SWIER6                   (0x00000040UL)        /*!< Software Interrupt on line 6 */
#define  EXTI_SWIER_SWIER7                   (0x00000080UL)        /*!< Software Interrupt on line 7 */
#define  EXTI_SWIER_SWIER8                   (0x00000100UL)        /*!< Software Interrupt on line 8 */
#define  EXTI_SWIER_SWIER9                   (0x00000200UL)        /*!< Software Interrupt on line 9 */
#define  EXTI_SWIER_SWIER10                  (0x00000400UL)        /*!< Software Interrupt on line 10 */
#define  EXTI_SWIER_SWIER11                  (0x00000800UL)        /*!< Software Interrupt on line 11 */
#define  EXTI_SWIER_SWIER12                  (0x00001000UL)        /*!< Software Interrupt on line 12 */
#define  EXTI_SWIER_SWIER13                  (0x00002000UL)        /*!< Software Interrupt on line 13 */
#define  EXTI_SWIER_SWIER14                  (0x00004000UL)        /*!< Software Interrupt on line 14 */
#define  EXTI_SWIER_SWIER15                  (0x00008000UL)        /*!< Software Interrupt on line 15 */
#define  EXTI_SWIER_SWIER16                  (0x00010000UL)        /*!< Software Interrupt on line 16 */
#define  EXTI_SWIER_SWIER17                  (0x00020000UL)        /*!< Software Interrupt on line 17 */
#define  EXTI_SWIER_SWIER18                  (0x00040000UL)        /*!< Software Interrupt on line 18 */
#define  EXTI_SWIER_SWIER19                  (0x00080000UL)        /*!< Software Interrupt on line 19 */
#define  EXTI_SWIER_SWIER20                  (0x00100000UL)        /*!< Software Interrupt on line 20 */
#define  EXTI_SWIER_SWIER21                  (0x00200000UL)        /*!< Software Interrupt on line 21 */
#define  EXTI_SWIER_SWIER22                  (0x00400000UL)        /*!< Software Interrupt on line 22 */

/*******************  Bit definition for EXTI_PR register  ********************/
#define  EXTI_PR_PR0                         (0x00000001UL)        /*!< Pending bit for line 0 */
#define  EXTI_PR_PR1                         (0x00000002UL)        /*!< Pending bit for line 1 */
#define  EXTI_PR_PR2                         (0x00000004UL)        /*!< Pending bit for line 2 */
#define  EXTI_PR_PR3                         (0x00000008UL)        /*!< Pending bit for line 3 */
#define  EXTI_PR_PR4                         (0x00000010UL)        /*!< Pending bit for line 4 */
#define  EXTI_PR_PR5                         (0x00000020UL)        /*!< Pending bit for line 5 */
#define  EXTI_PR_PR6                         (0x00000040UL)        /*!< Pending bit for line 6 */
#define  EXTI_PR_PR7                         (0x00000080UL)        /*!< Pending bit for line 7 */
#define  EXTI_PR_PR8                         (0x00000100UL)        /*!< Pending bit for line 8 */
#define  EXTI_PR_PR9                         (0x00000200UL)        /*!< Pending bit for line 9 */
#define  EXTI_PR_PR10                        (0x00000400UL)        /*!< Pending bit for line 10 */
#define  EXTI_PR_PR11                        (0x00000800UL)        /*!< Pending bit for line 11 */
#define  EXTI_PR_PR12                        (0x00001000UL)        /*!< Pending bit for line 12 */
#define  EXTI_PR_PR13                        (0x00002000UL)        /*!< Pending bit for line 13 */
#define  EXTI_PR_PR14                        (0x00004000UL)        /*!< Pending bit for line 14 */
#define  EXTI_PR_PR15                        (0x00008000UL)        /*!< Pending bit for line 15 */
#define  EXTI_PR_PR16                        (0x00010000UL)        /*!< Pending bit for line 16 */
#define  EXTI_PR_PR17                        (0x00020000UL)        /*!< Pending bit for line 17 */
#define  EXTI_PR_PR18                        (0x00040000UL)        /*!< Pending bit for line 18 */
#define  EXTI_PR_PR19                        (0x00080000UL)        /*!< Pending bit for line 19 */
#define  EXTI_PR_PR20                        (0x00100000UL)        /*!< Pending bit for line 20 */
#define  EXTI_PR_PR21                        (0x00200000UL)        /*!< Pending bit for line 21 */
#define  EXTI_PR_PR22                        (0x00400000UL)        /*!< Pending bit for line 22 */

/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY                    (0x0000000FUL)
#define FLASH_ACR_LATENCY_0WS                (0x00000000UL)
#define FLASH_ACR_LATENCY_1WS                (0x00000001UL)
#define FLASH_ACR_LATENCY_2WS                (0x00000002UL)
#define FLASH_ACR_LATENCY_3WS                (0x00000003UL)
#define FLASH_ACR_LATENCY_4WS                (0x00000004UL)
#define FLASH_ACR_LATENCY_5WS                (0x00000005UL)
#define FLASH_ACR_LATENCY_6WS                (0x00000006UL)
#define FLASH_ACR_LATENCY_7WS                (0x00000007UL)

#define FLASH_ACR_PRFTEN                     (0x00000100UL)
#define FLASH_ACR_ICEN                       (0x00000200UL)
#define FLASH_ACR_DCEN                       (0x00000400UL)
#define FLASH_ACR_ICRST                      (0x00000800UL)
#define FLASH_ACR_DCRST                      (0x00001000UL)
#define FLASH_ACR_BYTE0_ADDRESS              (0x40023C00UL)
#define FLASH_ACR_BYTE2_ADDRESS              (0x40023C03UL)

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP                         (0x00000001UL)
#define FLASH_SR_SOP                         (0x00000002UL)
#define FLASH_SR_WRPERR                      (0x00000010UL)
#define FLASH_SR_PGAERR                      (0x00000020UL)
#define FLASH_SR_PGPERR                      (0x00000040UL)
#define FLASH_SR_PGSERR                      (0x00000080UL)
#define FLASH_SR_BSY                         (0x00010000UL)

