Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG                          (0x00000001UL)
#define FLASH_CR_SER                         (0x00000002UL)
#define FLASH_CR_MER                         (0x00000004UL)
#define FLASH_CR_SNB                         (0x000000F8UL)
#define FLASH_CR_SNB_0                       (0x00000008UL)
#define FLASH_CR_SNB_1                       (0x00000010UL)
#define FLASH_CR_SNB_2                       (0x00000020UL)
#define FLASH_CR_SNB_3                       (0x00000040UL)
#define FLASH_CR_SNB_4                       (0x00000080UL)
#define FLASH_CR_PSIZE                       (0x00000300UL)
#define FLASH_CR_PSIZE_0                     (0x00000100UL)
#define FLASH_CR_PSIZE_1                     (0x00000200UL)
#define FLASH_CR_STRT                        (0x00010000UL)
#define FLASH_CR_EOPIE                       (0x01000000UL)
#define FLASH_CR_LOCK                        (0x80000000UL)

/*******************  Bits definition for FLASH_OPTCR register  ***************/
#define FLASH_OPTCR_OPTLOCK                 (0x00000001UL)
#define FLASH_OPTCR_OPTSTRT                 (0x00000002UL)
#define FLASH_OPTCR_BOR_LEV_0               (0x00000004UL)
#define FLASH_OPTCR_BOR_LEV_1               (0x00000008UL)
#define FLASH_OPTCR_BOR_LEV                 (0x0000000CUL)

#define FLASH_OPTCR_WDG_SW                  (0x00000020UL)
#define FLASH_OPTCR_nRST_STOP               (0x00000040UL)
#define FLASH_OPTCR_nRST_STDBY              (0x00000080UL)
#define FLASH_OPTCR_RDP                     (0x0000FF00UL)
#define FLASH_OPTCR_RDP_0                   (0x00000100UL)
#define FLASH_OPTCR_RDP_1                   (0x00000200UL)
#define FLASH_OPTCR_RDP_2                   (0x00000400UL)
#define FLASH_OPTCR_RDP_3                   (0x00000800UL)
#define FLASH_OPTCR_RDP_4                   (0x00001000UL)
#define FLASH_OPTCR_RDP_5                   (0x00002000UL)
#define FLASH_OPTCR_RDP_6                   (0x00004000UL)
#define FLASH_OPTCR_RDP_7                   (0x00008000UL)
#define FLASH_OPTCR_nWRP                    (0x0FFF0000UL)
#define FLASH_OPTCR_nWRP_0                  (0x00010000UL)
#define FLASH_OPTCR_nWRP_1                  (0x00020000UL)
#define FLASH_OPTCR_nWRP_2                  (0x00040000UL)
#define FLASH_OPTCR_nWRP_3                  (0x00080000UL)
#define FLASH_OPTCR_nWRP_4                  (0x00100000UL)
#define FLASH_OPTCR_nWRP_5                  (0x00200000UL)
#define FLASH_OPTCR_nWRP_6                  (0x00400000UL)
#define FLASH_OPTCR_nWRP_7                  (0x00800000UL)
#define FLASH_OPTCR_nWRP_8                  (0x01000000UL)
#define FLASH_OPTCR_nWRP_9                  (0x02000000UL)
#define FLASH_OPTCR_nWRP_10                 (0x04000000UL)
#define FLASH_OPTCR_nWRP_11                 (0x08000000UL)

/******************  Bits definition for FLASH_OPTCR1 register  ***************/
#define FLASH_OPTCR1_nWRP                    (0x0FFF0000UL)
#define FLASH_OPTCR1_nWRP_0                  (0x00010000UL)
#define FLASH_OPTCR1_nWRP_1                  (0x00020000UL)
#define FLASH_OPTCR1_nWRP_2                  (0x00040000UL)
#define FLASH_OPTCR1_nWRP_3                  (0x00080000UL)
#define FLASH_OPTCR1_nWRP_4                  (0x00100000UL)
#define FLASH_OPTCR1_nWRP_5                  (0x00200000UL)
#define FLASH_OPTCR1_nWRP_6                  (0x00400000UL)
#define FLASH_OPTCR1_nWRP_7                  (0x00800000UL)
#define FLASH_OPTCR1_nWRP_8                  (0x01000000UL)
#define FLASH_OPTCR1_nWRP_9                  (0x02000000UL)
#define FLASH_OPTCR1_nWRP_10                 (0x04000000UL)
#define FLASH_OPTCR1_nWRP_11                 (0x08000000UL)

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0                    (0x00000003UL)
#define GPIO_MODER_MODER0_0                  (0x00000001UL)
#define GPIO_MODER_MODER0_1                  (0x00000002UL)

#define GPIO_MODER_MODER1                    (0x0000000CUL)
#define GPIO_MODER_MODER1_0                  (0x00000004UL)
#define GPIO_MODER_MODER1_1                  (0x00000008UL)

#define GPIO_MODER_MODER2                    (0x00000030UL)
#define GPIO_MODER_MODER2_0                  (0x00000010UL)
#define GPIO_MODER_MODER2_1                  (0x00000020UL)

#define GPIO_MODER_MODER3                    (0x000000C0UL)
#define GPIO_MODER_MODER3_0                  (0x00000040UL)
#define GPIO_MODER_MODER3_1                  (0x00000080UL)

#define GPIO_MODER_MODER4                    (0x00000300UL)
#define GPIO_MODER_MODER4_0                  (0x00000100UL)
#define GPIO_MODER_MODER4_1                  (0x00000200UL)

#define GPIO_MODER_MODER5                    (0x00000C00UL)
#define GPIO_MODER_MODER5_0                  (0x00000400UL)
#define GPIO_MODER_MODER5_1                  (0x00000800UL)

#define GPIO_MODER_MODER6                    (0x00003000UL)
#define GPIO_MODER_MODER6_0                  (0x00001000UL)
#define GPIO_MODER_MODER6_1                  (0x00002000UL)

#define GPIO_MODER_MODER7                    (0x0000C000UL)
#define GPIO_MODER_MODER7_0                  (0x00004000UL)
#define GPIO_MODER_MODER7_1                  (0x00008000UL)

#define GPIO_MODER_MODER8                    (0x00030000UL)
#define GPIO_MODER_MODER8_0                  (0x00010000UL)
#define GPIO_MODER_MODER8_1                  (0x00020000UL)

#define GPIO_MODER_MODER9                    (0x000C0000UL)
#define GPIO_MODER_MODER9_0                  (0x00040000UL)
#define GPIO_MODER_MODER9_1                  (0x00080000UL)

#define GPIO_MODER_MODER10                   (0x00300000UL)
#define GPIO_MODER_MODER10_0                 (0x00100000UL)
#define GPIO_MODER_MODER10_1                 (0x00200000UL)

#define GPIO_MODER_MODER11                   (0x00C00000UL)
#define GPIO_MODER_MODER11_0                 (0x00400000UL)
#define GPIO_MODER_MODER11_1                 (0x00800000UL)

#define GPIO_MODER_MODER12                   (0x03000000UL)
#define GPIO_MODER_MODER12_0                 (0x01000000UL)
#define GPIO_MODER_MODER12_1                 (0x02000000UL)

#define GPIO_MODER_MODER13                   (0x0C000000UL)
#define GPIO_MODER_MODER13_0                 (0x04000000UL)
#define GPIO_MODER_MODER13_1                 (0x08000000UL)

#define GPIO_MODER_MODER14                   (0x30000000UL)
#define GPIO_MODER_MODER14_0                 (0x10000000UL)
#define GPIO_MODER_MODER14_1                 (0x20000000UL)

