Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define GPIO_MODER_MODER15                   (0xC0000000UL)
#define GPIO_MODER_MODER15_0                 (0x40000000UL)
#define GPIO_MODER_MODER15_1                 (0x80000000UL)

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT_0                     (0x00000001UL)
#define GPIO_OTYPER_OT_1                     (0x00000002UL)
#define GPIO_OTYPER_OT_2                     (0x00000004UL)
#define GPIO_OTYPER_OT_3                     (0x00000008UL)
#define GPIO_OTYPER_OT_4                     (0x00000010UL)
#define GPIO_OTYPER_OT_5                     (0x00000020UL)
#define GPIO_OTYPER_OT_6                     (0x00000040UL)
#define GPIO_OTYPER_OT_7                     (0x00000080UL)
#define GPIO_OTYPER_OT_8                     (0x00000100UL)
#define GPIO_OTYPER_OT_9                     (0x00000200UL)
#define GPIO_OTYPER_OT_10                    (0x00000400UL)
#define GPIO_OTYPER_OT_11                    (0x00000800UL)
#define GPIO_OTYPER_OT_12                    (0x00001000UL)
#define GPIO_OTYPER_OT_13                    (0x00002000UL)
#define GPIO_OTYPER_OT_14                    (0x00004000UL)
#define GPIO_OTYPER_OT_15                    (0x00008000UL)

/******************  Bits definition for GPIO_OSPEEDR register  ***************/
#define GPIO_OSPEEDER_OSPEEDR0               (0x00000003UL)
#define GPIO_OSPEEDER_OSPEEDR0_0             (0x00000001UL)
#define GPIO_OSPEEDER_OSPEEDR0_1             (0x00000002UL)

#define GPIO_OSPEEDER_OSPEEDR1               (0x0000000CUL)
#define GPIO_OSPEEDER_OSPEEDR1_0             (0x00000004UL)
#define GPIO_OSPEEDER_OSPEEDR1_1             (0x00000008UL)

#define GPIO_OSPEEDER_OSPEEDR2               (0x00000030UL)
#define GPIO_OSPEEDER_OSPEEDR2_0             (0x00000010UL)
#define GPIO_OSPEEDER_OSPEEDR2_1             (0x00000020UL)

#define GPIO_OSPEEDER_OSPEEDR3               (0x000000C0UL)
#define GPIO_OSPEEDER_OSPEEDR3_0             (0x00000040UL)
#define GPIO_OSPEEDER_OSPEEDR3_1             (0x00000080UL)

#define GPIO_OSPEEDER_OSPEEDR4               (0x00000300UL)
#define GPIO_OSPEEDER_OSPEEDR4_0             (0x00000100UL)
#define GPIO_OSPEEDER_OSPEEDR4_1             (0x00000200UL)

#define GPIO_OSPEEDER_OSPEEDR5               (0x00000C00UL)
#define GPIO_OSPEEDER_OSPEEDR5_0             (0x00000400UL)
#define GPIO_OSPEEDER_OSPEEDR5_1             (0x00000800UL)

#define GPIO_OSPEEDER_OSPEEDR6               (0x00003000UL)
#define GPIO_OSPEEDER_OSPEEDR6_0             (0x00001000UL)
#define GPIO_OSPEEDER_OSPEEDR6_1             (0x00002000UL)

#define GPIO_OSPEEDER_OSPEEDR7               (0x0000C000UL)
#define GPIO_OSPEEDER_OSPEEDR7_0             (0x00004000UL)
#define GPIO_OSPEEDER_OSPEEDR7_1             (0x00008000UL)

#define GPIO_OSPEEDER_OSPEEDR8               (0x00030000UL)
#define GPIO_OSPEEDER_OSPEEDR8_0             (0x00010000UL)
#define GPIO_OSPEEDER_OSPEEDR8_1             (0x00020000UL)

#define GPIO_OSPEEDER_OSPEEDR9               (0x000C0000UL)
#define GPIO_OSPEEDER_OSPEEDR9_0             (0x00040000UL)
#define GPIO_OSPEEDER_OSPEEDR9_1             (0x00080000UL)

#define GPIO_OSPEEDER_OSPEEDR10              (0x00300000UL)
#define GPIO_OSPEEDER_OSPEEDR10_0            (0x00100000UL)
#define GPIO_OSPEEDER_OSPEEDR10_1            (0x00200000UL)

#define GPIO_OSPEEDER_OSPEEDR11              (0x00C00000UL)
#define GPIO_OSPEEDER_OSPEEDR11_0            (0x00400000UL)
#define GPIO_OSPEEDER_OSPEEDR11_1            (0x00800000UL)

#define GPIO_OSPEEDER_OSPEEDR12              (0x03000000UL)
#define GPIO_OSPEEDER_OSPEEDR12_0            (0x01000000UL)
#define GPIO_OSPEEDER_OSPEEDR12_1            (0x02000000UL)

#define GPIO_OSPEEDER_OSPEEDR13              (0x0C000000UL)
#define GPIO_OSPEEDER_OSPEEDR13_0            (0x04000000UL)
#define GPIO_OSPEEDER_OSPEEDR13_1            (0x08000000UL)

#define GPIO_OSPEEDER_OSPEEDR14              (0x30000000UL)
#define GPIO_OSPEEDER_OSPEEDR14_0            (0x10000000UL)
#define GPIO_OSPEEDER_OSPEEDR14_1            (0x20000000UL)

#define GPIO_OSPEEDER_OSPEEDR15              (0xC0000000UL)
#define GPIO_OSPEEDER_OSPEEDR15_0            (0x40000000UL)
#define GPIO_OSPEEDER_OSPEEDR15_1            (0x80000000UL)

/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPDR0                    (0x00000003UL)
#define GPIO_PUPDR_PUPDR0_0                  (0x00000001UL)
#define GPIO_PUPDR_PUPDR0_1                  (0x00000002UL)

#define GPIO_PUPDR_PUPDR1                    (0x0000000CUL)
#define GPIO_PUPDR_PUPDR1_0                  (0x00000004UL)
#define GPIO_PUPDR_PUPDR1_1                  (0x00000008UL)

#define GPIO_PUPDR_PUPDR2                    (0x00000030UL)
#define GPIO_PUPDR_PUPDR2_0                  (0x00000010UL)
#define GPIO_PUPDR_PUPDR2_1                  (0x00000020UL)

#define GPIO_PUPDR_PUPDR3                    (0x000000C0UL)
#define GPIO_PUPDR_PUPDR3_0                  (0x00000040UL)
#define GPIO_PUPDR_PUPDR3_1                  (0x00000080UL)

#define GPIO_PUPDR_PUPDR4                    (0x00000300UL)
#define GPIO_PUPDR_PUPDR4_0                  (0x00000100UL)
#define GPIO_PUPDR_PUPDR4_1                  (0x00000200UL)

#define GPIO_PUPDR_PUPDR5                    (0x00000C00UL)
#define GPIO_PUPDR_PUPDR5_0                  (0x00000400UL)
#define GPIO_PUPDR_PUPDR5_1                  (0x00000800UL)

#define GPIO_PUPDR_PUPDR6                    (0x00003000UL)
#define GPIO_PUPDR_PUPDR6_0                  (0x00001000UL)
#define GPIO_PUPDR_PUPDR6_1                  (0x00002000UL)

#define GPIO_PUPDR_PUPDR7                    (0x0000C000UL)
#define GPIO_PUPDR_PUPDR7_0                  (0x00004000UL)
#define GPIO_PUPDR_PUPDR7_1                  (0x00008000UL)

#define GPIO_PUPDR_PUPDR8                    (0x00030000UL)
#define GPIO_PUPDR_PUPDR8_0                  (0x00010000UL)
#define GPIO_PUPDR_PUPDR8_1                  (0x00020000UL)

#define GPIO_PUPDR_PUPDR9                    (0x000C0000UL)
#define GPIO_PUPDR_PUPDR9_0                  (0x00040000UL)
#define GPIO_PUPDR_PUPDR9_1                  (0x00080000UL)

#define GPIO_PUPDR_PUPDR10                   (0x00300000UL)
#define GPIO_PUPDR_PUPDR10_0                 (0x00100000UL)
#define GPIO_PUPDR_PUPDR10_1                 (0x00200000UL)

#define GPIO_PUPDR_PUPDR11                   (0x00C00000UL)
#define GPIO_PUPDR_PUPDR11_0                 (0x00400000UL)
#define GPIO_PUPDR_PUPDR11_1                 (0x00800000UL)

