Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define GPIO_PUPDR_PUPDR12                   (0x03000000UL)
#define GPIO_PUPDR_PUPDR12_0                 (0x01000000UL)
#define GPIO_PUPDR_PUPDR12_1                 (0x02000000UL)

#define GPIO_PUPDR_PUPDR13                   (0x0C000000UL)
#define GPIO_PUPDR_PUPDR13_0                 (0x04000000UL)
#define GPIO_PUPDR_PUPDR13_1                 (0x08000000UL)

#define GPIO_PUPDR_PUPDR14                   (0x30000000UL)
#define GPIO_PUPDR_PUPDR14_0                 (0x10000000UL)
#define GPIO_PUPDR_PUPDR14_1                 (0x20000000UL)

#define GPIO_PUPDR_PUPDR15                   (0xC0000000UL)
#define GPIO_PUPDR_PUPDR15_0                 (0x40000000UL)
#define GPIO_PUPDR_PUPDR15_1                 (0x80000000UL)

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR_0                       (0x00000001UL)
#define GPIO_IDR_IDR_1                       (0x00000002UL)
#define GPIO_IDR_IDR_2                       (0x00000004UL)
#define GPIO_IDR_IDR_3                       (0x00000008UL)
#define GPIO_IDR_IDR_4                       (0x00000010UL)
#define GPIO_IDR_IDR_5                       (0x00000020UL)
#define GPIO_IDR_IDR_6                       (0x00000040UL)
#define GPIO_IDR_IDR_7                       (0x00000080UL)
#define GPIO_IDR_IDR_8                       (0x00000100UL)
#define GPIO_IDR_IDR_9                       (0x00000200UL)
#define GPIO_IDR_IDR_10                      (0x00000400UL)
#define GPIO_IDR_IDR_11                      (0x00000800UL)
#define GPIO_IDR_IDR_12                      (0x00001000UL)
#define GPIO_IDR_IDR_13                      (0x00002000UL)
#define GPIO_IDR_IDR_14                      (0x00004000UL)
#define GPIO_IDR_IDR_15                      (0x00008000UL)
/* Old GPIO_IDR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_IDR_0                    GPIO_IDR_IDR_0
#define GPIO_OTYPER_IDR_1                    GPIO_IDR_IDR_1
#define GPIO_OTYPER_IDR_2                    GPIO_IDR_IDR_2
#define GPIO_OTYPER_IDR_3                    GPIO_IDR_IDR_3
#define GPIO_OTYPER_IDR_4                    GPIO_IDR_IDR_4
#define GPIO_OTYPER_IDR_5                    GPIO_IDR_IDR_5
#define GPIO_OTYPER_IDR_6                    GPIO_IDR_IDR_6
#define GPIO_OTYPER_IDR_7                    GPIO_IDR_IDR_7
#define GPIO_OTYPER_IDR_8                    GPIO_IDR_IDR_8
#define GPIO_OTYPER_IDR_9                    GPIO_IDR_IDR_9
#define GPIO_OTYPER_IDR_10                   GPIO_IDR_IDR_10
#define GPIO_OTYPER_IDR_11                   GPIO_IDR_IDR_11
#define GPIO_OTYPER_IDR_12                   GPIO_IDR_IDR_12
#define GPIO_OTYPER_IDR_13                   GPIO_IDR_IDR_13
#define GPIO_OTYPER_IDR_14                   GPIO_IDR_IDR_14
#define GPIO_OTYPER_IDR_15                   GPIO_IDR_IDR_15

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR_0                       (0x00000001UL)
#define GPIO_ODR_ODR_1                       (0x00000002UL)
#define GPIO_ODR_ODR_2                       (0x00000004UL)
#define GPIO_ODR_ODR_3                       (0x00000008UL)
#define GPIO_ODR_ODR_4                       (0x00000010UL)
#define GPIO_ODR_ODR_5                       (0x00000020UL)
#define GPIO_ODR_ODR_6                       (0x00000040UL)
#define GPIO_ODR_ODR_7                       (0x00000080UL)
#define GPIO_ODR_ODR_8                       (0x00000100UL)
#define GPIO_ODR_ODR_9                       (0x00000200UL)
#define GPIO_ODR_ODR_10                      (0x00000400UL)
#define GPIO_ODR_ODR_11                      (0x00000800UL)
#define GPIO_ODR_ODR_12                      (0x00001000UL)
#define GPIO_ODR_ODR_13                      (0x00002000UL)
#define GPIO_ODR_ODR_14                      (0x00004000UL)
#define GPIO_ODR_ODR_15                      (0x00008000UL)
/* Old GPIO_ODR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_ODR_0                    GPIO_ODR_ODR_0
#define GPIO_OTYPER_ODR_1                    GPIO_ODR_ODR_1
#define GPIO_OTYPER_ODR_2                    GPIO_ODR_ODR_2
#define GPIO_OTYPER_ODR_3                    GPIO_ODR_ODR_3
#define GPIO_OTYPER_ODR_4                    GPIO_ODR_ODR_4
#define GPIO_OTYPER_ODR_5                    GPIO_ODR_ODR_5
#define GPIO_OTYPER_ODR_6                    GPIO_ODR_ODR_6
#define GPIO_OTYPER_ODR_7                    GPIO_ODR_ODR_7
#define GPIO_OTYPER_ODR_8                    GPIO_ODR_ODR_8
#define GPIO_OTYPER_ODR_9                    GPIO_ODR_ODR_9
#define GPIO_OTYPER_ODR_10                   GPIO_ODR_ODR_10
#define GPIO_OTYPER_ODR_11                   GPIO_ODR_ODR_11
#define GPIO_OTYPER_ODR_12                   GPIO_ODR_ODR_12
#define GPIO_OTYPER_ODR_13                   GPIO_ODR_ODR_13
#define GPIO_OTYPER_ODR_14                   GPIO_ODR_ODR_14
#define GPIO_OTYPER_ODR_15                   GPIO_ODR_ODR_15

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS_0                       (0x00000001UL)
#define GPIO_BSRR_BS_1                       (0x00000002UL)
#define GPIO_BSRR_BS_2                       (0x00000004UL)
#define GPIO_BSRR_BS_3                       (0x00000008UL)
#define GPIO_BSRR_BS_4                       (0x00000010UL)
#define GPIO_BSRR_BS_5                       (0x00000020UL)
#define GPIO_BSRR_BS_6                       (0x00000040UL)
#define GPIO_BSRR_BS_7                       (0x00000080UL)
#define GPIO_BSRR_BS_8                       (0x00000100UL)
#define GPIO_BSRR_BS_9                       (0x00000200UL)
#define GPIO_BSRR_BS_10                      (0x00000400UL)
#define GPIO_BSRR_BS_11                      (0x00000800UL)
#define GPIO_BSRR_BS_12                      (0x00001000UL)
#define GPIO_BSRR_BS_13                      (0x00002000UL)
#define GPIO_BSRR_BS_14                      (0x00004000UL)
#define GPIO_BSRR_BS_15                      (0x00008000UL)
#define GPIO_BSRR_BR_0                       (0x00010000UL)
#define GPIO_BSRR_BR_1                       (0x00020000UL)
#define GPIO_BSRR_BR_2                       (0x00040000UL)
#define GPIO_BSRR_BR_3                       (0x00080000UL)
#define GPIO_BSRR_BR_4                       (0x00100000UL)
#define GPIO_BSRR_BR_5                       (0x00200000UL)
#define GPIO_BSRR_BR_6                       (0x00400000UL)
#define GPIO_BSRR_BR_7                       (0x00800000UL)
#define GPIO_BSRR_BR_8                       (0x01000000UL)
#define GPIO_BSRR_BR_9                       (0x02000000UL)
#define GPIO_BSRR_BR_10                      (0x04000000UL)
#define GPIO_BSRR_BR_11                      (0x08000000UL)
#define GPIO_BSRR_BR_12                      (0x10000000UL)
#define GPIO_BSRR_BR_13                      (0x20000000UL)
#define GPIO_BSRR_BR_14                      (0x40000000UL)
#define GPIO_BSRR_BR_15                      (0x80000000UL)

/****************** Bit definition for GPIO_LCKR register *********************/
#define GPIO_LCKR_LCK0                       (0x00000001UL)
#define GPIO_LCKR_LCK1                       (0x00000002UL)
#define GPIO_LCKR_LCK2                       (0x00000004UL)
#define GPIO_LCKR_LCK3                       (0x00000008UL)
#define GPIO_LCKR_LCK4                       (0x00000010UL)
#define GPIO_LCKR_LCK5                       (0x00000020UL)
#define GPIO_LCKR_LCK6                       (0x00000040UL)
#define GPIO_LCKR_LCK7                       (0x00000080UL)
#define GPIO_LCKR_LCK8                       (0x00000100UL)
#define GPIO_LCKR_LCK9                       (0x00000200UL)
#define GPIO_LCKR_LCK10                      (0x00000400UL)
#define GPIO_LCKR_LCK11                      (0x00000800UL)
#define GPIO_LCKR_LCK12                      (0x00001000UL)
#define GPIO_LCKR_LCK13                      (0x00002000UL)
#define GPIO_LCKR_LCK14                      (0x00004000UL)
#define GPIO_LCKR_LCK15                      (0x00008000UL)
#define GPIO_LCKR_LCKK                       (0x00010000UL)

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  ********************/
#define  I2C_CR1_PE                          (0x00000001UL)     /*!<Peripheral Enable                             */
#define  I2C_CR1_SMBUS                       (0x00000002UL)     /*!<SMBus Mode                                    */
#define  I2C_CR1_SMBTYPE                     (0x00000008UL)     /*!<SMBus Type                                    */
#define  I2C_CR1_ENARP                       (0x00000010UL)     /*!<ARP Enable                                    */
#define  I2C_CR1_ENPEC                       (0x00000020UL)     /*!<PEC Enable                                    */
#define  I2C_CR1_ENGC                        (0x00000040UL)     /*!<General Call Enable                           */
#define  I2C_CR1_NOSTRETCH                   (0x00000080UL)     /*!<Clock Stretching Disable (Slave mode)  */
#define  I2C_CR1_START                       (0x00000100UL)     /*!<Start Generation                              */
#define  I2C_CR1_STOP                        (0x00000200UL)     /*!<Stop Generation                               */
#define  I2C_CR1_ACK                         (0x00000400UL)     /*!<Acknowledge Enable                            */
#define  I2C_CR1_POS                         (0x00000800UL)     /*!<Acknowledge/PEC Position (for data reception) */
#define  I2C_CR1_PEC                         (0x00001000UL)     /*!<Packet Error Checking                         */
#define  I2C_CR1_ALERT                       (0x00002000UL)     /*!<SMBus Alert                                   */
#define  I2C_CR1_SWRST                       (0x00008000UL)     /*!<Software Reset                                */

/*******************  Bit definition for I2C_CR2 register  ********************/
#define  I2C_CR2_FREQ                        (0x0000003FUL)     /*!<FREQ[5:0] bits (Peripheral Clock Frequency)   */
#define  I2C_CR2_FREQ_0                      (0x00000001UL)     /*!<Bit 0 */
#define  I2C_CR2_FREQ_1                      (0x00000002UL)     /*!<Bit 1 */
#define  I2C_CR2_FREQ_2                      (0x00000004UL)     /*!<Bit 2 */
#define  I2C_CR2_FREQ_3                      (0x00000008UL)     /*!<Bit 3 */
#define  I2C_CR2_FREQ_4                      (0x00000010UL)     /*!<Bit 4 */
#define  I2C_CR2_FREQ_5                      (0x00000020UL)     /*!<Bit 5 */

#define  I2C_CR2_ITERREN                     (0x00000100UL)     /*!<Error Interrupt Enable  */
#define  I2C_CR2_ITEVTEN                     (0x00000200UL)     /*!<Event Interrupt Enable  */
#define  I2C_CR2_ITBUFEN                     (0x00000400UL)     /*!<Buffer Interrupt Enable */
#define  I2C_CR2_DMAEN                       (0x00000800UL)     /*!<DMA Requests Enable     */
#define  I2C_CR2_LAST                        (0x00001000UL)     /*!<DMA Last Transfer       */

/*******************  Bit definition for I2C_OAR1 register  *******************/
#define  I2C_OAR1_ADD1_7                     (0x000000FEUL)     /*!<Interface Address */
#define  I2C_OAR1_ADD8_9                     (0x00000300UL)     /*!<Interface Address */

#define  I2C_OAR1_ADD0                       (0x00000001UL)     /*!<Bit 0 */
#define  I2C_OAR1_ADD1                       (0x00000002UL)     /*!<Bit 1 */
#define  I2C_OAR1_ADD2                       (0x00000004UL)     /*!<Bit 2 */
#define  I2C_OAR1_ADD3                       (0x00000008UL)     /*!<Bit 3 */
#define  I2C_OAR1_ADD4                       (0x00000010UL)     /*!<Bit 4 */
#define  I2C_OAR1_ADD5                       (0x00000020UL)     /*!<Bit 5 */
#define  I2C_OAR1_ADD6                       (0x00000040UL)     /*!<Bit 6 */
#define  I2C_OAR1_ADD7                       (0x00000080UL)     /*!<Bit 7 */
#define  I2C_OAR1_ADD8                       (0x00000100UL)     /*!<Bit 8 */
#define  I2C_OAR1_ADD9                       (0x00000200UL)     /*!<Bit 9 */

