Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define  I2C_OAR1_ADDMODE                    (0x00008000UL)     /*!<Addressing Mode (Slave mode) */

/*******************  Bit definition for I2C_OAR2 register  *******************/
#define  I2C_OAR2_ENDUAL                     (0x00000001UL)        /*!<Dual addressing mode enable */
#define  I2C_OAR2_ADD2                       (0x000000FEUL)        /*!<Interface address           */

/********************  Bit definition for I2C_DR register  ********************/
#define  I2C_DR_DR                           (0x000000FFUL)        /*!<8-bit Data Register         */

/*******************  Bit definition for I2C_SR1 register  ********************/
#define  I2C_SR1_SB                          (0x00000001UL)     /*!<Start Bit (Master mode)                  */
#define  I2C_SR1_ADDR                        (0x00000002UL)     /*!<Address sent (master mode)/matched (slave mode) */
#define  I2C_SR1_BTF                         (0x00000004UL)     /*!<Byte Transfer Finished                          */
#define  I2C_SR1_ADD10                       (0x00000008UL)     /*!<10-bit header sent (Master mode)         */
#define  I2C_SR1_STOPF                       (0x00000010UL)     /*!<Stop detection (Slave mode)              */
#define  I2C_SR1_RXNE                        (0x00000040UL)     /*!<Data Register not Empty (receivers)      */
#define  I2C_SR1_TXE                         (0x00000080UL)     /*!<Data Register Empty (transmitters)       */
#define  I2C_SR1_BERR                        (0x00000100UL)     /*!<Bus Error                                       */
#define  I2C_SR1_ARLO                        (0x00000200UL)     /*!<Arbitration Lost (master mode)           */
#define  I2C_SR1_AF                          (0x00000400UL)     /*!<Acknowledge Failure                             */
#define  I2C_SR1_OVR                         (0x00000800UL)     /*!<Overrun/Underrun                                */
#define  I2C_SR1_PECERR                      (0x00001000UL)     /*!<PEC Error in reception                          */
#define  I2C_SR1_TIMEOUT                     (0x00004000UL)     /*!<Timeout or Tlow Error                           */
#define  I2C_SR1_SMBALERT                    (0x00008000UL)     /*!<SMBus Alert                                     */

/*******************  Bit definition for I2C_SR2 register  ********************/
#define  I2C_SR2_MSL                         (0x00000001UL)     /*!<Master/Slave                              */
#define  I2C_SR2_BUSY                        (0x00000002UL)     /*!<Bus Busy                                  */
#define  I2C_SR2_TRA                         (0x00000004UL)     /*!<Transmitter/Receiver                      */
#define  I2C_SR2_GENCALL                     (0x00000010UL)     /*!<General Call Address (Slave mode)  */
#define  I2C_SR2_SMBDEFAULT                  (0x00000020UL)     /*!<SMBus Device Default Address (Slave mode) */
#define  I2C_SR2_SMBHOST                     (0x00000040UL)     /*!<SMBus Host Header (Slave mode)     */
#define  I2C_SR2_DUALF                       (0x00000080UL)     /*!<Dual Flag (Slave mode)             */
#define  I2C_SR2_PEC                         (0x0000FF00UL)     /*!<Packet Error Checking Register            */

/*******************  Bit definition for I2C_CCR register  ********************/
#define  I2C_CCR_CCR                         (0x00000FFFUL)     /*!<Clock Control Register in Fast/Standard mode (Master mode) */
#define  I2C_CCR_DUTY                        (0x00004000UL)     /*!<Fast Mode Duty Cycle                                       */
#define  I2C_CCR_FS                          (0x00008000UL)     /*!<I2C Master Mode Selection                                  */

/******************  Bit definition for I2C_TRISE register  *******************/
#define  I2C_TRISE_TRISE                     (0x0000003FUL)     /*!<Maximum Rise Time in Fast/Standard mode (Master mode) */

/******************  Bit definition for I2C_FLTR register  *******************/
#define  I2C_FLTR_DNF                        (0x0000000FUL)     /*!<Digital Noise Filter */
#define  I2C_FLTR_ANOFF                      (0x00000010UL)     /*!<Analog Noise Filter OFF */

/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_KR_KEY                         (0xFFFFUL)            /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define  IWDG_PR_PR                          (0x07UL)               /*!<PR[2:0] (Prescaler divider)         */
#define  IWDG_PR_PR_0                        (0x01UL)               /*!<Bit 0 */
#define  IWDG_PR_PR_1                        (0x02UL)               /*!<Bit 1 */
#define  IWDG_PR_PR_2                        (0x04UL)               /*!<Bit 2 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         (0x0FFFUL)            /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         (0x01UL)               /*!<Watchdog prescaler value update      */
#define  IWDG_SR_RVU                         (0x02UL)               /*!<Watchdog counter reload value update */


/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PWR_CR register  ********************/
#define  PWR_CR_LPDS                         (0x00000001UL)     /*!< Low-Power Deepsleep                 */
#define  PWR_CR_PDDS                         (0x00000002UL)     /*!< Power Down Deepsleep                */
#define  PWR_CR_CWUF                         (0x00000004UL)     /*!< Clear Wakeup Flag                   */
#define  PWR_CR_CSBF                         (0x00000008UL)     /*!< Clear Standby Flag                  */
#define  PWR_CR_PVDE                         (0x00000010UL)     /*!< Power Voltage Detector Enable       */

#define  PWR_CR_PLS                          (0x000000E0UL)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        (0x00000020UL)     /*!< Bit 0 */
#define  PWR_CR_PLS_1                        (0x00000040UL)     /*!< Bit 1 */
#define  PWR_CR_PLS_2                        (0x00000080UL)     /*!< Bit 2 */

/*!< PVD level configuration */
#define  PWR_CR_PLS_LEV0                     (0x00000000UL)     /*!< PVD level 0 */
#define  PWR_CR_PLS_LEV1                     (0x00000020UL)     /*!< PVD level 1 */
#define  PWR_CR_PLS_LEV2                     (0x00000040UL)     /*!< PVD level 2 */
#define  PWR_CR_PLS_LEV3                     (0x00000060UL)     /*!< PVD level 3 */
#define  PWR_CR_PLS_LEV4                     (0x00000080UL)     /*!< PVD level 4 */
#define  PWR_CR_PLS_LEV5                     (0x000000A0UL)     /*!< PVD level 5 */
#define  PWR_CR_PLS_LEV6                     (0x000000C0UL)     /*!< PVD level 6 */
#define  PWR_CR_PLS_LEV7                     (0x000000E0UL)     /*!< PVD level 7 */

#define  PWR_CR_DBP                          (0x00000100UL)     /*!< Disable Backup Domain write protection                     */
#define  PWR_CR_FPDS                         (0x00000200UL)     /*!< Flash power down in Stop mode                              */
#define  PWR_CR_LPLVDS                       (0x00000400UL)     /*!< Low Power Regulator Low Voltage in Deep Sleep mode         */
#define  PWR_CR_MRLVDS                       (0x00000800UL)     /*!< Main Regulator Low Voltage in Deep Sleep mode              */
#define  PWR_CR_ADCDC1                       (0x00002000UL)     /*!< Refer to AN4073 on how to use this bit                     */

#define  PWR_CR_VOS                          (0x0000C000UL)     /*!< VOS[1:0] bits (Regulator voltage scaling output selection) */
#define  PWR_CR_VOS_0                        (0x00004000UL)     /*!< Bit 0 */
#define  PWR_CR_VOS_1                        (0x00008000UL)     /*!< Bit 1 */

#define  PWR_CR_FMSSR                        (0x00100000UL)     /*!< Flash Memory Sleep System Run        */
#define  PWR_CR_FISSR                        (0x00200000UL)     /*!< Flash Interface Stop while System Run */
/* Legacy define */
#define  PWR_CR_PMODE                        PWR_CR_VOS

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                         (0x00000001UL)     /*!< Wakeup Flag                                      */
#define  PWR_CSR_SBF                         (0x00000002UL)     /*!< Standby Flag                                     */
#define  PWR_CSR_PVDO                        (0x00000004UL)     /*!< PVD Output                                       */
#define  PWR_CSR_BRR                         (0x00000008UL)     /*!< Backup regulator ready                           */
#define  PWR_CSR_EWUP                        (0x00000100UL)     /*!< Enable WKUP pin                                  */
#define  PWR_CSR_BRE                         (0x00000200UL)     /*!< Backup regulator enable                          */
#define  PWR_CSR_VOSRDY                      (0x00004000UL)     /*!< Regulator voltage scaling output selection ready */

