Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/* Legacy define */
#define  PWR_CSR_REGRDY                      PWR_CSR_VOSRDY

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        (0x00000001UL)
#define  RCC_CR_HSIRDY                       (0x00000002UL)

#define  RCC_CR_HSITRIM                      (0x000000F8UL)
#define  RCC_CR_HSITRIM_0                    (0x00000008UL)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1                    (0x00000010UL)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2                    (0x00000020UL)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3                    (0x00000040UL)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4                    (0x00000080UL)/*!<Bit 4 */

#define  RCC_CR_HSICAL                       (0x0000FF00UL)
#define  RCC_CR_HSICAL_0                     (0x00000100UL)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                     (0x00000200UL)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                     (0x00000400UL)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                     (0x00000800UL)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                     (0x00001000UL)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                     (0x00002000UL)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                     (0x00004000UL)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                     (0x00008000UL)/*!<Bit 7 */

#define  RCC_CR_HSEON                        (0x00010000UL)
#define  RCC_CR_HSERDY                       (0x00020000UL)
#define  RCC_CR_HSEBYP                       (0x00040000UL)
#define  RCC_CR_CSSON                        (0x00080000UL)
#define  RCC_CR_PLLON                        (0x01000000UL)
#define  RCC_CR_PLLRDY                       (0x02000000UL)
#define  RCC_CR_PLLI2SON                     (0x04000000UL)
#define  RCC_CR_PLLI2SRDY                    (0x08000000UL)

/********************  Bit definition for RCC_PLLCFGR register  ***************/
#define  RCC_PLLCFGR_PLLM                    (0x0000003FUL)
#define  RCC_PLLCFGR_PLLM_0                  (0x00000001UL)
#define  RCC_PLLCFGR_PLLM_1                  (0x00000002UL)
#define  RCC_PLLCFGR_PLLM_2                  (0x00000004UL)
#define  RCC_PLLCFGR_PLLM_3                  (0x00000008UL)
#define  RCC_PLLCFGR_PLLM_4                  (0x00000010UL)
#define  RCC_PLLCFGR_PLLM_5                  (0x00000020UL)

#define  RCC_PLLCFGR_PLLN                     (0x00007FC0UL)
#define  RCC_PLLCFGR_PLLN_0                   (0x00000040UL)
#define  RCC_PLLCFGR_PLLN_1                   (0x00000080UL)
#define  RCC_PLLCFGR_PLLN_2                   (0x00000100UL)
#define  RCC_PLLCFGR_PLLN_3                   (0x00000200UL)
#define  RCC_PLLCFGR_PLLN_4                   (0x00000400UL)
#define  RCC_PLLCFGR_PLLN_5                   (0x00000800UL)
#define  RCC_PLLCFGR_PLLN_6                   (0x00001000UL)
#define  RCC_PLLCFGR_PLLN_7                   (0x00002000UL)
#define  RCC_PLLCFGR_PLLN_8                   (0x00004000UL)

#define  RCC_PLLCFGR_PLLP                    (0x00030000UL)
#define  RCC_PLLCFGR_PLLP_0                  (0x00010000UL)
#define  RCC_PLLCFGR_PLLP_1                  (0x00020000UL)

#define  RCC_PLLCFGR_PLLSRC                  (0x00400000UL)
#define  RCC_PLLCFGR_PLLSRC_HSE              (0x00400000UL)
#define  RCC_PLLCFGR_PLLSRC_HSI              (0x00000000UL)

#define  RCC_PLLCFGR_PLLQ                    (0x0F000000UL)
#define  RCC_PLLCFGR_PLLQ_0                  (0x01000000UL)
#define  RCC_PLLCFGR_PLLQ_1                  (0x02000000UL)
#define  RCC_PLLCFGR_PLLQ_2                  (0x04000000UL)
#define  RCC_PLLCFGR_PLLQ_3                  (0x08000000UL)

/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define  RCC_CFGR_SW                         (0x00000003UL)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       (0x00000001UL)        /*!< Bit 0 */
#define  RCC_CFGR_SW_1                       (0x00000002UL)        /*!< Bit 1 */

#define  RCC_CFGR_SW_HSI                     (0x00000000UL)        /*!< HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     (0x00000001UL)        /*!< HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     (0x00000002UL)        /*!< PLL selected as system clock */

/*!< SWS configuration */
#define  RCC_CFGR_SWS                        (0x0000000CUL)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      (0x00000004UL)        /*!< Bit 0 */
#define  RCC_CFGR_SWS_1                      (0x00000008UL)        /*!< Bit 1 */

#define  RCC_CFGR_SWS_HSI                    (0x00000000UL)        /*!< HSI oscillator used as system clock */
#define  RCC_CFGR_SWS_HSE                    (0x00000004UL)        /*!< HSE oscillator used as system clock */
#define  RCC_CFGR_SWS_PLL                    (0x00000008UL)        /*!< PLL used as system clock */

/*!< HPRE configuration */
#define  RCC_CFGR_HPRE                       (0x000000F0UL)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     (0x00000010UL)        /*!< Bit 0 */
#define  RCC_CFGR_HPRE_1                     (0x00000020UL)        /*!< Bit 1 */
#define  RCC_CFGR_HPRE_2                     (0x00000040UL)        /*!< Bit 2 */
#define  RCC_CFGR_HPRE_3                     (0x00000080UL)        /*!< Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  (0x00000000UL)        /*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  (0x00000080UL)        /*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  (0x00000090UL)        /*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  (0x000000A0UL)        /*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 (0x000000B0UL)        /*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 (0x000000C0UL)        /*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                (0x000000D0UL)        /*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                (0x000000E0UL)        /*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                (0x000000F0UL)        /*!< SYSCLK divided by 512 */

