Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*!< PPRE1 configuration */
#define  RCC_CFGR_PPRE1                      (0x00001C00UL)        /*!< PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_CFGR_PPRE1_0                    (0x00000400UL)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE1_1                    (0x00000800UL)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE1_2                    (0x00001000UL)        /*!< Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 (0x00000000UL)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 (0x00001000UL)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 (0x00001400UL)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 (0x00001800UL)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                (0x00001C00UL)        /*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define  RCC_CFGR_PPRE2                      (0x0000E000UL)        /*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    (0x00002000UL)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE2_1                    (0x00004000UL)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE2_2                    (0x00008000UL)        /*!< Bit 2 */

#define  RCC_CFGR_PPRE2_DIV1                 (0x00000000UL)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 (0x00008000UL)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 (0x0000A000UL)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 (0x0000C000UL)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                (0x0000E000UL)        /*!< HCLK divided by 16 */

/*!< RTCPRE configuration */
#define  RCC_CFGR_RTCPRE                     (0x001F0000UL)
#define  RCC_CFGR_RTCPRE_0                   (0x00010000UL)
#define  RCC_CFGR_RTCPRE_1                   (0x00020000UL)
#define  RCC_CFGR_RTCPRE_2                   (0x00040000UL)
#define  RCC_CFGR_RTCPRE_3                   (0x00080000UL)
#define  RCC_CFGR_RTCPRE_4                   (0x00100000UL)

/*!< MCO1 configuration */
#define  RCC_CFGR_MCO1                       (0x00600000UL)
#define  RCC_CFGR_MCO1_0                     (0x00200000UL)
#define  RCC_CFGR_MCO1_1                     (0x00400000UL)

#define  RCC_CFGR_I2SSRC                     (0x00800000UL)

#define  RCC_CFGR_MCO1PRE                    (0x07000000UL)
#define  RCC_CFGR_MCO1PRE_0                  (0x01000000UL)
#define  RCC_CFGR_MCO1PRE_1                  (0x02000000UL)
#define  RCC_CFGR_MCO1PRE_2                  (0x04000000UL)

#define  RCC_CFGR_MCO2PRE                    (0x38000000UL)
#define  RCC_CFGR_MCO2PRE_0                  (0x08000000UL)
#define  RCC_CFGR_MCO2PRE_1                  (0x10000000UL)
#define  RCC_CFGR_MCO2PRE_2                  (0x20000000UL)

#define  RCC_CFGR_MCO2                       (0xC0000000UL)
#define  RCC_CFGR_MCO2_0                     (0x40000000UL)
#define  RCC_CFGR_MCO2_1                     (0x80000000UL)

/********************  Bit definition for RCC_CIR register  *******************/
#define  RCC_CIR_LSIRDYF                     (0x00000001UL)
#define  RCC_CIR_LSERDYF                     (0x00000002UL)
#define  RCC_CIR_HSIRDYF                     (0x00000004UL)
#define  RCC_CIR_HSERDYF                     (0x00000008UL)
#define  RCC_CIR_PLLRDYF                     (0x00000010UL)
#define  RCC_CIR_PLLI2SRDYF                  (0x00000020UL)

#define  RCC_CIR_CSSF                        (0x00000080UL)
#define  RCC_CIR_LSIRDYIE                    (0x00000100UL)
#define  RCC_CIR_LSERDYIE                    (0x00000200UL)
#define  RCC_CIR_HSIRDYIE                    (0x00000400UL)
#define  RCC_CIR_HSERDYIE                    (0x00000800UL)
#define  RCC_CIR_PLLRDYIE                    (0x00001000UL)
#define  RCC_CIR_PLLI2SRDYIE                 (0x00002000UL)

#define  RCC_CIR_LSIRDYC                     (0x00010000UL)
#define  RCC_CIR_LSERDYC                     (0x00020000UL)
#define  RCC_CIR_HSIRDYC                     (0x00040000UL)
#define  RCC_CIR_HSERDYC                     (0x00080000UL)
#define  RCC_CIR_PLLRDYC                     (0x00100000UL)
#define  RCC_CIR_PLLI2SRDYC                  (0x00200000UL)

#define  RCC_CIR_CSSC                        (0x00800000UL)

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_GPIOARST               (0x00000001UL)
#define  RCC_AHB1RSTR_GPIOBRST               (0x00000002UL)
#define  RCC_AHB1RSTR_GPIOCRST               (0x00000004UL)
#define  RCC_AHB1RSTR_GPIODRST               (0x00000008UL)
#define  RCC_AHB1RSTR_GPIOERST               (0x00000010UL)
#define  RCC_AHB1RSTR_GPIOHRST               (0x00000080UL)
#define  RCC_AHB1RSTR_CRCRST                 (0x00001000UL)
#define  RCC_AHB1RSTR_DMA1RST                (0x00200000UL)
#define  RCC_AHB1RSTR_DMA2RST                (0x00400000UL)

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_OTGFSRST               (0x00000080UL)

/********************  Bit definition for RCC_AHB3RSTR register  **************/

/********************  Bit definition for RCC_APB1RSTR register  **************/
#define  RCC_APB1RSTR_TIM2RST                (0x00000001UL)
#define  RCC_APB1RSTR_TIM3RST                (0x00000002UL)
#define  RCC_APB1RSTR_TIM4RST                (0x00000004UL)
#define  RCC_APB1RSTR_TIM5RST                (0x00000008UL)
#define  RCC_APB1RSTR_WWDGRST                (0x00000800UL)
#define  RCC_APB1RSTR_SPI2RST                (0x00004000UL)
#define  RCC_APB1RSTR_SPI3RST                (0x00008000UL)
#define  RCC_APB1RSTR_USART2RST              (0x00020000UL)
#define  RCC_APB1RSTR_I2C1RST                (0x00200000UL)
#define  RCC_APB1RSTR_I2C2RST                (0x00400000UL)
#define  RCC_APB1RSTR_I2C3RST                (0x00800000UL)
#define  RCC_APB1RSTR_PWRRST                 (0x10000000UL)

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_TIM1RST                (0x00000001UL)
#define  RCC_APB2RSTR_USART1RST              (0x00000010UL)
#define  RCC_APB2RSTR_USART6RST              (0x00000020UL)
#define  RCC_APB2RSTR_ADCRST                 (0x00000100UL)
#define  RCC_APB2RSTR_SDIORST                (0x00000800UL)
#define  RCC_APB2RSTR_SPI1RST                (0x00001000UL)
#define  RCC_APB2RSTR_SPI4RST                (0x00002000UL)
#define  RCC_APB2RSTR_SYSCFGRST              (0x00004000UL)
#define  RCC_APB2RSTR_TIM9RST                (0x00010000UL)
#define  RCC_APB2RSTR_TIM10RST               (0x00020000UL)
#define  RCC_APB2RSTR_TIM11RST               (0x00040000UL)
#define  RCC_APB2RSTR_SPI5RST                (0x00100000UL)

/* Old SPI1RST bit definition, maintained for legacy purpose */
#define  RCC_APB2RSTR_SPI1                   RCC_APB2RSTR_SPI1RST

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_GPIOAEN                 (0x00000001UL)
#define  RCC_AHB1ENR_GPIOBEN                 (0x00000002UL)
#define  RCC_AHB1ENR_GPIOCEN                 (0x00000004UL)
#define  RCC_AHB1ENR_GPIODEN                 (0x00000008UL)
#define  RCC_AHB1ENR_GPIOEEN                 (0x00000010UL)
#define  RCC_AHB1ENR_GPIOHEN                 (0x00000080UL)
#define  RCC_AHB1ENR_CRCEN                   (0x00001000UL)
#define  RCC_AHB1ENR_BKPSRAMEN               (0x00040000UL)
#define  RCC_AHB1ENR_CCMDATARAMEN            (0x00100000UL)
#define  RCC_AHB1ENR_DMA1EN                  (0x00200000UL)
#define  RCC_AHB1ENR_DMA2EN                  (0x00400000UL)

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_OTGFSEN                 (0x00000080UL)

