Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bit definition for RCC_AHB3ENR register  ***************/

/********************  Bit definition for RCC_APB1ENR register  ***************/
#define  RCC_APB1ENR_TIM2EN                  (0x00000001UL)
#define  RCC_APB1ENR_TIM3EN                  (0x00000002UL)
#define  RCC_APB1ENR_TIM4EN                  (0x00000004UL)
#define  RCC_APB1ENR_TIM5EN                  (0x00000008UL)
#define  RCC_APB1ENR_WWDGEN                  (0x00000800UL)
#define  RCC_APB1ENR_SPI2EN                  (0x00004000UL)
#define  RCC_APB1ENR_SPI3EN                  (0x00008000UL)
#define  RCC_APB1ENR_USART2EN                (0x00020000UL)
#define  RCC_APB1ENR_I2C1EN                  (0x00200000UL)
#define  RCC_APB1ENR_I2C2EN                  (0x00400000UL)
#define  RCC_APB1ENR_I2C3EN                  (0x00800000UL)
#define  RCC_APB1ENR_PWREN                   (0x10000000UL)

/********************  Bit definition for RCC_APB2ENR register  ***************/
#define  RCC_APB2ENR_TIM1EN                  (0x00000001UL)
#define  RCC_APB2ENR_USART1EN                (0x00000010UL)
#define  RCC_APB2ENR_USART6EN                (0x00000020UL)
#define  RCC_APB2ENR_ADC1EN                  (0x00000100UL)
#define  RCC_APB2ENR_SDIOEN                  (0x00000800UL)
#define  RCC_APB2ENR_SPI1EN                  (0x00001000UL)
#define  RCC_APB2ENR_SPI4EN                  (0x00002000UL)
#define  RCC_APB2ENR_SYSCFGEN                (0x00004000UL)
#define  RCC_APB2ENR_TIM9EN                  (0x00010000UL)
#define  RCC_APB2ENR_TIM10EN                 (0x00020000UL)
#define  RCC_APB2ENR_TIM11EN                 (0x00040000UL)
#define  RCC_APB2ENR_SPI5EN                  (0x00100000UL)

/********************  Bit definition for RCC_AHB1LPENR register  *************/
#define  RCC_AHB1LPENR_GPIOALPEN             (0x00000001UL)
#define  RCC_AHB1LPENR_GPIOBLPEN             (0x00000002UL)
#define  RCC_AHB1LPENR_GPIOCLPEN             (0x00000004UL)
#define  RCC_AHB1LPENR_GPIODLPEN             (0x00000008UL)
#define  RCC_AHB1LPENR_GPIOELPEN             (0x00000010UL)
#define  RCC_AHB1LPENR_GPIOHLPEN             (0x00000080UL)
#define  RCC_AHB1LPENR_CRCLPEN               (0x00001000UL)
#define  RCC_AHB1LPENR_FLITFLPEN             (0x00008000UL)
#define  RCC_AHB1LPENR_SRAM1LPEN             (0x00010000UL)
#define  RCC_AHB1LPENR_SRAM2LPEN             (0x00020000UL)
#define  RCC_AHB1LPENR_BKPSRAMLPEN           (0x00040000UL)
#define  RCC_AHB1LPENR_DMA1LPEN              (0x00200000UL)
#define  RCC_AHB1LPENR_DMA2LPEN              (0x00400000UL)

/********************  Bit definition for RCC_AHB2LPENR register  *************/
#define  RCC_AHB2LPENR_OTGFSLPEN             (0x00000080UL)

/********************  Bit definition for RCC_AHB3LPENR register  *************/

/********************  Bit definition for RCC_APB1LPENR register  *************/
#define  RCC_APB1LPENR_TIM2LPEN              (0x00000001UL)
#define  RCC_APB1LPENR_TIM3LPEN              (0x00000002UL)
#define  RCC_APB1LPENR_TIM4LPEN              (0x00000004UL)
#define  RCC_APB1LPENR_TIM5LPEN              (0x00000008UL)
#define  RCC_APB1LPENR_WWDGLPEN              (0x00000800UL)
#define  RCC_APB1LPENR_SPI2LPEN              (0x00004000UL)
#define  RCC_APB1LPENR_SPI3LPEN              (0x00008000UL)
#define  RCC_APB1LPENR_USART2LPEN            (0x00020000UL)
#define  RCC_APB1LPENR_I2C1LPEN              (0x00200000UL)
#define  RCC_APB1LPENR_I2C2LPEN              (0x00400000UL)
#define  RCC_APB1LPENR_I2C3LPEN              (0x00800000UL)
#define  RCC_APB1LPENR_PWRLPEN               (0x10000000UL)
#define  RCC_APB1LPENR_DACLPEN               (0x20000000UL)

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define  RCC_APB2LPENR_TIM1LPEN              (0x00000001UL)
#define  RCC_APB2LPENR_USART1LPEN            (0x00000010UL)
#define  RCC_APB2LPENR_USART6LPEN            (0x00000020UL)
#define  RCC_APB2LPENR_ADC1LPEN              (0x00000100UL)
#define  RCC_APB2LPENR_SDIOLPEN              (0x00000800UL)
#define  RCC_APB2LPENR_SPI1LPEN              (0x00001000UL)
#define  RCC_APB2LPENR_SPI4LPEN              (0x00002000UL)
#define  RCC_APB2LPENR_SYSCFGLPEN            (0x00004000UL)
#define  RCC_APB2LPENR_TIM9LPEN              (0x00010000UL)
#define  RCC_APB2LPENR_TIM10LPEN             (0x00020000UL)
#define  RCC_APB2LPENR_TIM11LPEN             (0x00040000UL)
#define  RCC_APB2LPENR_SPI5LPEN              (0x00100000UL)

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      (0x00000001UL)
#define  RCC_BDCR_LSERDY                     (0x00000002UL)
#define  RCC_BDCR_LSEBYP                     (0x00000004UL)
#define  RCC_BDCR_LSEMOD                     (0x00000008UL)

#define  RCC_BDCR_RTCSEL                    (0x00000300UL)
#define  RCC_BDCR_RTCSEL_0                  (0x00000100UL)
#define  RCC_BDCR_RTCSEL_1                  (0x00000200UL)

#define  RCC_BDCR_RTCEN                      (0x00008000UL)
#define  RCC_BDCR_BDRST                      (0x00010000UL)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       (0x00000001UL)
#define  RCC_CSR_LSIRDY                      (0x00000002UL)
#define  RCC_CSR_RMVF                        (0x01000000UL)
#define  RCC_CSR_BORRSTF                     (0x02000000UL)
#define  RCC_CSR_PADRSTF                     (0x04000000UL)
#define  RCC_CSR_PORRSTF                     (0x08000000UL)
#define  RCC_CSR_SFTRSTF                     (0x10000000UL)
#define  RCC_CSR_WDGRSTF                     (0x20000000UL)
#define  RCC_CSR_WWDGRSTF                    (0x40000000UL)
#define  RCC_CSR_LPWRRSTF                    (0x80000000UL)

/********************  Bit definition for RCC_SSCGR register  *****************/
#define  RCC_SSCGR_MODPER                    (0x00001FFFUL)
#define  RCC_SSCGR_INCSTEP                   (0x0FFFE000UL)
#define  RCC_SSCGR_SPREADSEL                 (0x40000000UL)
#define  RCC_SSCGR_SSCGEN                    (0x80000000UL)

/********************  Bit definition for RCC_PLLI2SCFGR register  ************/
#define  RCC_PLLI2SCFGR_PLLI2SM              (0x0000003FUL)
#define  RCC_PLLI2SCFGR_PLLI2SM_0            (0x00000001UL)
#define  RCC_PLLI2SCFGR_PLLI2SM_1            (0x00000002UL)
#define  RCC_PLLI2SCFGR_PLLI2SM_2            (0x00000004UL)
#define  RCC_PLLI2SCFGR_PLLI2SM_3            (0x00000008UL)
#define  RCC_PLLI2SCFGR_PLLI2SM_4            (0x00000010UL)
#define  RCC_PLLI2SCFGR_PLLI2SM_5            (0x00000020UL)

#define  RCC_PLLI2SCFGR_PLLI2SN              (0x00007FC0UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_0            (0x00000040UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_1            (0x00000080UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_2            (0x00000100UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_3            (0x00000200UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_4            (0x00000400UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_5            (0x00000800UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_6            (0x00001000UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_7            (0x00002000UL)
#define  RCC_PLLI2SCFGR_PLLI2SN_8            (0x00004000UL)

#define  RCC_PLLI2SCFGR_PLLI2SR              (0x70000000UL)
#define  RCC_PLLI2SCFGR_PLLI2SR_0            (0x10000000UL)
#define  RCC_PLLI2SCFGR_PLLI2SR_1            (0x20000000UL)
#define  RCC_PLLI2SCFGR_PLLI2SR_2            (0x40000000UL)


/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTCUL)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            (0x00400000UL)
#define RTC_TR_HT                            (0x00300000UL)
#define RTC_TR_HT_0                          (0x00100000UL)
#define RTC_TR_HT_1                          (0x00200000UL)
#define RTC_TR_HU                            (0x000F0000UL)
#define RTC_TR_HU_0                          (0x00010000UL)
#define RTC_TR_HU_1                          (0x00020000UL)
#define RTC_TR_HU_2                          (0x00040000UL)
#define RTC_TR_HU_3                          (0x00080000UL)
#define RTC_TR_MNT                           (0x00007000UL)
#define RTC_TR_MNT_0                         (0x00001000UL)
#define RTC_TR_MNT_1                         (0x00002000UL)
#define RTC_TR_MNT_2                         (0x00004000UL)
#define RTC_TR_MNU                           (0x00000F00UL)
#define RTC_TR_MNU_0                         (0x00000100UL)
#define RTC_TR_MNU_1                         (0x00000200UL)
#define RTC_TR_MNU_2                         (0x00000400UL)
#define RTC_TR_MNU_3                         (0x00000800UL)
#define RTC_TR_ST                            (0x00000070UL)
#define RTC_TR_ST_0                          (0x00000010UL)
#define RTC_TR_ST_1                          (0x00000020UL)
#define RTC_TR_ST_2                          (0x00000040UL)
#define RTC_TR_SU                            (0x0000000FUL)
#define RTC_TR_SU_0                          (0x00000001UL)
#define RTC_TR_SU_1                          (0x00000002UL)
#define RTC_TR_SU_2                          (0x00000004UL)
#define RTC_TR_SU_3                          (0x00000008UL)

