Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bits definition for RTC_DR register  *******************/
#define RTC_DR_YT                            (0x00F00000UL)
#define RTC_DR_YT_0                          (0x00100000UL)
#define RTC_DR_YT_1                          (0x00200000UL)
#define RTC_DR_YT_2                          (0x00400000UL)
#define RTC_DR_YT_3                          (0x00800000UL)
#define RTC_DR_YU                            (0x000F0000UL)
#define RTC_DR_YU_0                          (0x00010000UL)
#define RTC_DR_YU_1                          (0x00020000UL)
#define RTC_DR_YU_2                          (0x00040000UL)
#define RTC_DR_YU_3                          (0x00080000UL)
#define RTC_DR_WDU                           (0x0000E000UL)
#define RTC_DR_WDU_0                         (0x00002000UL)
#define RTC_DR_WDU_1                         (0x00004000UL)
#define RTC_DR_WDU_2                         (0x00008000UL)
#define RTC_DR_MT                            (0x00001000UL)
#define RTC_DR_MU                            (0x00000F00UL)
#define RTC_DR_MU_0                          (0x00000100UL)
#define RTC_DR_MU_1                          (0x00000200UL)
#define RTC_DR_MU_2                          (0x00000400UL)
#define RTC_DR_MU_3                          (0x00000800UL)
#define RTC_DR_DT                            (0x00000030UL)
#define RTC_DR_DT_0                          (0x00000010UL)
#define RTC_DR_DT_1                          (0x00000020UL)
#define RTC_DR_DU                            (0x0000000FUL)
#define RTC_DR_DU_0                          (0x00000001UL)
#define RTC_DR_DU_1                          (0x00000002UL)
#define RTC_DR_DU_2                          (0x00000004UL)
#define RTC_DR_DU_3                          (0x00000008UL)

/********************  Bits definition for RTC_CR register  *******************/
#define RTC_CR_COE                           (0x00800000UL)
#define RTC_CR_OSEL                          (0x00600000UL)
#define RTC_CR_OSEL_0                        (0x00200000UL)
#define RTC_CR_OSEL_1                        (0x00400000UL)
#define RTC_CR_POL                           (0x00100000UL)
#define RTC_CR_COSEL                         (0x00080000UL)
#define RTC_CR_BCK                           (0x00040000UL)
#define RTC_CR_SUB1H                         (0x00020000UL)
#define RTC_CR_ADD1H                         (0x00010000UL)
#define RTC_CR_TSIE                          (0x00008000UL)
#define RTC_CR_WUTIE                         (0x00004000UL)
#define RTC_CR_ALRBIE                        (0x00002000UL)
#define RTC_CR_ALRAIE                        (0x00001000UL)
#define RTC_CR_TSE                           (0x00000800UL)
#define RTC_CR_WUTE                          (0x00000400UL)
#define RTC_CR_ALRBE                         (0x00000200UL)
#define RTC_CR_ALRAE                         (0x00000100UL)
#define RTC_CR_DCE                           (0x00000080UL)
#define RTC_CR_FMT                           (0x00000040UL)
#define RTC_CR_BYPSHAD                       (0x00000020UL)
#define RTC_CR_REFCKON                       (0x00000010UL)
#define RTC_CR_TSEDGE                        (0x00000008UL)
#define RTC_CR_WUCKSEL                       (0x00000007UL)
#define RTC_CR_WUCKSEL_0                     (0x00000001UL)
#define RTC_CR_WUCKSEL_1                     (0x00000002UL)
#define RTC_CR_WUCKSEL_2                     (0x00000004UL)

/********************  Bits definition for RTC_ISR register  ******************/
#define RTC_ISR_RECALPF                      (0x00010000UL)
#define RTC_ISR_TAMP1F                       (0x00002000UL)
#define RTC_ISR_TAMP2F                       (0x00004000UL)
#define RTC_ISR_TSOVF                        (0x00001000UL)
#define RTC_ISR_TSF                          (0x00000800UL)
#define RTC_ISR_WUTF                         (0x00000400UL)
#define RTC_ISR_ALRBF                        (0x00000200UL)
#define RTC_ISR_ALRAF                        (0x00000100UL)
#define RTC_ISR_INIT                         (0x00000080UL)
#define RTC_ISR_INITF                        (0x00000040UL)
#define RTC_ISR_RSF                          (0x00000020UL)
#define RTC_ISR_INITS                        (0x00000010UL)
#define RTC_ISR_SHPF                         (0x00000008UL)
#define RTC_ISR_WUTWF                        (0x00000004UL)
#define RTC_ISR_ALRBWF                       (0x00000002UL)
#define RTC_ISR_ALRAWF                       (0x00000001UL)

/********************  Bits definition for RTC_PRER register  *****************/
#define RTC_PRER_PREDIV_A                    (0x007F0000UL)
#define RTC_PRER_PREDIV_S                    (0x00007FFFUL)

/********************  Bits definition for RTC_WUTR register  *****************/
#define RTC_WUTR_WUT                         (0x0000FFFFUL)

/********************  Bits definition for RTC_CALIBR register  ***************/
#define RTC_CALIBR_DCS                       (0x00000080UL)
#define RTC_CALIBR_DC                        (0x0000001FUL)

/********************  Bits definition for RTC_ALRMAR register  ***************/
#define RTC_ALRMAR_MSK4                      (0x80000000UL)
#define RTC_ALRMAR_WDSEL                     (0x40000000UL)
#define RTC_ALRMAR_DT                        (0x30000000UL)
#define RTC_ALRMAR_DT_0                      (0x10000000UL)
#define RTC_ALRMAR_DT_1                      (0x20000000UL)
#define RTC_ALRMAR_DU                        (0x0F000000UL)
#define RTC_ALRMAR_DU_0                      (0x01000000UL)
#define RTC_ALRMAR_DU_1                      (0x02000000UL)
#define RTC_ALRMAR_DU_2                      (0x04000000UL)
#define RTC_ALRMAR_DU_3                      (0x08000000UL)
#define RTC_ALRMAR_MSK3                      (0x00800000UL)
#define RTC_ALRMAR_PM                        (0x00400000UL)
#define RTC_ALRMAR_HT                        (0x00300000UL)
#define RTC_ALRMAR_HT_0                      (0x00100000UL)
#define RTC_ALRMAR_HT_1                      (0x00200000UL)
#define RTC_ALRMAR_HU                        (0x000F0000UL)
#define RTC_ALRMAR_HU_0                      (0x00010000UL)
#define RTC_ALRMAR_HU_1                      (0x00020000UL)
#define RTC_ALRMAR_HU_2                      (0x00040000UL)
#define RTC_ALRMAR_HU_3                      (0x00080000UL)
#define RTC_ALRMAR_MSK2                      (0x00008000UL)
#define RTC_ALRMAR_MNT                       (0x00007000UL)
#define RTC_ALRMAR_MNT_0                     (0x00001000UL)
#define RTC_ALRMAR_MNT_1                     (0x00002000UL)
#define RTC_ALRMAR_MNT_2                     (0x00004000UL)
#define RTC_ALRMAR_MNU                       (0x00000F00UL)
#define RTC_ALRMAR_MNU_0                     (0x00000100UL)
#define RTC_ALRMAR_MNU_1                     (0x00000200UL)
#define RTC_ALRMAR_MNU_2                     (0x00000400UL)
#define RTC_ALRMAR_MNU_3                     (0x00000800UL)
#define RTC_ALRMAR_MSK1                      (0x00000080UL)
#define RTC_ALRMAR_ST                        (0x00000070UL)
#define RTC_ALRMAR_ST_0                      (0x00000010UL)
#define RTC_ALRMAR_ST_1                      (0x00000020UL)
#define RTC_ALRMAR_ST_2                      (0x00000040UL)
#define RTC_ALRMAR_SU                        (0x0000000FUL)
#define RTC_ALRMAR_SU_0                      (0x00000001UL)
#define RTC_ALRMAR_SU_1                      (0x00000002UL)
#define RTC_ALRMAR_SU_2                      (0x00000004UL)
#define RTC_ALRMAR_SU_3                      (0x00000008UL)

/********************  Bits definition for RTC_ALRMBR register  ***************/
#define RTC_ALRMBR_MSK4                      (0x80000000UL)
#define RTC_ALRMBR_WDSEL                     (0x40000000UL)
#define RTC_ALRMBR_DT                        (0x30000000UL)
#define RTC_ALRMBR_DT_0                      (0x10000000UL)
#define RTC_ALRMBR_DT_1                      (0x20000000UL)
#define RTC_ALRMBR_DU                        (0x0F000000UL)
#define RTC_ALRMBR_DU_0                      (0x01000000UL)
#define RTC_ALRMBR_DU_1                      (0x02000000UL)
#define RTC_ALRMBR_DU_2                      (0x04000000UL)
#define RTC_ALRMBR_DU_3                      (0x08000000UL)
#define RTC_ALRMBR_MSK3                      (0x00800000UL)
#define RTC_ALRMBR_PM                        (0x00400000UL)
#define RTC_ALRMBR_HT                        (0x00300000UL)
#define RTC_ALRMBR_HT_0                      (0x00100000UL)
#define RTC_ALRMBR_HT_1                      (0x00200000UL)
#define RTC_ALRMBR_HU                        (0x000F0000UL)
#define RTC_ALRMBR_HU_0                      (0x00010000UL)
#define RTC_ALRMBR_HU_1                      (0x00020000UL)
#define RTC_ALRMBR_HU_2                      (0x00040000UL)
#define RTC_ALRMBR_HU_3                      (0x00080000UL)
#define RTC_ALRMBR_MSK2                      (0x00008000UL)
#define RTC_ALRMBR_MNT                       (0x00007000UL)
#define RTC_ALRMBR_MNT_0                     (0x00001000UL)
#define RTC_ALRMBR_MNT_1                     (0x00002000UL)
#define RTC_ALRMBR_MNT_2                     (0x00004000UL)
#define RTC_ALRMBR_MNU                       (0x00000F00UL)
#define RTC_ALRMBR_MNU_0                     (0x00000100UL)
#define RTC_ALRMBR_MNU_1                     (0x00000200UL)
#define RTC_ALRMBR_MNU_2                     (0x00000400UL)
#define RTC_ALRMBR_MNU_3                     (0x00000800UL)
#define RTC_ALRMBR_MSK1                      (0x00000080UL)
#define RTC_ALRMBR_ST                        (0x00000070UL)
#define RTC_ALRMBR_ST_0                      (0x00000010UL)
#define RTC_ALRMBR_ST_1                      (0x00000020UL)
#define RTC_ALRMBR_ST_2                      (0x00000040UL)
#define RTC_ALRMBR_SU                        (0x0000000FUL)
#define RTC_ALRMBR_SU_0                      (0x00000001UL)
#define RTC_ALRMBR_SU_1                      (0x00000002UL)
#define RTC_ALRMBR_SU_2                      (0x00000004UL)
#define RTC_ALRMBR_SU_3                      (0x00000008UL)

