Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bits definition for RTC_WPR register  ******************/
#define RTC_WPR_KEY                          (0x000000FFUL)

/********************  Bits definition for RTC_SSR register  ******************/
#define RTC_SSR_SS                           (0x0000FFFFUL)

/********************  Bits definition for RTC_SHIFTR register  ***************/
#define RTC_SHIFTR_SUBFS                     (0x00007FFFUL)
#define RTC_SHIFTR_ADD1S                     (0x80000000UL)

/********************  Bits definition for RTC_TSTR register  *****************/
#define RTC_TSTR_PM                          (0x00400000UL)
#define RTC_TSTR_HT                          (0x00300000UL)
#define RTC_TSTR_HT_0                        (0x00100000UL)
#define RTC_TSTR_HT_1                        (0x00200000UL)
#define RTC_TSTR_HU                          (0x000F0000UL)
#define RTC_TSTR_HU_0                        (0x00010000UL)
#define RTC_TSTR_HU_1                        (0x00020000UL)
#define RTC_TSTR_HU_2                        (0x00040000UL)
#define RTC_TSTR_HU_3                        (0x00080000UL)
#define RTC_TSTR_MNT                         (0x00007000UL)
#define RTC_TSTR_MNT_0                       (0x00001000UL)
#define RTC_TSTR_MNT_1                       (0x00002000UL)
#define RTC_TSTR_MNT_2                       (0x00004000UL)
#define RTC_TSTR_MNU                         (0x00000F00UL)
#define RTC_TSTR_MNU_0                       (0x00000100UL)
#define RTC_TSTR_MNU_1                       (0x00000200UL)
#define RTC_TSTR_MNU_2                       (0x00000400UL)
#define RTC_TSTR_MNU_3                       (0x00000800UL)
#define RTC_TSTR_ST                          (0x00000070UL)
#define RTC_TSTR_ST_0                        (0x00000010UL)
#define RTC_TSTR_ST_1                        (0x00000020UL)
#define RTC_TSTR_ST_2                        (0x00000040UL)
#define RTC_TSTR_SU                          (0x0000000FUL)
#define RTC_TSTR_SU_0                        (0x00000001UL)
#define RTC_TSTR_SU_1                        (0x00000002UL)
#define RTC_TSTR_SU_2                        (0x00000004UL)
#define RTC_TSTR_SU_3                        (0x00000008UL)

/********************  Bits definition for RTC_TSDR register  *****************/
#define RTC_TSDR_WDU                         (0x0000E000UL)
#define RTC_TSDR_WDU_0                       (0x00002000UL)
#define RTC_TSDR_WDU_1                       (0x00004000UL)
#define RTC_TSDR_WDU_2                       (0x00008000UL)
#define RTC_TSDR_MT                          (0x00001000UL)
#define RTC_TSDR_MU                          (0x00000F00UL)
#define RTC_TSDR_MU_0                        (0x00000100UL)
#define RTC_TSDR_MU_1                        (0x00000200UL)
#define RTC_TSDR_MU_2                        (0x00000400UL)
#define RTC_TSDR_MU_3                        (0x00000800UL)
#define RTC_TSDR_DT                          (0x00000030UL)
#define RTC_TSDR_DT_0                        (0x00000010UL)
#define RTC_TSDR_DT_1                        (0x00000020UL)
#define RTC_TSDR_DU                          (0x0000000FUL)
#define RTC_TSDR_DU_0                        (0x00000001UL)
#define RTC_TSDR_DU_1                        (0x00000002UL)
#define RTC_TSDR_DU_2                        (0x00000004UL)
#define RTC_TSDR_DU_3                        (0x00000008UL)

/********************  Bits definition for RTC_TSSSR register  ****************/
#define RTC_TSSSR_SS                         (0x0000FFFFUL)

/********************  Bits definition for RTC_CAL register  *****************/
#define RTC_CALR_CALP                        (0x00008000UL)
#define RTC_CALR_CALW8                       (0x00004000UL)
#define RTC_CALR_CALW16                      (0x00002000UL)
#define RTC_CALR_CALM                        (0x000001FFUL)
#define RTC_CALR_CALM_0                      (0x00000001UL)
#define RTC_CALR_CALM_1                      (0x00000002UL)
#define RTC_CALR_CALM_2                      (0x00000004UL)
#define RTC_CALR_CALM_3                      (0x00000008UL)
#define RTC_CALR_CALM_4                      (0x00000010UL)
#define RTC_CALR_CALM_5                      (0x00000020UL)
#define RTC_CALR_CALM_6                      (0x00000040UL)
#define RTC_CALR_CALM_7                      (0x00000080UL)
#define RTC_CALR_CALM_8                      (0x00000100UL)

/********************  Bits definition for RTC_TAFCR register  ****************/
#define RTC_TAFCR_ALARMOUTTYPE               (0x00040000UL)
#define RTC_TAFCR_TSINSEL                    (0x00020000UL)
#define RTC_TAFCR_TAMPINSEL                  (0x00010000UL)
#define RTC_TAFCR_TAMPPUDIS                  (0x00008000UL)
#define RTC_TAFCR_TAMPPRCH                   (0x00006000UL)
#define RTC_TAFCR_TAMPPRCH_0                 (0x00002000UL)
#define RTC_TAFCR_TAMPPRCH_1                 (0x00004000UL)
#define RTC_TAFCR_TAMPFLT                    (0x00001800UL)
#define RTC_TAFCR_TAMPFLT_0                  (0x00000800UL)
#define RTC_TAFCR_TAMPFLT_1                  (0x00001000UL)
#define RTC_TAFCR_TAMPFREQ                   (0x00000700UL)
#define RTC_TAFCR_TAMPFREQ_0                 (0x00000100UL)
#define RTC_TAFCR_TAMPFREQ_1                 (0x00000200UL)
#define RTC_TAFCR_TAMPFREQ_2                 (0x00000400UL)
#define RTC_TAFCR_TAMPTS                     (0x00000080UL)
#define RTC_TAFCR_TAMP2TRG                   (0x00000010UL)
#define RTC_TAFCR_TAMP2E                     (0x00000008UL)
#define RTC_TAFCR_TAMPIE                     (0x00000004UL)
#define RTC_TAFCR_TAMP1TRG                   (0x00000002UL)
#define RTC_TAFCR_TAMP1E                     (0x00000001UL)

/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS                  (0x0F000000UL)
#define RTC_ALRMASSR_MASKSS_0                (0x01000000UL)
#define RTC_ALRMASSR_MASKSS_1                (0x02000000UL)
#define RTC_ALRMASSR_MASKSS_2                (0x04000000UL)
#define RTC_ALRMASSR_MASKSS_3                (0x08000000UL)
#define RTC_ALRMASSR_SS                      (0x00007FFFUL)

