Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_MASKSS                  (0x0F000000UL)
#define RTC_ALRMBSSR_MASKSS_0                (0x01000000UL)
#define RTC_ALRMBSSR_MASKSS_1                (0x02000000UL)
#define RTC_ALRMBSSR_MASKSS_2                (0x04000000UL)
#define RTC_ALRMBSSR_MASKSS_3                (0x08000000UL)
#define RTC_ALRMBSSR_SS                      (0x00007FFFUL)

/********************  Bits definition for RTC_BKP0R register  ****************/
#define RTC_BKP0R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP1R register  ****************/
#define RTC_BKP1R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP2R register  ****************/
#define RTC_BKP2R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP3R register  ****************/
#define RTC_BKP3R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP4R register  ****************/
#define RTC_BKP4R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP5R register  ****************/
#define RTC_BKP5R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP6R register  ****************/
#define RTC_BKP6R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP7R register  ****************/
#define RTC_BKP7R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP8R register  ****************/
#define RTC_BKP8R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP9R register  ****************/
#define RTC_BKP9R                            (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP10R register  ***************/
#define RTC_BKP10R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP11R register  ***************/
#define RTC_BKP11R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP12R register  ***************/
#define RTC_BKP12R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP13R register  ***************/
#define RTC_BKP13R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP14R register  ***************/
#define RTC_BKP14R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP15R register  ***************/
#define RTC_BKP15R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP16R register  ***************/
#define RTC_BKP16R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP17R register  ***************/
#define RTC_BKP17R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP18R register  ***************/
#define RTC_BKP18R                           (0xFFFFFFFFUL)

/********************  Bits definition for RTC_BKP19R register  ***************/
#define RTC_BKP19R                           (0xFFFFFFFFUL)



/******************************************************************************/
/*                                                                            */
/*                          SD host Interface                                 */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SDIO_POWER register  ******************/
#define  SDIO_POWER_PWRCTRL                  (0x03UL)               /*!<PWRCTRL[1:0] bits (Power supply control bits) */
#define  SDIO_POWER_PWRCTRL_0                (0x01UL)               /*!<Bit 0 */
#define  SDIO_POWER_PWRCTRL_1                (0x02UL)               /*!<Bit 1 */

/******************  Bit definition for SDIO_CLKCR register  ******************/
#define  SDIO_CLKCR_CLKDIV                   (0x00FFUL)            /*!<Clock divide factor             */
#define  SDIO_CLKCR_CLKEN                    (0x0100UL)            /*!<Clock enable bit                */
#define  SDIO_CLKCR_PWRSAV                   (0x0200UL)            /*!<Power saving configuration bit  */
#define  SDIO_CLKCR_BYPASS                   (0x0400UL)            /*!<Clock divider bypass enable bit */

#define  SDIO_CLKCR_WIDBUS                   (0x1800UL)            /*!<WIDBUS[1:0] bits (Wide bus mode enable bit) */
#define  SDIO_CLKCR_WIDBUS_0                 (0x0800UL)            /*!<Bit 0 */
#define  SDIO_CLKCR_WIDBUS_1                 (0x1000UL)            /*!<Bit 1 */

#define  SDIO_CLKCR_NEGEDGE                  (0x2000UL)            /*!<SDIO_CK dephasing selection bit */
#define  SDIO_CLKCR_HWFC_EN                  (0x4000UL)            /*!<HW Flow Control enable          */

/*******************  Bit definition for SDIO_ARG register  *******************/
#define  SDIO_ARG_CMDARG                     (0xFFFFFFFFUL)            /*!<Command argument */

/*******************  Bit definition for SDIO_CMD register  *******************/
#define  SDIO_CMD_CMDINDEX                   (0x003FUL)            /*!<Command Index                               */

#define  SDIO_CMD_WAITRESP                   (0x00C0UL)            /*!<WAITRESP[1:0] bits (Wait for response bits) */
#define  SDIO_CMD_WAITRESP_0                 (0x0040UL)            /*!< Bit 0 */
#define  SDIO_CMD_WAITRESP_1                 (0x0080UL)            /*!< Bit 1 */

#define  SDIO_CMD_WAITINT                    (0x0100UL)            /*!<CPSM Waits for Interrupt Request                               */
#define  SDIO_CMD_WAITPEND                   (0x0200UL)            /*!<CPSM Waits for ends of data transfer (CmdPend internal signal) */
#define  SDIO_CMD_CPSMEN                     (0x0400UL)            /*!<Command path state machine (CPSM) Enable bit                   */
#define  SDIO_CMD_SDIOSUSPEND                (0x0800UL)            /*!<SD I/O suspend command                                         */
#define  SDIO_CMD_ENCMDCOMPL                 (0x1000UL)            /*!<Enable CMD completion                                          */
#define  SDIO_CMD_NIEN                       (0x2000UL)            /*!<Not Interrupt Enable */
#define  SDIO_CMD_CEATACMD                   (0x4000UL)            /*!<CE-ATA command       */

/*****************  Bit definition for SDIO_RESPCMD register  *****************/
#define  SDIO_RESPCMD_RESPCMD                (0x3FUL)               /*!<Response command index */

/******************  Bit definition for SDIO_RESP0 register  ******************/
#define  SDIO_RESP0_CARDSTATUS0              (0xFFFFFFFFUL)        /*!<Card Status */

