Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/******************  Bit definition for SDIO_RESP1 register  ******************/
#define  SDIO_RESP1_CARDSTATUS1              (0xFFFFFFFFUL)        /*!<Card Status */

/******************  Bit definition for SDIO_RESP2 register  ******************/
#define  SDIO_RESP2_CARDSTATUS2              (0xFFFFFFFFUL)        /*!<Card Status */

/******************  Bit definition for SDIO_RESP3 register  ******************/
#define  SDIO_RESP3_CARDSTATUS3              (0xFFFFFFFFUL)        /*!<Card Status */

/******************  Bit definition for SDIO_RESP4 register  ******************/
#define  SDIO_RESP4_CARDSTATUS4              (0xFFFFFFFFUL)        /*!<Card Status */

/******************  Bit definition for SDIO_DTIMER register  *****************/
#define  SDIO_DTIMER_DATATIME                (0xFFFFFFFFUL)        /*!<Data timeout period. */

/******************  Bit definition for SDIO_DLEN register  *******************/
#define  SDIO_DLEN_DATALENGTH                (0x01FFFFFFUL)        /*!<Data length value    */

/******************  Bit definition for SDIO_DCTRL register  ******************/
#define  SDIO_DCTRL_DTEN                     (0x0001UL)            /*!<Data transfer enabled bit         */
#define  SDIO_DCTRL_DTDIR                    (0x0002UL)            /*!<Data transfer direction selection */
#define  SDIO_DCTRL_DTMODE                   (0x0004UL)            /*!<Data transfer mode selection      */
#define  SDIO_DCTRL_DMAEN                    (0x0008UL)            /*!<DMA enabled bit                   */

#define  SDIO_DCTRL_DBLOCKSIZE               (0x00F0UL)            /*!<DBLOCKSIZE[3:0] bits (Data block size) */
#define  SDIO_DCTRL_DBLOCKSIZE_0             (0x0010UL)            /*!<Bit 0 */
#define  SDIO_DCTRL_DBLOCKSIZE_1             (0x0020UL)            /*!<Bit 1 */
#define  SDIO_DCTRL_DBLOCKSIZE_2             (0x0040UL)            /*!<Bit 2 */
#define  SDIO_DCTRL_DBLOCKSIZE_3             (0x0080UL)            /*!<Bit 3 */

#define  SDIO_DCTRL_RWSTART                  (0x0100UL)            /*!<Read wait start         */
#define  SDIO_DCTRL_RWSTOP                   (0x0200UL)            /*!<Read wait stop          */
#define  SDIO_DCTRL_RWMOD                    (0x0400UL)            /*!<Read wait mode          */
#define  SDIO_DCTRL_SDIOEN                   (0x0800UL)            /*!<SD I/O enable functions */

/******************  Bit definition for SDIO_DCOUNT register  *****************/
#define  SDIO_DCOUNT_DATACOUNT               (0x01FFFFFFUL)        /*!<Data count value */

/******************  Bit definition for SDIO_STA register  ********************/
#define  SDIO_STA_CCRCFAIL                   (0x00000001UL)        /*!<Command response received (CRC check failed)  */
#define  SDIO_STA_DCRCFAIL                   (0x00000002UL)        /*!<Data block sent/received (CRC check failed)   */
#define  SDIO_STA_CTIMEOUT                   (0x00000004UL)        /*!<Command response timeout                      */
#define  SDIO_STA_DTIMEOUT                   (0x00000008UL)        /*!<Data timeout                                  */
#define  SDIO_STA_TXUNDERR                   (0x00000010UL)        /*!<Transmit FIFO underrun error                  */
#define  SDIO_STA_RXOVERR                    (0x00000020UL)        /*!<Received FIFO overrun error                   */
#define  SDIO_STA_CMDREND                    (0x00000040UL)        /*!<Command response received (CRC check passed)  */
#define  SDIO_STA_CMDSENT                    (0x00000080UL)        /*!<Command sent (no response required)           */
#define  SDIO_STA_DATAEND                    (0x00000100UL)        /*!<Data end (data counter, SDIDCOUNT, is zero)   */
#define  SDIO_STA_STBITERR                   (0x00000200UL)        /*!<Start bit not detected on all data signals in wide bus mode */
#define  SDIO_STA_DBCKEND                    (0x00000400UL)        /*!<Data block sent/received (CRC check passed)   */
#define  SDIO_STA_CMDACT                     (0x00000800UL)        /*!<Command transfer in progress                  */
#define  SDIO_STA_TXACT                      (0x00001000UL)        /*!<Data transmit in progress                     */
#define  SDIO_STA_RXACT                      (0x00002000UL)        /*!<Data receive in progress                      */
#define  SDIO_STA_TXFIFOHE                   (0x00004000UL)        /*!<Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
#define  SDIO_STA_RXFIFOHF                   (0x00008000UL)        /*!<Receive FIFO Half Full: there are at least 8 words in the FIFO */
#define  SDIO_STA_TXFIFOF                    (0x00010000UL)        /*!<Transmit FIFO full                            */
#define  SDIO_STA_RXFIFOF                    (0x00020000UL)        /*!<Receive FIFO full                             */
#define  SDIO_STA_TXFIFOE                    (0x00040000UL)        /*!<Transmit FIFO empty                           */
#define  SDIO_STA_RXFIFOE                    (0x00080000UL)        /*!<Receive FIFO empty                            */
#define  SDIO_STA_TXDAVL                     (0x00100000UL)        /*!<Data available in transmit FIFO               */
#define  SDIO_STA_RXDAVL                     (0x00200000UL)        /*!<Data available in receive FIFO                */
#define  SDIO_STA_SDIOIT                     (0x00400000UL)        /*!<SDIO interrupt received                       */
#define  SDIO_STA_CEATAEND                   (0x00800000UL)        /*!<CE-ATA command completion signal received for CMD61 */

/*******************  Bit definition for SDIO_ICR register  *******************/
#define  SDIO_ICR_CCRCFAILC                  (0x00000001UL)        /*!<CCRCFAIL flag clear bit */
#define  SDIO_ICR_DCRCFAILC                  (0x00000002UL)        /*!<DCRCFAIL flag clear bit */
#define  SDIO_ICR_CTIMEOUTC                  (0x00000004UL)        /*!<CTIMEOUT flag clear bit */
#define  SDIO_ICR_DTIMEOUTC                  (0x00000008UL)        /*!<DTIMEOUT flag clear bit */
#define  SDIO_ICR_TXUNDERRC                  (0x00000010UL)        /*!<TXUNDERR flag clear bit */
#define  SDIO_ICR_RXOVERRC                   (0x00000020UL)        /*!<RXOVERR flag clear bit  */
#define  SDIO_ICR_CMDRENDC                   (0x00000040UL)        /*!<CMDREND flag clear bit  */
#define  SDIO_ICR_CMDSENTC                   (0x00000080UL)        /*!<CMDSENT flag clear bit  */
#define  SDIO_ICR_DATAENDC                   (0x00000100UL)        /*!<DATAEND flag clear bit  */
#define  SDIO_ICR_STBITERRC                  (0x00000200UL)        /*!<STBITERR flag clear bit */
#define  SDIO_ICR_DBCKENDC                   (0x00000400UL)        /*!<DBCKEND flag clear bit  */
#define  SDIO_ICR_SDIOITC                    (0x00400000UL)        /*!<SDIOIT flag clear bit   */
#define  SDIO_ICR_CEATAENDC                  (0x00800000UL)        /*!<CEATAEND flag clear bit */

/******************  Bit definition for SDIO_MASK register  *******************/
#define  SDIO_MASK_CCRCFAILIE                (0x00000001UL)        /*!<Command CRC Fail Interrupt Enable          */
#define  SDIO_MASK_DCRCFAILIE                (0x00000002UL)        /*!<Data CRC Fail Interrupt Enable             */
#define  SDIO_MASK_CTIMEOUTIE                (0x00000004UL)        /*!<Command TimeOut Interrupt Enable           */
#define  SDIO_MASK_DTIMEOUTIE                (0x00000008UL)        /*!<Data TimeOut Interrupt Enable              */
#define  SDIO_MASK_TXUNDERRIE                (0x00000010UL)        /*!<Tx FIFO UnderRun Error Interrupt Enable    */
#define  SDIO_MASK_RXOVERRIE                 (0x00000020UL)        /*!<Rx FIFO OverRun Error Interrupt Enable     */
#define  SDIO_MASK_CMDRENDIE                 (0x00000040UL)        /*!<Command Response Received Interrupt Enable */
#define  SDIO_MASK_CMDSENTIE                 (0x00000080UL)        /*!<Command Sent Interrupt Enable              */
#define  SDIO_MASK_DATAENDIE                 (0x00000100UL)        /*!<Data End Interrupt Enable                  */
#define  SDIO_MASK_STBITERRIE                (0x00000200UL)        /*!<Start Bit Error Interrupt Enable           */
#define  SDIO_MASK_DBCKENDIE                 (0x00000400UL)        /*!<Data Block End Interrupt Enable            */
#define  SDIO_MASK_CMDACTIE                  (0x00000800UL)        /*!<CCommand Acting Interrupt Enable           */
#define  SDIO_MASK_TXACTIE                   (0x00001000UL)        /*!<Data Transmit Acting Interrupt Enable      */
#define  SDIO_MASK_RXACTIE                   (0x00002000UL)        /*!<Data receive acting interrupt enabled      */
#define  SDIO_MASK_TXFIFOHEIE                (0x00004000UL)        /*!<Tx FIFO Half Empty interrupt Enable        */
#define  SDIO_MASK_RXFIFOHFIE                (0x00008000UL)        /*!<Rx FIFO Half Full interrupt Enable         */
#define  SDIO_MASK_TXFIFOFIE                 (0x00010000UL)        /*!<Tx FIFO Full interrupt Enable              */
#define  SDIO_MASK_RXFIFOFIE                 (0x00020000UL)        /*!<Rx FIFO Full interrupt Enable              */
#define  SDIO_MASK_TXFIFOEIE                 (0x00040000UL)        /*!<Tx FIFO Empty interrupt Enable             */
#define  SDIO_MASK_RXFIFOEIE                 (0x00080000UL)        /*!<Rx FIFO Empty interrupt Enable             */
#define  SDIO_MASK_TXDAVLIE                  (0x00100000UL)        /*!<Data available in Tx FIFO interrupt Enable */
#define  SDIO_MASK_RXDAVLIE                  (0x00200000UL)        /*!<Data available in Rx FIFO interrupt Enable */
#define  SDIO_MASK_SDIOITIE                  (0x00400000UL)        /*!<SDIO Mode Interrupt Received interrupt Enable */
#define  SDIO_MASK_CEATAENDIE                (0x00800000UL)        /*!<CE-ATA command completion signal received Interrupt Enable */

/*****************  Bit definition for SDIO_FIFOCNT register  *****************/
#define  SDIO_FIFOCNT_FIFOCOUNT              (0x00FFFFFFUL)        /*!<Remaining number of words to be written to or read from the FIFO */

/******************  Bit definition for SDIO_FIFO register  *******************/
#define  SDIO_FIFO_FIFODATA                  (0xFFFFFFFFUL)        /*!<Receive and transmit FIFO data */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_CR1 register  ********************/
#define  SPI_CR1_CPHA                        (0x00000001UL)            /*!<Clock Phase      */
#define  SPI_CR1_CPOL                        (0x00000002UL)            /*!<Clock Polarity   */
#define  SPI_CR1_MSTR                        (0x00000004UL)            /*!<Master Selection */

#define  SPI_CR1_BR                          (0x00000038UL)            /*!<BR[2:0] bits (Baud Rate Control) */
#define  SPI_CR1_BR_0                        (0x00000008UL)            /*!<Bit 0 */
#define  SPI_CR1_BR_1                        (0x00000010UL)            /*!<Bit 1 */
#define  SPI_CR1_BR_2                        (0x00000020UL)            /*!<Bit 2 */

#define  SPI_CR1_SPE                         (0x00000040UL)            /*!<SPI Enable                          */
#define  SPI_CR1_LSBFIRST                    (0x00000080UL)            /*!<Frame Format                        */
#define  SPI_CR1_SSI                         (0x00000100UL)            /*!<Internal slave select               */
#define  SPI_CR1_SSM                         (0x00000200UL)            /*!<Software slave management           */
#define  SPI_CR1_RXONLY                      (0x00000400UL)            /*!<Receive only                        */
#define  SPI_CR1_DFF                         (0x00000800UL)            /*!<Data Frame Format                   */
#define  SPI_CR1_CRCNEXT                     (0x00001000UL)            /*!<Transmit CRC next                   */
#define  SPI_CR1_CRCEN                       (0x00002000UL)            /*!<Hardware CRC calculation enable     */
#define  SPI_CR1_BIDIOE                      (0x00004000UL)            /*!<Output enable in bidirectional mode */
#define  SPI_CR1_BIDIMODE                    (0x00008000UL)            /*!<Bidirectional data mode enable      */

