Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*******************  Bit definition for SPI_CR2 register  ********************/
#define  SPI_CR2_RXDMAEN                     (0x00000001UL)               /*!<Rx Buffer DMA Enable                 */
#define  SPI_CR2_TXDMAEN                     (0x00000002UL)               /*!<Tx Buffer DMA Enable                 */
#define  SPI_CR2_SSOE                        (0x00000004UL)               /*!<SS Output Enable                     */
#define  SPI_CR2_FRF                         (0x00000010UL)               /*!<Frame Format                         */
#define  SPI_CR2_ERRIE                       (0x00000020UL)               /*!<Error Interrupt Enable               */
#define  SPI_CR2_RXNEIE                      (0x00000040UL)               /*!<RX buffer Not Empty Interrupt Enable */
#define  SPI_CR2_TXEIE                       (0x00000080UL)               /*!<Tx buffer Empty Interrupt Enable     */

/********************  Bit definition for SPI_SR register  ********************/
#define  SPI_SR_RXNE                         (0x00000001UL)               /*!<Receive buffer Not Empty */
#define  SPI_SR_TXE                          (0x00000002UL)               /*!<Transmit buffer Empty    */
#define  SPI_SR_CHSIDE                       (0x00000004UL)               /*!<Channel side             */
#define  SPI_SR_UDR                          (0x00000008UL)               /*!<Underrun flag            */
#define  SPI_SR_CRCERR                       (0x00000010UL)               /*!<CRC Error flag           */
#define  SPI_SR_MODF                         (0x00000020UL)               /*!<Mode fault               */
#define  SPI_SR_OVR                          (0x00000040UL)               /*!<Overrun flag             */
#define  SPI_SR_BSY                          (0x00000080UL)               /*!<Busy flag                */
#define  SPI_SR_FRE                          (0x00000100UL)               /*!<Frame format error flag  */

/********************  Bit definition for SPI_DR register  ********************/
#define  SPI_DR_DR                           (0x0000FFFFUL)            /*!<Data Register           */

/*******************  Bit definition for SPI_CRCPR register  ******************/
#define  SPI_CRCPR_CRCPOLY                   (0x0000FFFFUL)            /*!<CRC polynomial register */

/******************  Bit definition for SPI_RXCRCR register  ******************/
#define  SPI_RXCRCR_RXCRC                    (0x0000FFFFUL)            /*!<Rx CRC Register         */

/******************  Bit definition for SPI_TXCRCR register  ******************/
#define  SPI_TXCRCR_TXCRC                    (0x0000FFFFUL)            /*!<Tx CRC Register         */

/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define  SPI_I2SCFGR_CHLEN                   (0x00000001UL)            /*!<Channel length (number of bits per audio channel) */

#define  SPI_I2SCFGR_DATLEN                  (0x00000006UL)            /*!<DATLEN[1:0] bits (Data length to be transferred)  */
#define  SPI_I2SCFGR_DATLEN_0                (0x00000002UL)            /*!<Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                (0x00000004UL)            /*!<Bit 1 */

#define  SPI_I2SCFGR_CKPOL                   (0x00000008UL)            /*!<steady state clock polarity               */

#define  SPI_I2SCFGR_I2SSTD                  (0x00000030UL)            /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                (0x00000010UL)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                (0x00000020UL)            /*!<Bit 1 */

#define  SPI_I2SCFGR_PCMSYNC                 (0x00000080UL)            /*!<PCM frame synchronization                 */

#define  SPI_I2SCFGR_I2SCFG                  (0x00000300UL)            /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                (0x00000100UL)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                (0x00000200UL)            /*!<Bit 1 */

#define  SPI_I2SCFGR_I2SE                    (0x00000400UL)            /*!<I2S Enable         */
#define  SPI_I2SCFGR_I2SMOD                  (0x00000800UL)            /*!<I2S mode selection */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define  SPI_I2SPR_I2SDIV                    (0x000000FFUL)            /*!<I2S Linear prescaler         */
#define  SPI_I2SPR_ODD                       (0x00000100UL)            /*!<Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     (0x00000200UL)            /*!<Master Clock Output Enable   */

/******************************************************************************/
/*                                                                            */
/*                                 SYSCFG                                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SYSCFG_MEMRMP register  ***************/
#define SYSCFG_MEMRMP_MEM_MODE          (0x00000007UL) /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_MEMRMP_MEM_MODE_0        (0x00000001UL)
#define SYSCFG_MEMRMP_MEM_MODE_1        (0x00000002UL)
#define SYSCFG_MEMRMP_MEM_MODE_2        (0x00000004UL)

/******************  Bit definition for SYSCFG_PMC register  ******************/
#define SYSCFG_PMC_ADC1DC2              (0x00010000UL) /*!< Refer to AN4073 on how to use this bit  */

/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0            (0x000FUL) /*!<EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1            (0x00F0UL) /*!<EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2            (0x0F00UL) /*!<EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3            (0xF000UL) /*!<EXTI 3 configuration */
/**
  * @brief   EXTI0 configuration
  */
#define SYSCFG_EXTICR1_EXTI0_PA         (0x0000UL) /*!<PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB         (0x0001UL) /*!<PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC         (0x0002UL) /*!<PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD         (0x0003UL) /*!<PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE         (0x0004UL) /*!<PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PH         (0x0007UL) /*!<PH[0] pin */

/**
  * @brief   EXTI1 configuration
  */
#define SYSCFG_EXTICR1_EXTI1_PA         (0x0000UL) /*!<PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB         (0x0010UL) /*!<PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC         (0x0020UL) /*!<PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD         (0x0030UL) /*!<PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE         (0x0040UL) /*!<PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PH         (0x0070UL) /*!<PH[1] pin */

/**
  * @brief   EXTI2 configuration
  */
#define SYSCFG_EXTICR1_EXTI2_PA         (0x0000UL) /*!<PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB         (0x0100UL) /*!<PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC         (0x0200UL) /*!<PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD         (0x0300UL) /*!<PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE         (0x0400UL) /*!<PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PH         (0x0700UL) /*!<PH[2] pin */

/**
  * @brief   EXTI3 configuration
  */
#define SYSCFG_EXTICR1_EXTI3_PA         (0x0000UL) /*!<PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB         (0x1000UL) /*!<PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC         (0x2000UL) /*!<PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD         (0x3000UL) /*!<PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE         (0x4000UL) /*!<PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PH         (0x7000UL) /*!<PH[3] pin */

