Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*****************  Bit definition for SYSCFG_EXTICR2 register  ***************/
#define SYSCFG_EXTICR2_EXTI4            (0x000FUL) /*!<EXTI 4 configuration */
#define SYSCFG_EXTICR2_EXTI5            (0x00F0UL) /*!<EXTI 5 configuration */
#define SYSCFG_EXTICR2_EXTI6            (0x0F00UL) /*!<EXTI 6 configuration */
#define SYSCFG_EXTICR2_EXTI7            (0xF000UL) /*!<EXTI 7 configuration */
/**
  * @brief   EXTI4 configuration
  */
#define SYSCFG_EXTICR2_EXTI4_PA         (0x0000UL) /*!<PA[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PB         (0x0001UL) /*!<PB[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PC         (0x0002UL) /*!<PC[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PD         (0x0003UL) /*!<PD[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PE         (0x0004UL) /*!<PE[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PH         (0x0007UL) /*!<PH[4] pin */

/**
  * @brief   EXTI5 configuration
  */
#define SYSCFG_EXTICR2_EXTI5_PA         (0x0000UL) /*!<PA[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PB         (0x0010UL) /*!<PB[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PC         (0x0020UL) /*!<PC[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PD         (0x0030UL) /*!<PD[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PE         (0x0040UL) /*!<PE[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PH         (0x0070UL) /*!<PH[5] pin */

/**
  * @brief   EXTI6 configuration
  */
#define SYSCFG_EXTICR2_EXTI6_PA         (0x0000UL) /*!<PA[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PB         (0x0100UL) /*!<PB[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PC         (0x0200UL) /*!<PC[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PD         (0x0300UL) /*!<PD[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PE         (0x0400UL) /*!<PE[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PH         (0x0700UL) /*!<PH[6] pin */

/**
  * @brief   EXTI7 configuration
  */
#define SYSCFG_EXTICR2_EXTI7_PA         (0x0000UL) /*!<PA[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PB         (0x1000UL) /*!<PB[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PC         (0x2000UL) /*!<PC[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PD         (0x3000UL) /*!<PD[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PE         (0x4000UL) /*!<PE[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PH         (0x7000UL) /*!<PH[7] pin */


/*****************  Bit definition for SYSCFG_EXTICR3 register  ***************/
#define SYSCFG_EXTICR3_EXTI8            (0x000FUL) /*!<EXTI 8 configuration */
#define SYSCFG_EXTICR3_EXTI9            (0x00F0UL) /*!<EXTI 9 configuration */
#define SYSCFG_EXTICR3_EXTI10           (0x0F00UL) /*!<EXTI 10 configuration */
#define SYSCFG_EXTICR3_EXTI11           (0xF000UL) /*!<EXTI 11 configuration */

/**
  * @brief   EXTI8 configuration
  */
#define SYSCFG_EXTICR3_EXTI8_PA         (0x0000UL) /*!<PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         (0x0001UL) /*!<PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         (0x0002UL) /*!<PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         (0x0003UL) /*!<PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         (0x0004UL) /*!<PE[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PH         (0x0007UL) /*!<PH[8] pin */

/**
  * @brief   EXTI9 configuration
  */
#define SYSCFG_EXTICR3_EXTI9_PA         (0x0000UL) /*!<PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         (0x0010UL) /*!<PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         (0x0020UL) /*!<PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         (0x0030UL) /*!<PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         (0x0040UL) /*!<PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PH         (0x0070UL) /*!<PH[9] pin */

/**
  * @brief   EXTI10 configuration
  */
#define SYSCFG_EXTICR3_EXTI10_PA        (0x0000UL) /*!<PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        (0x0100UL) /*!<PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        (0x0200UL) /*!<PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        (0x0300UL) /*!<PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        (0x0400UL) /*!<PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PH        (0x0700UL) /*!<PH[10] pin */

/**
  * @brief   EXTI11 configuration
  */
#define SYSCFG_EXTICR3_EXTI11_PA        (0x0000UL) /*!<PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        (0x1000UL) /*!<PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        (0x2000UL) /*!<PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        (0x3000UL) /*!<PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        (0x4000UL) /*!<PE[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PH        (0x7000UL) /*!<PH[11] pin */

/*****************  Bit definition for SYSCFG_EXTICR4 register  ***************/
#define SYSCFG_EXTICR4_EXTI12           (0x000FUL) /*!<EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13           (0x00F0UL) /*!<EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14           (0x0F00UL) /*!<EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15           (0xF000UL) /*!<EXTI 15 configuration */
/**
  * @brief   EXTI12 configuration
  */
#define SYSCFG_EXTICR4_EXTI12_PA        (0x0000UL) /*!<PA[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PB        (0x0001UL) /*!<PB[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PC        (0x0002UL) /*!<PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        (0x0003UL) /*!<PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        (0x0004UL) /*!<PE[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PH        (0x0007UL) /*!<PH[12] pin */

/**
  * @brief   EXTI13 configuration
  */
#define SYSCFG_EXTICR4_EXTI13_PA        (0x0000UL) /*!<PA[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PB        (0x0010UL) /*!<PB[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PC        (0x0020UL) /*!<PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        (0x0030UL) /*!<PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        (0x0040UL) /*!<PE[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PH        (0x0070UL) /*!<PH[13] pin */

/**
  * @brief   EXTI14 configuration
  */
#define SYSCFG_EXTICR4_EXTI14_PA        (0x0000UL) /*!<PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        (0x0100UL) /*!<PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        (0x0200UL) /*!<PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        (0x0300UL) /*!<PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        (0x0400UL) /*!<PE[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PH        (0x0700UL) /*!<PH[14] pin */

/**
  * @brief   EXTI15 configuration
  */
#define SYSCFG_EXTICR4_EXTI15_PA        (0x0000UL) /*!<PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        (0x1000UL) /*!<PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        (0x2000UL) /*!<PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        (0x3000UL) /*!<PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        (0x4000UL) /*!<PE[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PH        (0x7000UL) /*!<PH[15] pin */

/******************  Bit definition for SYSCFG_CMPCR register  ****************/
#define SYSCFG_CMPCR_CMP_PD             (0x00000001UL) /*!<Compensation cell ready flag */
#define SYSCFG_CMPCR_READY              (0x00000100UL) /*!<Compensation cell power-down */

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         (0x0001UL)            /*!<Counter enable        */
#define  TIM_CR1_UDIS                        (0x0002UL)            /*!<Update disable        */
#define  TIM_CR1_URS                         (0x0004UL)            /*!<Update request source */
#define  TIM_CR1_OPM                         (0x0008UL)            /*!<One pulse mode        */
#define  TIM_CR1_DIR                         (0x0010UL)            /*!<Direction             */

#define  TIM_CR1_CMS                         (0x0060UL)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       (0x0020UL)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       (0x0040UL)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        (0x0080UL)            /*!<Auto-reload preload enable     */

#define  TIM_CR1_CKD                         (0x0300UL)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       (0x0100UL)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       (0x0200UL)            /*!<Bit 1 */

