Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCPC                        (0x0001UL)            /*!<Capture/Compare Preloaded Control        */
#define  TIM_CR2_CCUS                        (0x0004UL)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        (0x0008UL)            /*!<Capture/Compare DMA Selection            */

#define  TIM_CR2_MMS                         (0x0070UL)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       (0x0010UL)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       (0x0020UL)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       (0x0040UL)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        (0x0080UL)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        (0x0100UL)            /*!<Output Idle state 1 (OC1 output)  */
#define  TIM_CR2_OIS1N                       (0x0200UL)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        (0x0400UL)            /*!<Output Idle state 2 (OC2 output)  */
#define  TIM_CR2_OIS2N                       (0x0800UL)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        (0x1000UL)            /*!<Output Idle state 3 (OC3 output)  */
#define  TIM_CR2_OIS3N                       (0x2000UL)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        (0x4000UL)            /*!<Output Idle state 4 (OC4 output)  */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define  TIM_SMCR_SMS                        (0x0007UL)            /*!<SMS[2:0] bits (Slave mode selection)    */
#define  TIM_SMCR_SMS_0                      (0x0001UL)            /*!<Bit 0 */
#define  TIM_SMCR_SMS_1                      (0x0002UL)            /*!<Bit 1 */
#define  TIM_SMCR_SMS_2                      (0x0004UL)            /*!<Bit 2 */

#define  TIM_SMCR_TS                         (0x0070UL)            /*!<TS[2:0] bits (Trigger selection)        */
#define  TIM_SMCR_TS_0                       (0x0010UL)            /*!<Bit 0 */
#define  TIM_SMCR_TS_1                       (0x0020UL)            /*!<Bit 1 */
#define  TIM_SMCR_TS_2                       (0x0040UL)            /*!<Bit 2 */

#define  TIM_SMCR_MSM                        (0x0080UL)            /*!<Master/slave mode                       */

#define  TIM_SMCR_ETF                        (0x0F00UL)            /*!<ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      (0x0100UL)            /*!<Bit 0 */
#define  TIM_SMCR_ETF_1                      (0x0200UL)            /*!<Bit 1 */
#define  TIM_SMCR_ETF_2                      (0x0400UL)            /*!<Bit 2 */
#define  TIM_SMCR_ETF_3                      (0x0800UL)            /*!<Bit 3 */

#define  TIM_SMCR_ETPS                       (0x3000UL)            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     (0x1000UL)            /*!<Bit 0 */
#define  TIM_SMCR_ETPS_1                     (0x2000UL)            /*!<Bit 1 */

#define  TIM_SMCR_ECE                        (0x4000UL)            /*!<External clock enable     */
#define  TIM_SMCR_ETP                        (0x8000UL)            /*!<External trigger polarity */

/*******************  Bit definition for TIM_DIER register  *******************/
#define  TIM_DIER_UIE                        (0x0001UL)            /*!<Update interrupt enable */
#define  TIM_DIER_CC1IE                      (0x0002UL)            /*!<Capture/Compare 1 interrupt enable   */
#define  TIM_DIER_CC2IE                      (0x0004UL)            /*!<Capture/Compare 2 interrupt enable   */
#define  TIM_DIER_CC3IE                      (0x0008UL)            /*!<Capture/Compare 3 interrupt enable   */
#define  TIM_DIER_CC4IE                      (0x0010UL)            /*!<Capture/Compare 4 interrupt enable   */
#define  TIM_DIER_COMIE                      (0x0020UL)            /*!<COM interrupt enable                 */
#define  TIM_DIER_TIE                        (0x0040UL)            /*!<Trigger interrupt enable             */
#define  TIM_DIER_BIE                        (0x0080UL)            /*!<Break interrupt enable               */
#define  TIM_DIER_UDE                        (0x0100UL)            /*!<Update DMA request enable            */
#define  TIM_DIER_CC1DE                      (0x0200UL)            /*!<Capture/Compare 1 DMA request enable */
#define  TIM_DIER_CC2DE                      (0x0400UL)            /*!<Capture/Compare 2 DMA request enable */
#define  TIM_DIER_CC3DE                      (0x0800UL)            /*!<Capture/Compare 3 DMA request enable */
#define  TIM_DIER_CC4DE                      (0x1000UL)            /*!<Capture/Compare 4 DMA request enable */
#define  TIM_DIER_COMDE                      (0x2000UL)            /*!<COM DMA request enable               */
#define  TIM_DIER_TDE                        (0x4000UL)            /*!<Trigger DMA request enable           */

/********************  Bit definition for TIM_SR register  ********************/
#define  TIM_SR_UIF                          (0x0001UL)            /*!<Update interrupt Flag              */
#define  TIM_SR_CC1IF                        (0x0002UL)            /*!<Capture/Compare 1 interrupt Flag   */
#define  TIM_SR_CC2IF                        (0x0004UL)            /*!<Capture/Compare 2 interrupt Flag   */
#define  TIM_SR_CC3IF                        (0x0008UL)            /*!<Capture/Compare 3 interrupt Flag   */
#define  TIM_SR_CC4IF                        (0x0010UL)            /*!<Capture/Compare 4 interrupt Flag   */
#define  TIM_SR_COMIF                        (0x0020UL)            /*!<COM interrupt Flag                 */
#define  TIM_SR_TIF                          (0x0040UL)            /*!<Trigger interrupt Flag             */
#define  TIM_SR_BIF                          (0x0080UL)            /*!<Break interrupt Flag               */
#define  TIM_SR_CC1OF                        (0x0200UL)            /*!<Capture/Compare 1 Overcapture Flag */
#define  TIM_SR_CC2OF                        (0x0400UL)            /*!<Capture/Compare 2 Overcapture Flag */
#define  TIM_SR_CC3OF                        (0x0800UL)            /*!<Capture/Compare 3 Overcapture Flag */
#define  TIM_SR_CC4OF                        (0x1000UL)            /*!<Capture/Compare 4 Overcapture Flag */

/*******************  Bit definition for TIM_EGR register  ********************/
#define  TIM_EGR_UG                          (0x01UL)               /*!<Update Generation                         */
#define  TIM_EGR_CC1G                        (0x02UL)               /*!<Capture/Compare 1 Generation              */
#define  TIM_EGR_CC2G                        (0x04UL)               /*!<Capture/Compare 2 Generation              */
#define  TIM_EGR_CC3G                        (0x08UL)               /*!<Capture/Compare 3 Generation              */
#define  TIM_EGR_CC4G                        (0x10UL)               /*!<Capture/Compare 4 Generation              */
#define  TIM_EGR_COMG                        (0x20UL)               /*!<Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          (0x40UL)               /*!<Trigger Generation                        */
#define  TIM_EGR_BG                          (0x80UL)               /*!<Break Generation                          */

