Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/******************  Bit definition for TIM_CCMR1 register  *******************/
#define  TIM_CCMR1_CC1S                      (0x0003UL)            /*!<CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TIM_CCMR1_CC1S_0                    (0x0001UL)            /*!<Bit 0 */
#define  TIM_CCMR1_CC1S_1                    (0x0002UL)            /*!<Bit 1 */

#define  TIM_CCMR1_OC1FE                     (0x0004UL)            /*!<Output Compare 1 Fast enable                 */
#define  TIM_CCMR1_OC1PE                     (0x0008UL)            /*!<Output Compare 1 Preload enable              */

#define  TIM_CCMR1_OC1M                      (0x0070UL)            /*!<OC1M[2:0] bits (Output Compare 1 Mode)       */
#define  TIM_CCMR1_OC1M_0                    (0x0010UL)            /*!<Bit 0 */
#define  TIM_CCMR1_OC1M_1                    (0x0020UL)            /*!<Bit 1 */
#define  TIM_CCMR1_OC1M_2                    (0x0040UL)            /*!<Bit 2 */

#define  TIM_CCMR1_OC1CE                     (0x0080UL)            /*!<Output Compare 1Clear Enable                 */

#define  TIM_CCMR1_CC2S                      (0x0300UL)            /*!<CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define  TIM_CCMR1_CC2S_0                    (0x0100UL)            /*!<Bit 0 */
#define  TIM_CCMR1_CC2S_1                    (0x0200UL)            /*!<Bit 1 */

#define  TIM_CCMR1_OC2FE                     (0x0400UL)            /*!<Output Compare 2 Fast enable                 */
#define  TIM_CCMR1_OC2PE                     (0x0800UL)            /*!<Output Compare 2 Preload enable              */

#define  TIM_CCMR1_OC2M                      (0x7000UL)            /*!<OC2M[2:0] bits (Output Compare 2 Mode3       */
#define  TIM_CCMR1_OC2M_0                    (0x1000UL)            /*!<Bit 0 */
#define  TIM_CCMR1_OC2M_1                    (0x2000UL)            /*!<Bit 1 */
#define  TIM_CCMR1_OC2M_2                    (0x4000UL)            /*!<Bit 2 */

#define  TIM_CCMR1_OC2CE                     (0x8000UL)            /*!<Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/

#define  TIM_CCMR1_IC1PSC                    (0x000CUL)            /*!<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define  TIM_CCMR1_IC1PSC_0                  (0x0004UL)            /*!<Bit 0 */
#define  TIM_CCMR1_IC1PSC_1                  (0x0008UL)            /*!<Bit 1 */

#define  TIM_CCMR1_IC1F                      (0x00F0UL)            /*!<IC1F[3:0] bits (Input Capture 1 Filter)      */
#define  TIM_CCMR1_IC1F_0                    (0x0010UL)            /*!<Bit 0 */
#define  TIM_CCMR1_IC1F_1                    (0x0020UL)            /*!<Bit 1 */
#define  TIM_CCMR1_IC1F_2                    (0x0040UL)            /*!<Bit 2 */
#define  TIM_CCMR1_IC1F_3                    (0x0080UL)            /*!<Bit 3 */

#define  TIM_CCMR1_IC2PSC                    (0x0C00UL)            /*!<IC2PSC[1:0] bits (Input Capture 2 Prescaler)  */
#define  TIM_CCMR1_IC2PSC_0                  (0x0400UL)            /*!<Bit 0 */
#define  TIM_CCMR1_IC2PSC_1                  (0x0800UL)            /*!<Bit 1 */

#define  TIM_CCMR1_IC2F                      (0xF000UL)            /*!<IC2F[3:0] bits (Input Capture 2 Filter)       */
#define  TIM_CCMR1_IC2F_0                    (0x1000UL)            /*!<Bit 0 */
#define  TIM_CCMR1_IC2F_1                    (0x2000UL)            /*!<Bit 1 */
#define  TIM_CCMR1_IC2F_2                    (0x4000UL)            /*!<Bit 2 */
#define  TIM_CCMR1_IC2F_3                    (0x8000UL)            /*!<Bit 3 */

/******************  Bit definition for TIM_CCMR2 register  *******************/
#define  TIM_CCMR2_CC3S                      (0x0003UL)            /*!<CC3S[1:0] bits (Capture/Compare 3 Selection)  */
#define  TIM_CCMR2_CC3S_0                    (0x0001UL)            /*!<Bit 0 */
#define  TIM_CCMR2_CC3S_1                    (0x0002UL)            /*!<Bit 1 */

#define  TIM_CCMR2_OC3FE                     (0x0004UL)            /*!<Output Compare 3 Fast enable           */
#define  TIM_CCMR2_OC3PE                     (0x0008UL)            /*!<Output Compare 3 Preload enable        */

#define  TIM_CCMR2_OC3M                      (0x0070UL)            /*!<OC3M[2:0] bits (Output Compare 3 Mode) */
#define  TIM_CCMR2_OC3M_0                    (0x0010UL)            /*!<Bit 0 */
#define  TIM_CCMR2_OC3M_1                    (0x0020UL)            /*!<Bit 1 */
#define  TIM_CCMR2_OC3M_2                    (0x0040UL)            /*!<Bit 2 */

#define  TIM_CCMR2_OC3CE                     (0x0080UL)            /*!<Output Compare 3 Clear Enable */

#define  TIM_CCMR2_CC4S                      (0x0300UL)            /*!<CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define  TIM_CCMR2_CC4S_0                    (0x0100UL)            /*!<Bit 0 */
#define  TIM_CCMR2_CC4S_1                    (0x0200UL)            /*!<Bit 1 */

#define  TIM_CCMR2_OC4FE                     (0x0400UL)            /*!<Output Compare 4 Fast enable    */
#define  TIM_CCMR2_OC4PE                     (0x0800UL)            /*!<Output Compare 4 Preload enable */

#define  TIM_CCMR2_OC4M                      (0x7000UL)            /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_CCMR2_OC4M_0                    (0x1000UL)            /*!<Bit 0 */
#define  TIM_CCMR2_OC4M_1                    (0x2000UL)            /*!<Bit 1 */
#define  TIM_CCMR2_OC4M_2                    (0x4000UL)            /*!<Bit 2 */

#define  TIM_CCMR2_OC4CE                     (0x8000UL)            /*!<Output Compare 4 Clear Enable */

/*----------------------------------------------------------------------------*/

#define  TIM_CCMR2_IC3PSC                    (0x000CUL)            /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_CCMR2_IC3PSC_0                  (0x0004UL)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3PSC_1                  (0x0008UL)            /*!<Bit 1 */

#define  TIM_CCMR2_IC3F                      (0x00F0UL)            /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_CCMR2_IC3F_0                    (0x0010UL)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3F_1                    (0x0020UL)            /*!<Bit 1 */
#define  TIM_CCMR2_IC3F_2                    (0x0040UL)            /*!<Bit 2 */
#define  TIM_CCMR2_IC3F_3                    (0x0080UL)            /*!<Bit 3 */

#define  TIM_CCMR2_IC4PSC                    (0x0C00UL)            /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  (0x0400UL)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  (0x0800UL)            /*!<Bit 1 */

