Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define  TIM_CCMR2_IC4F                      (0xF000UL)            /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_CCMR2_IC4F_0                    (0x1000UL)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4F_1                    (0x2000UL)            /*!<Bit 1 */
#define  TIM_CCMR2_IC4F_2                    (0x4000UL)            /*!<Bit 2 */
#define  TIM_CCMR2_IC4F_3                    (0x8000UL)            /*!<Bit 3 */

/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CCER_CC1E                       (0x0001UL)            /*!<Capture/Compare 1 output enable                 */
#define  TIM_CCER_CC1P                       (0x0002UL)            /*!<Capture/Compare 1 output Polarity               */
#define  TIM_CCER_CC1NE                      (0x0004UL)            /*!<Capture/Compare 1 Complementary output enable   */
#define  TIM_CCER_CC1NP                      (0x0008UL)            /*!<Capture/Compare 1 Complementary output Polarity */
#define  TIM_CCER_CC2E                       (0x0010UL)            /*!<Capture/Compare 2 output enable                 */
#define  TIM_CCER_CC2P                       (0x0020UL)            /*!<Capture/Compare 2 output Polarity               */
#define  TIM_CCER_CC2NE                      (0x0040UL)            /*!<Capture/Compare 2 Complementary output enable   */
#define  TIM_CCER_CC2NP                      (0x0080UL)            /*!<Capture/Compare 2 Complementary output Polarity */
#define  TIM_CCER_CC3E                       (0x0100UL)            /*!<Capture/Compare 3 output enable                 */
#define  TIM_CCER_CC3P                       (0x0200UL)            /*!<Capture/Compare 3 output Polarity               */
#define  TIM_CCER_CC3NE                      (0x0400UL)            /*!<Capture/Compare 3 Complementary output enable   */
#define  TIM_CCER_CC3NP                      (0x0800UL)            /*!<Capture/Compare 3 Complementary output Polarity */
#define  TIM_CCER_CC4E                       (0x1000UL)            /*!<Capture/Compare 4 output enable                 */
#define  TIM_CCER_CC4P                       (0x2000UL)            /*!<Capture/Compare 4 output Polarity               */
#define  TIM_CCER_CC4NP                      (0x8000UL)            /*!<Capture/Compare 4 Complementary output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT_CNT                         (0xFFFFUL)            /*!<Counter Value            */

/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC_PSC                         (0xFFFFUL)            /*!<Prescaler Value          */

/*******************  Bit definition for TIM_ARR register  ********************/
#define  TIM_ARR_ARR                         (0xFFFFUL)            /*!<actual auto-reload Value */

/*******************  Bit definition for TIM_RCR register  ********************/
#define  TIM_RCR_REP                         (0xFFUL)               /*!<Repetition Counter Value */

/*******************  Bit definition for TIM_CCR1 register  *******************/
#define  TIM_CCR1_CCR1                       (0xFFFFUL)            /*!<Capture/Compare 1 Value  */

/*******************  Bit definition for TIM_CCR2 register  *******************/
#define  TIM_CCR2_CCR2                       (0xFFFFUL)            /*!<Capture/Compare 2 Value  */

/*******************  Bit definition for TIM_CCR3 register  *******************/
#define  TIM_CCR3_CCR3                       (0xFFFFUL)            /*!<Capture/Compare 3 Value  */

/*******************  Bit definition for TIM_CCR4 register  *******************/
#define  TIM_CCR4_CCR4                       (0xFFFFUL)            /*!<Capture/Compare 4 Value  */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define  TIM_BDTR_DTG                        (0x00FFUL)            /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_BDTR_DTG_0                      (0x0001UL)            /*!<Bit 0 */
#define  TIM_BDTR_DTG_1                      (0x0002UL)            /*!<Bit 1 */
#define  TIM_BDTR_DTG_2                      (0x0004UL)            /*!<Bit 2 */
#define  TIM_BDTR_DTG_3                      (0x0008UL)            /*!<Bit 3 */
#define  TIM_BDTR_DTG_4                      (0x0010UL)            /*!<Bit 4 */
#define  TIM_BDTR_DTG_5                      (0x0020UL)            /*!<Bit 5 */
#define  TIM_BDTR_DTG_6                      (0x0040UL)            /*!<Bit 6 */
#define  TIM_BDTR_DTG_7                      (0x0080UL)            /*!<Bit 7 */

#define  TIM_BDTR_LOCK                       (0x0300UL)            /*!<LOCK[1:0] bits (Lock Configuration) */
#define  TIM_BDTR_LOCK_0                     (0x0100UL)            /*!<Bit 0 */
#define  TIM_BDTR_LOCK_1                     (0x0200UL)            /*!<Bit 1 */

#define  TIM_BDTR_OSSI                       (0x0400UL)            /*!<Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       (0x0800UL)            /*!<Off-State Selection for Run mode  */
#define  TIM_BDTR_BKE                        (0x1000UL)            /*!<Break enable                      */
#define  TIM_BDTR_BKP                        (0x2000UL)            /*!<Break Polarity                    */
#define  TIM_BDTR_AOE                        (0x4000UL)            /*!<Automatic Output enable           */
#define  TIM_BDTR_MOE                        (0x8000UL)            /*!<Main Output enable                */

/*******************  Bit definition for TIM_DCR register  ********************/
#define  TIM_DCR_DBA                         (0x001FUL)            /*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       (0x0001UL)            /*!<Bit 0 */
#define  TIM_DCR_DBA_1                       (0x0002UL)            /*!<Bit 1 */
#define  TIM_DCR_DBA_2                       (0x0004UL)            /*!<Bit 2 */
#define  TIM_DCR_DBA_3                       (0x0008UL)            /*!<Bit 3 */
#define  TIM_DCR_DBA_4                       (0x0010UL)            /*!<Bit 4 */

#define  TIM_DCR_DBL                         (0x1F00UL)            /*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       (0x0100UL)            /*!<Bit 0 */
#define  TIM_DCR_DBL_1                       (0x0200UL)            /*!<Bit 1 */
#define  TIM_DCR_DBL_2                       (0x0400UL)            /*!<Bit 2 */
#define  TIM_DCR_DBL_3                       (0x0800UL)            /*!<Bit 3 */
#define  TIM_DCR_DBL_4                       (0x1000UL)            /*!<Bit 4 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define  TIM_DMAR_DMAB                       (0xFFFFUL)            /*!<DMA register for burst accesses                    */

/*******************  Bit definition for TIM_OR register  *********************/
#define TIM_OR_TI4_RMP                       (0x00C0UL)            /*!<TI4_RMP[1:0] bits (TIM5 Input 4 remap)             */
#define TIM_OR_TI4_RMP_0                     (0x0040UL)            /*!<Bit 0 */
#define TIM_OR_TI4_RMP_1                     (0x0080UL)            /*!<Bit 1 */
#define TIM_OR_ITR1_RMP                      (0x0C00UL)            /*!<ITR1_RMP[1:0] bits (TIM2 Internal trigger 1 remap) */
#define TIM_OR_ITR1_RMP_0                    (0x0400UL)            /*!<Bit 0 */
#define TIM_OR_ITR1_RMP_1                    (0x0800UL)            /*!<Bit 1 */


/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for USART_SR register  *******************/
#define  USART_SR_PE                         (0x0001UL)            /*!<Parity Error                 */
#define  USART_SR_FE                         (0x0002UL)            /*!<Framing Error                */
#define  USART_SR_NE                         (0x0004UL)            /*!<Noise Error Flag             */
#define  USART_SR_ORE                        (0x0008UL)            /*!<OverRun Error                */
#define  USART_SR_IDLE                       (0x0010UL)            /*!<IDLE line detected           */
#define  USART_SR_RXNE                       (0x0020UL)            /*!<Read Data Register Not Empty */
#define  USART_SR_TC                         (0x0040UL)            /*!<Transmission Complete        */
#define  USART_SR_TXE                        (0x0080UL)            /*!<Transmit Data Register Empty */
#define  USART_SR_LBD                        (0x0100UL)            /*!<LIN Break Detection Flag     */
#define  USART_SR_CTS                        (0x0200UL)            /*!<CTS Flag                     */

/*******************  Bit definition for USART_DR register  *******************/
#define  USART_DR_DR                         (0x01FFUL)            /*!<Data value */

