Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/******************  Bit definition for USART_BRR register  *******************/
#define  USART_BRR_DIV_Fraction              (0x000FUL)            /*!<Fraction of USARTDIV */
#define  USART_BRR_DIV_Mantissa              (0xFFF0UL)            /*!<Mantissa of USARTDIV */

/******************  Bit definition for USART_CR1 register  *******************/
#define  USART_CR1_SBK                       (0x0001UL)            /*!<Send Break                             */
#define  USART_CR1_RWU                       (0x0002UL)            /*!<Receiver wakeup                        */
#define  USART_CR1_RE                        (0x0004UL)            /*!<Receiver Enable                        */
#define  USART_CR1_TE                        (0x0008UL)            /*!<Transmitter Enable                     */
#define  USART_CR1_IDLEIE                    (0x0010UL)            /*!<IDLE Interrupt Enable                  */
#define  USART_CR1_RXNEIE                    (0x0020UL)            /*!<RXNE Interrupt Enable                  */
#define  USART_CR1_TCIE                      (0x0040UL)            /*!<Transmission Complete Interrupt Enable */
#define  USART_CR1_TXEIE                     (0x0080UL)            /*!<PE Interrupt Enable                    */
#define  USART_CR1_PEIE                      (0x0100UL)            /*!<PE Interrupt Enable                    */
#define  USART_CR1_PS                        (0x0200UL)            /*!<Parity Selection                       */
#define  USART_CR1_PCE                       (0x0400UL)            /*!<Parity Control Enable                  */
#define  USART_CR1_WAKE                      (0x0800UL)            /*!<Wakeup method                          */
#define  USART_CR1_M                         (0x1000UL)            /*!<Word length                            */
#define  USART_CR1_UE                        (0x2000UL)            /*!<USART Enable                           */
#define  USART_CR1_OVER8                     (0x8000UL)            /*!<USART Oversampling by 8 enable         */

/******************  Bit definition for USART_CR2 register  *******************/
#define  USART_CR2_ADD                       (0x000FUL)            /*!<Address of the USART node            */
#define  USART_CR2_LBDL                      (0x0020UL)            /*!<LIN Break Detection Length           */
#define  USART_CR2_LBDIE                     (0x0040UL)            /*!<LIN Break Detection Interrupt Enable */
#define  USART_CR2_LBCL                      (0x0100UL)            /*!<Last Bit Clock pulse                 */
#define  USART_CR2_CPHA                      (0x0200UL)            /*!<Clock Phase                          */
#define  USART_CR2_CPOL                      (0x0400UL)            /*!<Clock Polarity                       */
#define  USART_CR2_CLKEN                     (0x0800UL)            /*!<Clock Enable                         */

#define  USART_CR2_STOP                      (0x3000UL)            /*!<STOP[1:0] bits (STOP bits) */
#define  USART_CR2_STOP_0                    (0x1000UL)            /*!<Bit 0 */
#define  USART_CR2_STOP_1                    (0x2000UL)            /*!<Bit 1 */

#define  USART_CR2_LINEN                     (0x4000UL)            /*!<LIN mode enable */

/******************  Bit definition for USART_CR3 register  *******************/
#define  USART_CR3_EIE                       (0x0001UL)            /*!<Error Interrupt Enable      */
#define  USART_CR3_IREN                      (0x0002UL)            /*!<IrDA mode Enable            */
#define  USART_CR3_IRLP                      (0x0004UL)            /*!<IrDA Low-Power              */
#define  USART_CR3_HDSEL                     (0x0008UL)            /*!<Half-Duplex Selection       */
#define  USART_CR3_NACK                      (0x0010UL)            /*!<Smartcard NACK enable       */
#define  USART_CR3_SCEN                      (0x0020UL)            /*!<Smartcard mode enable       */
#define  USART_CR3_DMAR                      (0x0040UL)            /*!<DMA Enable Receiver         */
#define  USART_CR3_DMAT                      (0x0080UL)            /*!<DMA Enable Transmitter      */
#define  USART_CR3_RTSE                      (0x0100UL)            /*!<RTS Enable                  */
#define  USART_CR3_CTSE                      (0x0200UL)            /*!<CTS Enable                  */
#define  USART_CR3_CTSIE                     (0x0400UL)            /*!<CTS Interrupt Enable        */
#define  USART_CR3_ONEBIT                    (0x0800UL)            /*!<USART One bit method enable */

/******************  Bit definition for USART_GTPR register  ******************/
#define  USART_GTPR_PSC                      (0x00FFUL)            /*!<PSC[7:0] bits (Prescaler value) */
#define  USART_GTPR_PSC_0                    (0x0001UL)            /*!<Bit 0 */
#define  USART_GTPR_PSC_1                    (0x0002UL)            /*!<Bit 1 */
#define  USART_GTPR_PSC_2                    (0x0004UL)            /*!<Bit 2 */
#define  USART_GTPR_PSC_3                    (0x0008UL)            /*!<Bit 3 */
#define  USART_GTPR_PSC_4                    (0x0010UL)            /*!<Bit 4 */
#define  USART_GTPR_PSC_5                    (0x0020UL)            /*!<Bit 5 */
#define  USART_GTPR_PSC_6                    (0x0040UL)            /*!<Bit 6 */
#define  USART_GTPR_PSC_7                    (0x0080UL)            /*!<Bit 7 */

#define  USART_GTPR_GT                       (0xFF00UL)            /*!<Guard time value */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           (0x7FUL)               /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          (0x01UL)               /*!<Bit 0 */
#define  WWDG_CR_T1                          (0x02UL)               /*!<Bit 1 */
#define  WWDG_CR_T2                          (0x04UL)               /*!<Bit 2 */
#define  WWDG_CR_T3                          (0x08UL)               /*!<Bit 3 */
#define  WWDG_CR_T4                          (0x10UL)               /*!<Bit 4 */
#define  WWDG_CR_T5                          (0x20UL)               /*!<Bit 5 */
#define  WWDG_CR_T6                          (0x40UL)               /*!<Bit 6 */

#define  WWDG_CR_WDGA                        (0x80UL)               /*!<Activation bit */

