Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          (0x007FUL)            /*!<W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         (0x0001UL)            /*!<Bit 0 */
#define  WWDG_CFR_W1                         (0x0002UL)            /*!<Bit 1 */
#define  WWDG_CFR_W2                         (0x0004UL)            /*!<Bit 2 */
#define  WWDG_CFR_W3                         (0x0008UL)            /*!<Bit 3 */
#define  WWDG_CFR_W4                         (0x0010UL)            /*!<Bit 4 */
#define  WWDG_CFR_W5                         (0x0020UL)            /*!<Bit 5 */
#define  WWDG_CFR_W6                         (0x0040UL)            /*!<Bit 6 */

#define  WWDG_CFR_WDGTB                      (0x0180UL)            /*!<WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     (0x0080UL)            /*!<Bit 0 */
#define  WWDG_CFR_WDGTB1                     (0x0100UL)            /*!<Bit 1 */

#define  WWDG_CFR_EWI                        (0x0200UL)            /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define  WWDG_SR_EWIF                        (0x01UL)               /*!<Early Wakeup Interrupt Flag */


/******************************************************************************/
/*                                                                            */
/*                                DBG                                         */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define  DBGMCU_IDCODE_DEV_ID                (0x00000FFFUL)
#define  DBGMCU_IDCODE_REV_ID                (0xFFFF0000UL)

/********************  Bit definition for DBGMCU_CR register  *****************/
#define  DBGMCU_CR_DBG_SLEEP                 (0x00000001UL)
#define  DBGMCU_CR_DBG_STOP                  (0x00000002UL)
#define  DBGMCU_CR_DBG_STANDBY               (0x00000004UL)
#define  DBGMCU_CR_TRACE_IOEN                (0x00000020UL)

#define  DBGMCU_CR_TRACE_MODE                (0x000000C0UL)
#define  DBGMCU_CR_TRACE_MODE_0              (0x00000040UL)/*!<Bit 0 */
#define  DBGMCU_CR_TRACE_MODE_1              (0x00000080UL)/*!<Bit 1 */

/********************  Bit definition for DBGMCU_APB1_FZ register  ************/
#define  DBGMCU_APB1_FZ_DBG_TIM2_STOP            (0x00000001UL)
#define  DBGMCU_APB1_FZ_DBG_TIM3_STOP            (0x00000002UL)
#define  DBGMCU_APB1_FZ_DBG_TIM4_STOP            (0x00000004UL)
#define  DBGMCU_APB1_FZ_DBG_TIM5_STOP            (0x00000008UL)
#define  DBGMCU_APB1_FZ_DBG_TIM6_STOP            (0x00000010UL)
#define  DBGMCU_APB1_FZ_DBG_TIM7_STOP            (0x00000020UL)
#define  DBGMCU_APB1_FZ_DBG_TIM12_STOP           (0x00000040UL)
#define  DBGMCU_APB1_FZ_DBG_TIM13_STOP           (0x00000080UL)
#define  DBGMCU_APB1_FZ_DBG_TIM14_STOP           (0x00000100UL)
#define  DBGMCU_APB1_FZ_DBG_RTC_STOP             (0x00000400UL)
#define  DBGMCU_APB1_FZ_DBG_WWDG_STOP            (0x00000800UL)
#define  DBGMCU_APB1_FZ_DBG_IWDG_STOP            (0x00001000UL)
#define  DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT   (0x00200000UL)
#define  DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT   (0x00400000UL)
#define  DBGMCU_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT   (0x00800000UL)
#define  DBGMCU_APB1_FZ_DBG_CAN1_STOP            (0x02000000UL)
#define  DBGMCU_APB1_FZ_DBG_CAN2_STOP            (0x04000000UL)
/* Old IWDGSTOP bit definition, maintained for legacy purpose */
#define  DBGMCU_APB1_FZ_DBG_IWDEG_STOP           DBGMCU_APB1_FZ_DBG_IWDG_STOP

/********************  Bit definition for DBGMCU_APB2_FZ register  ************/
#define  DBGMCU_APB2_FZ_DBG_TIM1_STOP        (0x00000001UL)
#define  DBGMCU_APB2_FZ_DBG_TIM8_STOP        (0x00000002UL)
#define  DBGMCU_APB2_FZ_DBG_TIM9_STOP        (0x00010000UL)
#define  DBGMCU_APB2_FZ_DBG_TIM10_STOP       (0x00020000UL)
#define  DBGMCU_APB2_FZ_DBG_TIM11_STOP       (0x00040000UL)

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition forUSB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS                  (0x00000001UL)            /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ                     (0x00000002UL)            /*!< Session request */
#define USB_OTG_GOTGCTL_HNGSCS                  (0x00000100UL)            /*!< Host negotiation success */
#define USB_OTG_GOTGCTL_HNPRQ                   (0x00000200UL)            /*!< HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN                 (0x00000400UL)            /*!< Host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN                  (0x00000800UL)            /*!< Device HNP enabled */
#define USB_OTG_GOTGCTL_CIDSTS                  (0x00010000UL)            /*!< Connector ID status */
#define USB_OTG_GOTGCTL_DBCT                    (0x00020000UL)            /*!< Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD                   (0x00040000UL)            /*!< A-session valid */
#define USB_OTG_GOTGCTL_BSVLD                   (0x00080000UL)            /*!< B-session valid */

/********************  Bit definition forUSB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_FSLSPCS                 (0x00000003UL)            /*!< FS/LS PHY clock select */
#define USB_OTG_HCFG_FSLSPCS_0               (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_HCFG_FSLSPCS_1               (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_HCFG_FSLSS                   (0x00000004UL)            /*!< FS- and LS-only support */

/********************  Bit definition forUSB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPD                    (0x00000003UL)            /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0                  (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_DCFG_DSPD_1                  (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_DCFG_NZLSOHSK                (0x00000004UL)            /*!< Nonzero-length status OUT handshake */

