Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define USB_OTG_DCFG_DAD                     (0x000007F0UL)            /*!< Device address */
#define USB_OTG_DCFG_DAD_0                   (0x00000010UL)            /*!<Bit 0 */
#define USB_OTG_DCFG_DAD_1                   (0x00000020UL)            /*!<Bit 1 */
#define USB_OTG_DCFG_DAD_2                   (0x00000040UL)            /*!<Bit 2 */
#define USB_OTG_DCFG_DAD_3                   (0x00000080UL)            /*!<Bit 3 */
#define USB_OTG_DCFG_DAD_4                   (0x00000100UL)            /*!<Bit 4 */
#define USB_OTG_DCFG_DAD_5                   (0x00000200UL)            /*!<Bit 5 */
#define USB_OTG_DCFG_DAD_6                   (0x00000400UL)            /*!<Bit 6 */

#define USB_OTG_DCFG_PFIVL                   (0x00001800UL)            /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0                 (0x00000800UL)            /*!<Bit 0 */
#define USB_OTG_DCFG_PFIVL_1                 (0x00001000UL)            /*!<Bit 1 */

#define USB_OTG_DCFG_PERSCHIVL               (0x03000000UL)            /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0             (0x01000000UL)            /*!<Bit 0 */
#define USB_OTG_DCFG_PERSCHIVL_1             (0x02000000UL)            /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_PCGCR register  ********************/
#define USB_OTG_PCGCR_STPPCLK                 (0x00000001UL)            /*!< Stop PHY clock */
#define USB_OTG_PCGCR_GATEHCLK                (0x00000002UL)            /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUSP                 (0x00000010UL)            /*!< PHY suspended */

/********************  Bit definition forUSB_OTG_GOTGINT register  ********************/
#define USB_OTG_GOTGINT_SEDET                   (0x00000004UL)            /*!< Session end detected */
#define USB_OTG_GOTGINT_SRSSCHG                 (0x00000100UL)            /*!< Session request success status change */
#define USB_OTG_GOTGINT_HNSSCHG                 (0x00000200UL)            /*!< Host negotiation success status change */
#define USB_OTG_GOTGINT_HNGDET                  (0x00020000UL)            /*!< Host negotiation detected */
#define USB_OTG_GOTGINT_ADTOCHG                 (0x00040000UL)            /*!< A-device timeout change */
#define USB_OTG_GOTGINT_DBCDNE                  (0x00080000UL)            /*!< Debounce done */

/********************  Bit definition forUSB_OTG_DCTL register  ********************/
#define USB_OTG_DCTL_RWUSIG                  (0x00000001UL)            /*!< Remote wakeup signaling */
#define USB_OTG_DCTL_SDIS                    (0x00000002UL)            /*!< Soft disconnect */
#define USB_OTG_DCTL_GINSTS                  (0x00000004UL)            /*!< Global IN NAK status */
#define USB_OTG_DCTL_GONSTS                  (0x00000008UL)            /*!< Global OUT NAK status */

#define USB_OTG_DCTL_TCTL                    (0x00000070UL)            /*!< Test control */
#define USB_OTG_DCTL_TCTL_0                  (0x00000010UL)            /*!<Bit 0 */
#define USB_OTG_DCTL_TCTL_1                  (0x00000020UL)            /*!<Bit 1 */
#define USB_OTG_DCTL_TCTL_2                  (0x00000040UL)            /*!<Bit 2 */
#define USB_OTG_DCTL_SGINAK                  (0x00000080UL)            /*!< Set global IN NAK */
#define USB_OTG_DCTL_CGINAK                  (0x00000100UL)            /*!< Clear global IN NAK */
#define USB_OTG_DCTL_SGONAK                  (0x00000200UL)            /*!< Set global OUT NAK */
#define USB_OTG_DCTL_CGONAK                  (0x00000400UL)            /*!< Clear global OUT NAK */
#define USB_OTG_DCTL_POPRGDNE                (0x00000800UL)            /*!< Power-on programming done */

/********************  Bit definition forUSB_OTG_HFIR register  ********************/
#define USB_OTG_HFIR_FRIVL                   (0x0000FFFFUL)            /*!< Frame interval */

/********************  Bit definition forUSB_OTG_HFNUM register  ********************/
#define USB_OTG_HFNUM_FRNUM                   (0x0000FFFFUL)            /*!< Frame number */
#define USB_OTG_HFNUM_FTREM                   (0xFFFF0000UL)            /*!< Frame time remaining */

/********************  Bit definition forUSB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSPSTS                 (0x00000001UL)            /*!< Suspend status */

#define USB_OTG_DSTS_ENUMSPD                 (0x00000006UL)            /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0               (0x00000002UL)            /*!<Bit 0 */
#define USB_OTG_DSTS_ENUMSPD_1               (0x00000004UL)            /*!<Bit 1 */
#define USB_OTG_DSTS_EERR                    (0x00000008UL)            /*!< Erratic error */
#define USB_OTG_DSTS_FNSOF                   (0x003FFF00UL)            /*!< Frame number of the received SOF */

/********************  Bit definition forUSB_OTG_GAHBCFG register  ********************/
#define USB_OTG_GAHBCFG_GINT                    (0x00000001UL)            /*!< Global interrupt mask */

#define USB_OTG_GAHBCFG_HBSTLEN                 (0x0000001EUL)            /*!< Burst length/type */
#define USB_OTG_GAHBCFG_HBSTLEN_0               (0x00000002UL)            /*!<Bit 0 */
#define USB_OTG_GAHBCFG_HBSTLEN_1               (0x00000004UL)            /*!<Bit 1 */
#define USB_OTG_GAHBCFG_HBSTLEN_2               (0x00000008UL)            /*!<Bit 2 */
#define USB_OTG_GAHBCFG_HBSTLEN_3               (0x00000010UL)            /*!<Bit 3 */
#define USB_OTG_GAHBCFG_DMAEN                   (0x00000020UL)            /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFELVL                 (0x00000080UL)            /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFELVL                (0x00000100UL)            /*!< Periodic TxFIFO empty level */

/********************  Bit definition forUSB_OTG_GUSBCFG register  ********************/

#define USB_OTG_GUSBCFG_TOCAL                   (0x00000007UL)            /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_TOCAL_0                 (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TOCAL_1                 (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TOCAL_2                 (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_GUSBCFG_PHYSEL                  (0x00000040UL)            /*!< USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define USB_OTG_GUSBCFG_SRPCAP                  (0x00000100UL)            /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPCAP                  (0x00000200UL)            /*!< HNP-capable */

