Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define USB_OTG_GUSBCFG_TRDT                    (0x00003C00UL)            /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRDT_0                  (0x00000400UL)            /*!<Bit 0 */
#define USB_OTG_GUSBCFG_TRDT_1                  (0x00000800UL)            /*!<Bit 1 */
#define USB_OTG_GUSBCFG_TRDT_2                  (0x00001000UL)            /*!<Bit 2 */
#define USB_OTG_GUSBCFG_TRDT_3                  (0x00002000UL)            /*!<Bit 3 */
#define USB_OTG_GUSBCFG_PHYLPCS                 (0x00008000UL)            /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_ULPIFSLS                (0x00020000UL)            /*!< ULPI FS/LS select */
#define USB_OTG_GUSBCFG_ULPIAR                  (0x00040000UL)            /*!< ULPI Auto-resume */
#define USB_OTG_GUSBCFG_ULPICSM                 (0x00080000UL)            /*!< ULPI Clock SuspendM */
#define USB_OTG_GUSBCFG_ULPIEVBUSD              (0x00100000UL)            /*!< ULPI External VBUS Drive */
#define USB_OTG_GUSBCFG_ULPIEVBUSI              (0x00200000UL)            /*!< ULPI external VBUS indicator */
#define USB_OTG_GUSBCFG_TSDPS                   (0x00400000UL)            /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_PCCI                    (0x00800000UL)            /*!< Indicator complement */
#define USB_OTG_GUSBCFG_PTCI                    (0x01000000UL)            /*!< Indicator pass through */
#define USB_OTG_GUSBCFG_ULPIIPD                 (0x02000000UL)            /*!< ULPI interface protect disable */
#define USB_OTG_GUSBCFG_FHMOD                   (0x20000000UL)            /*!< Forced host mode */
#define USB_OTG_GUSBCFG_FDMOD                   (0x40000000UL)            /*!< Forced peripheral mode */
#define USB_OTG_GUSBCFG_CTXPKT                  (0x80000000UL)            /*!< Corrupt Tx packet */

/********************  Bit definition forUSB_OTG_GRSTCTL register  ********************/
#define USB_OTG_GRSTCTL_CSRST                   (0x00000001UL)            /*!< Core soft reset */
#define USB_OTG_GRSTCTL_HSRST                   (0x00000002UL)            /*!< HCLK soft reset */
#define USB_OTG_GRSTCTL_FCRST                   (0x00000004UL)            /*!< Host frame counter reset */
#define USB_OTG_GRSTCTL_RXFFLSH                 (0x00000010UL)            /*!< RxFIFO flush */
#define USB_OTG_GRSTCTL_TXFFLSH                 (0x00000020UL)            /*!< TxFIFO flush */

#define USB_OTG_GRSTCTL_TXFNUM                  (0x000007C0UL)            /*!< TxFIFO number */
#define USB_OTG_GRSTCTL_TXFNUM_0                (0x00000040UL)            /*!<Bit 0 */
#define USB_OTG_GRSTCTL_TXFNUM_1                (0x00000080UL)            /*!<Bit 1 */
#define USB_OTG_GRSTCTL_TXFNUM_2                (0x00000100UL)            /*!<Bit 2 */
#define USB_OTG_GRSTCTL_TXFNUM_3                (0x00000200UL)            /*!<Bit 3 */
#define USB_OTG_GRSTCTL_TXFNUM_4                (0x00000400UL)            /*!<Bit 4 */
#define USB_OTG_GRSTCTL_DMAREQ                  (0x40000000UL)            /*!< DMA request signal */
#define USB_OTG_GRSTCTL_AHBIDL                  (0x80000000UL)            /*!< AHB master idle */

/********************  Bit definition forUSB_OTG_DIEPMSK register  ********************/
#define USB_OTG_DIEPMSK_XFRCM                   (0x00000001UL)            /*!< Transfer completed interrupt mask */
#define USB_OTG_DIEPMSK_EPDM                    (0x00000002UL)            /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DIEPMSK_TOM                     (0x00000008UL)            /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DIEPMSK_ITTXFEMSK               (0x00000010UL)            /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DIEPMSK_INEPNMM                 (0x00000020UL)            /*!< IN token received with EP mismatch mask */
#define USB_OTG_DIEPMSK_INEPNEM                 (0x00000040UL)            /*!< IN endpoint NAK effective mask */
#define USB_OTG_DIEPMSK_TXFURM                  (0x00000100UL)            /*!< FIFO underrun mask */
#define USB_OTG_DIEPMSK_BIM                     (0x00000200UL)            /*!< BNA interrupt mask */

/********************  Bit definition forUSB_OTG_HPTXSTS register  ********************/
#define USB_OTG_HPTXSTS_PTXFSAVL                (0x0000FFFFUL)            /*!< Periodic transmit data FIFO space available */

#define USB_OTG_HPTXSTS_PTXQSAV                 (0x00FF0000UL)            /*!< Periodic transmit request queue space available */
#define USB_OTG_HPTXSTS_PTXQSAV_0               (0x00010000UL)            /*!<Bit 0 */
#define USB_OTG_HPTXSTS_PTXQSAV_1               (0x00020000UL)            /*!<Bit 1 */
#define USB_OTG_HPTXSTS_PTXQSAV_2               (0x00040000UL)            /*!<Bit 2 */
#define USB_OTG_HPTXSTS_PTXQSAV_3               (0x00080000UL)            /*!<Bit 3 */
#define USB_OTG_HPTXSTS_PTXQSAV_4               (0x00100000UL)            /*!<Bit 4 */
#define USB_OTG_HPTXSTS_PTXQSAV_5               (0x00200000UL)            /*!<Bit 5 */
#define USB_OTG_HPTXSTS_PTXQSAV_6               (0x00400000UL)            /*!<Bit 6 */
#define USB_OTG_HPTXSTS_PTXQSAV_7               (0x00800000UL)            /*!<Bit 7 */

#define USB_OTG_HPTXSTS_PTXQTOP                 (0xFF000000UL)            /*!< Top of the periodic transmit request queue */
#define USB_OTG_HPTXSTS_PTXQTOP_0               (0x01000000UL)            /*!<Bit 0 */
#define USB_OTG_HPTXSTS_PTXQTOP_1               (0x02000000UL)            /*!<Bit 1 */
#define USB_OTG_HPTXSTS_PTXQTOP_2               (0x04000000UL)            /*!<Bit 2 */
#define USB_OTG_HPTXSTS_PTXQTOP_3               (0x08000000UL)            /*!<Bit 3 */
#define USB_OTG_HPTXSTS_PTXQTOP_4               (0x10000000UL)            /*!<Bit 4 */
#define USB_OTG_HPTXSTS_PTXQTOP_5               (0x20000000UL)            /*!<Bit 5 */
#define USB_OTG_HPTXSTS_PTXQTOP_6               (0x40000000UL)            /*!<Bit 6 */
#define USB_OTG_HPTXSTS_PTXQTOP_7               (0x80000000UL)            /*!<Bit 7 */

/********************  Bit definition forUSB_OTG_HAINT register  ********************/
#define USB_OTG_HAINT_HAINT                   (0x0000FFFFUL)            /*!< Channel interrupts */

/********************  Bit definition forUSB_OTG_DOEPMSK register  ********************/
#define USB_OTG_DOEPMSK_XFRCM                   (0x00000001UL)            /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPMSK_EPDM                    (0x00000002UL)            /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPMSK_STUPM                   (0x00000008UL)            /*!< SETUP phase done mask */
#define USB_OTG_DOEPMSK_OTEPDM                  (0x00000010UL)            /*!< OUT token received when endpoint disabled mask */
#define USB_OTG_DOEPMSK_B2BSTUP                 (0x00000040UL)            /*!< Back-to-back SETUP packets received mask */
#define USB_OTG_DOEPMSK_OPEM                    (0x00000100UL)            /*!< OUT packet error mask */
#define USB_OTG_DOEPMSK_BOIM                    (0x00000200UL)            /*!< BNA interrupt mask */

/********************  Bit definition forUSB_OTG_GINTSTS register  ********************/
#define USB_OTG_GINTSTS_CMOD                    (0x00000001UL)            /*!< Current mode of operation */
#define USB_OTG_GINTSTS_MMIS                    (0x00000002UL)            /*!< Mode mismatch interrupt */
#define USB_OTG_GINTSTS_OTGINT                  (0x00000004UL)            /*!< OTG interrupt */
#define USB_OTG_GINTSTS_SOF                     (0x00000008UL)            /*!< Start of frame */
#define USB_OTG_GINTSTS_RXFLVL                  (0x00000010UL)            /*!< RxFIFO nonempty */
#define USB_OTG_GINTSTS_NPTXFE                  (0x00000020UL)            /*!< Nonperiodic TxFIFO empty */
#define USB_OTG_GINTSTS_GINAKEFF                (0x00000040UL)            /*!< Global IN nonperiodic NAK effective */
#define USB_OTG_GINTSTS_BOUTNAKEFF              (0x00000080UL)            /*!< Global OUT NAK effective */
#define USB_OTG_GINTSTS_ESUSP                   (0x00000400UL)            /*!< Early suspend */
#define USB_OTG_GINTSTS_USBSUSP                 (0x00000800UL)            /*!< USB suspend */
#define USB_OTG_GINTSTS_USBRST                  (0x00001000UL)            /*!< USB reset */
#define USB_OTG_GINTSTS_ENUMDNE                 (0x00002000UL)            /*!< Enumeration done */
#define USB_OTG_GINTSTS_ISOODRP                 (0x00004000UL)            /*!< Isochronous OUT packet dropped interrupt */
#define USB_OTG_GINTSTS_EOPF                    (0x00008000UL)            /*!< End of periodic frame interrupt */
#define USB_OTG_GINTSTS_IEPINT                  (0x00040000UL)            /*!< IN endpoint interrupt */
#define USB_OTG_GINTSTS_OEPINT                  (0x00080000UL)            /*!< OUT endpoint interrupt */
#define USB_OTG_GINTSTS_IISOIXFR                (0x00100000UL)            /*!< Incomplete isochronous IN transfer */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT       (0x00200000UL)            /*!< Incomplete periodic transfer */
#define USB_OTG_GINTSTS_DATAFSUSP               (0x00400000UL)            /*!< Data fetch suspended */
#define USB_OTG_GINTSTS_HPRTINT                 (0x01000000UL)            /*!< Host port interrupt */
#define USB_OTG_GINTSTS_HCINT                   (0x02000000UL)            /*!< Host channels interrupt */
#define USB_OTG_GINTSTS_PTXFE                   (0x04000000UL)            /*!< Periodic TxFIFO empty */
#define USB_OTG_GINTSTS_CIDSCHG                 (0x10000000UL)            /*!< Connector ID status change */
#define USB_OTG_GINTSTS_DISCINT                 (0x20000000UL)            /*!< Disconnect detected interrupt */
#define USB_OTG_GINTSTS_SRQINT                  (0x40000000UL)            /*!< Session request/new session detected interrupt */
#define USB_OTG_GINTSTS_WKUINT                  (0x80000000UL)            /*!< Resume/remote wakeup detected interrupt */

/********************  Bit definition forUSB_OTG_GINTMSK register  ********************/
#define USB_OTG_GINTMSK_MMISM                   (0x00000002UL)            /*!< Mode mismatch interrupt mask */
#define USB_OTG_GINTMSK_OTGINT                  (0x00000004UL)            /*!< OTG interrupt mask */
#define USB_OTG_GINTMSK_SOFM                    (0x00000008UL)            /*!< Start of frame mask */
#define USB_OTG_GINTMSK_RXFLVLM                 (0x00000010UL)            /*!< Receive FIFO nonempty mask */
#define USB_OTG_GINTMSK_NPTXFEM                 (0x00000020UL)            /*!< Nonperiodic TxFIFO empty mask */
#define USB_OTG_GINTMSK_GINAKEFFM               (0x00000040UL)            /*!< Global nonperiodic IN NAK effective mask */
#define USB_OTG_GINTMSK_GONAKEFFM               (0x00000080UL)            /*!< Global OUT NAK effective mask */
#define USB_OTG_GINTMSK_ESUSPM                  (0x00000400UL)            /*!< Early suspend mask */
#define USB_OTG_GINTMSK_USBSUSPM                (0x00000800UL)            /*!< USB suspend mask */
#define USB_OTG_GINTMSK_USBRST                  (0x00001000UL)            /*!< USB reset mask */
#define USB_OTG_GINTMSK_ENUMDNEM                (0x00002000UL)            /*!< Enumeration done mask */
#define USB_OTG_GINTMSK_ISOODRPM                (0x00004000UL)            /*!< Isochronous OUT packet dropped interrupt mask */
#define USB_OTG_GINTMSK_EOPFM                   (0x00008000UL)            /*!< End of periodic frame interrupt mask */
#define USB_OTG_GINTMSK_EPMISM                  (0x00020000UL)            /*!< Endpoint mismatch interrupt mask */
#define USB_OTG_GINTMSK_IEPINT                  (0x00040000UL)            /*!< IN endpoints interrupt mask */
#define USB_OTG_GINTMSK_OEPINT                  (0x00080000UL)            /*!< OUT endpoints interrupt mask */
#define USB_OTG_GINTMSK_IISOIXFRM               (0x00100000UL)            /*!< Incomplete isochronous IN transfer mask */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM         (0x00200000UL)            /*!< Incomplete periodic transfer mask */
#define USB_OTG_GINTMSK_FSUSPM                  (0x00400000UL)            /*!< Data fetch suspended mask */
#define USB_OTG_GINTMSK_PRTIM                   (0x01000000UL)            /*!< Host port interrupt mask */
#define USB_OTG_GINTMSK_HCIM                    (0x02000000UL)            /*!< Host channels interrupt mask */
#define USB_OTG_GINTMSK_PTXFEM                  (0x04000000UL)            /*!< Periodic TxFIFO empty mask */
#define USB_OTG_GINTMSK_CIDSCHGM                (0x10000000UL)            /*!< Connector ID status change mask */
#define USB_OTG_GINTMSK_DISCINT                 (0x20000000UL)            /*!< Disconnect detected interrupt mask */
#define USB_OTG_GINTMSK_SRQIM                   (0x40000000UL)            /*!< Session request/new session detected interrupt mask */
#define USB_OTG_GINTMSK_WUIM                    (0x80000000UL)            /*!< Resume/remote wakeup detected interrupt mask */

/********************  Bit definition forUSB_OTG_DAINT register  ********************/
#define USB_OTG_DAINT_IEPINT                  (0x0000FFFFUL)            /*!< IN endpoint interrupt bits */
#define USB_OTG_DAINT_OEPINT                  (0xFFFF0000UL)            /*!< OUT endpoint interrupt bits */

/********************  Bit definition forUSB_OTG_HAINTMSK register  ********************/
#define USB_OTG_HAINTMSK_HAINTM                  (0x0000FFFFUL)            /*!< Channel interrupt mask */

