Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bit definition for USB_OTG_GRXSTSP register  ********************/
#define USB_OTG_GRXSTSP_EPNUM                    (0x0000000FUL)            /*!< IN EP interrupt mask bits */
#define USB_OTG_GRXSTSP_BCNT                     (0x00007FF0UL)            /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_DPID                     (0x00018000UL)            /*!< OUT EP interrupt mask bits */
#define USB_OTG_GRXSTSP_PKTSTS                   (0x001E0000UL)            /*!< OUT EP interrupt mask bits */

/********************  Bit definition forUSB_OTG_DAINTMSK register  ********************/
#define USB_OTG_DAINTMSK_IEPM                    (0x0000FFFFUL)            /*!< IN EP interrupt mask bits */
#define USB_OTG_DAINTMSK_OEPM                    (0xFFFF0000UL)            /*!< OUT EP interrupt mask bits */

/********************  Bit definition for OTG register  ********************/

#define USB_OTG_CHNUM                   (0x0000000FUL)            /*!< Channel number */
#define USB_OTG_CHNUM_0                 (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_CHNUM_1                 (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_CHNUM_2                 (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_CHNUM_3                 (0x00000008UL)            /*!<Bit 3 */
#define USB_OTG_BCNT                    (0x00007FF0UL)            /*!< Byte count */

#define USB_OTG_DPID                    (0x00018000UL)            /*!< Data PID */
#define USB_OTG_DPID_0                  (0x00008000UL)            /*!<Bit 0 */
#define USB_OTG_DPID_1                  (0x00010000UL)            /*!<Bit 1 */

#define USB_OTG_PKTSTS                  (0x001E0000UL)            /*!< Packet status */
#define USB_OTG_PKTSTS_0                (0x00020000UL)            /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                (0x00040000UL)            /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                (0x00080000UL)            /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                (0x00100000UL)            /*!<Bit 3 */

#define USB_OTG_EPNUM                   (0x0000000FUL)            /*!< Endpoint number */
#define USB_OTG_EPNUM_0                 (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_EPNUM_1                 (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_EPNUM_2                 (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_EPNUM_3                 (0x00000008UL)            /*!<Bit 3 */

#define USB_OTG_FRMNUM                  (0x01E00000UL)            /*!< Frame number */
#define USB_OTG_FRMNUM_0                (0x00200000UL)            /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                (0x00400000UL)            /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                (0x00800000UL)            /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                (0x01000000UL)            /*!<Bit 3 */

/********************  Bit definition for OTG register  ********************/

#define USB_OTG_CHNUM                   (0x0000000FUL)            /*!< Channel number */
#define USB_OTG_CHNUM_0                 (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_CHNUM_1                 (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_CHNUM_2                 (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_CHNUM_3                 (0x00000008UL)            /*!<Bit 3 */
#define USB_OTG_BCNT                    (0x00007FF0UL)            /*!< Byte count */

#define USB_OTG_DPID                    (0x00018000UL)            /*!< Data PID */
#define USB_OTG_DPID_0                  (0x00008000UL)            /*!<Bit 0 */
#define USB_OTG_DPID_1                  (0x00010000UL)            /*!<Bit 1 */

#define USB_OTG_PKTSTS                  (0x001E0000UL)            /*!< Packet status */
#define USB_OTG_PKTSTS_0                (0x00020000UL)            /*!<Bit 0 */
#define USB_OTG_PKTSTS_1                (0x00040000UL)            /*!<Bit 1 */
#define USB_OTG_PKTSTS_2                (0x00080000UL)            /*!<Bit 2 */
#define USB_OTG_PKTSTS_3                (0x00100000UL)            /*!<Bit 3 */

#define USB_OTG_EPNUM                   (0x0000000FUL)            /*!< Endpoint number */
#define USB_OTG_EPNUM_0                 (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_EPNUM_1                 (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_EPNUM_2                 (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_EPNUM_3                 (0x00000008UL)            /*!<Bit 3 */

#define USB_OTG_FRMNUM                  (0x01E00000UL)            /*!< Frame number */
#define USB_OTG_FRMNUM_0                (0x00200000UL)            /*!<Bit 0 */
#define USB_OTG_FRMNUM_1                (0x00400000UL)            /*!<Bit 1 */
#define USB_OTG_FRMNUM_2                (0x00800000UL)            /*!<Bit 2 */
#define USB_OTG_FRMNUM_3                (0x01000000UL)            /*!<Bit 3 */

/********************  Bit definition forUSB_OTG_GRXFSIZ register  ********************/
#define USB_OTG_GRXFSIZ_RXFD                    (0x0000FFFFUL)            /*!< RxFIFO depth */

/********************  Bit definition forUSB_OTG_DVBUSDIS register  ********************/
#define USB_OTG_DVBUSDIS_VBUSDT                  (0x0000FFFFUL)            /*!< Device VBUS discharge time */

/********************  Bit definition for OTG register  ********************/
#define USB_OTG_NPTXFSA                 (0x0000FFFFUL)            /*!< Nonperiodic transmit RAM start address */
#define USB_OTG_NPTXFD                  (0xFFFF0000UL)            /*!< Nonperiodic TxFIFO depth */
#define USB_OTG_TX0FSA                  (0x0000FFFFUL)            /*!< Endpoint 0 transmit RAM start address */
#define USB_OTG_TX0FD                   (0xFFFF0000UL)            /*!< Endpoint 0 TxFIFO depth */

/********************  Bit definition forUSB_OTG_DVBUSPULSE register  ********************/
#define USB_OTG_DVBUSPULSE_DVBUSP                  (0x00000FFFUL)            /*!< Device VBUS pulsing time */

/********************  Bit definition forUSB_OTG_GNPTXSTS register  ********************/
#define USB_OTG_GNPTXSTS_NPTXFSAV                (0x0000FFFFUL)            /*!< Nonperiodic TxFIFO space available */

