Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define USB_OTG_GNPTXSTS_NPTQXSAV                (0x00FF0000UL)            /*!< Nonperiodic transmit request queue space available */
#define USB_OTG_GNPTXSTS_NPTQXSAV_0              (0x00010000UL)            /*!<Bit 0 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_1              (0x00020000UL)            /*!<Bit 1 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_2              (0x00040000UL)            /*!<Bit 2 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_3              (0x00080000UL)            /*!<Bit 3 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_4              (0x00100000UL)            /*!<Bit 4 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_5              (0x00200000UL)            /*!<Bit 5 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_6              (0x00400000UL)            /*!<Bit 6 */
#define USB_OTG_GNPTXSTS_NPTQXSAV_7              (0x00800000UL)            /*!<Bit 7 */

#define USB_OTG_GNPTXSTS_NPTXQTOP                (0x7F000000UL)            /*!< Top of the nonperiodic transmit request queue */
#define USB_OTG_GNPTXSTS_NPTXQTOP_0              (0x01000000UL)            /*!<Bit 0 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_1              (0x02000000UL)            /*!<Bit 1 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_2              (0x04000000UL)            /*!<Bit 2 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_3              (0x08000000UL)            /*!<Bit 3 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_4              (0x10000000UL)            /*!<Bit 4 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_5              (0x20000000UL)            /*!<Bit 5 */
#define USB_OTG_GNPTXSTS_NPTXQTOP_6              (0x40000000UL)            /*!<Bit 6 */

/********************  Bit definition forUSB_OTG_DTHRCTL register  ********************/
#define USB_OTG_DTHRCTL_NONISOTHREN             (0x00000001UL)            /*!< Nonisochronous IN endpoints threshold enable */
#define USB_OTG_DTHRCTL_ISOTHREN                (0x00000002UL)            /*!< ISO IN endpoint threshold enable */

#define USB_OTG_DTHRCTL_TXTHRLEN                (0x000007FCUL)            /*!< Transmit threshold length */
#define USB_OTG_DTHRCTL_TXTHRLEN_0              (0x00000004UL)            /*!<Bit 0 */
#define USB_OTG_DTHRCTL_TXTHRLEN_1              (0x00000008UL)            /*!<Bit 1 */
#define USB_OTG_DTHRCTL_TXTHRLEN_2              (0x00000010UL)            /*!<Bit 2 */
#define USB_OTG_DTHRCTL_TXTHRLEN_3              (0x00000020UL)            /*!<Bit 3 */
#define USB_OTG_DTHRCTL_TXTHRLEN_4              (0x00000040UL)            /*!<Bit 4 */
#define USB_OTG_DTHRCTL_TXTHRLEN_5              (0x00000080UL)            /*!<Bit 5 */
#define USB_OTG_DTHRCTL_TXTHRLEN_6              (0x00000100UL)            /*!<Bit 6 */
#define USB_OTG_DTHRCTL_TXTHRLEN_7              (0x00000200UL)            /*!<Bit 7 */
#define USB_OTG_DTHRCTL_TXTHRLEN_8              (0x00000400UL)            /*!<Bit 8 */
#define USB_OTG_DTHRCTL_RXTHREN                 (0x00010000UL)            /*!< Receive threshold enable */

#define USB_OTG_DTHRCTL_RXTHRLEN                (0x03FE0000UL)            /*!< Receive threshold length */
#define USB_OTG_DTHRCTL_RXTHRLEN_0              (0x00020000UL)            /*!<Bit 0 */
#define USB_OTG_DTHRCTL_RXTHRLEN_1              (0x00040000UL)            /*!<Bit 1 */
#define USB_OTG_DTHRCTL_RXTHRLEN_2              (0x00080000UL)            /*!<Bit 2 */
#define USB_OTG_DTHRCTL_RXTHRLEN_3              (0x00100000UL)            /*!<Bit 3 */
#define USB_OTG_DTHRCTL_RXTHRLEN_4              (0x00200000UL)            /*!<Bit 4 */
#define USB_OTG_DTHRCTL_RXTHRLEN_5              (0x00400000UL)            /*!<Bit 5 */
#define USB_OTG_DTHRCTL_RXTHRLEN_6              (0x00800000UL)            /*!<Bit 6 */
#define USB_OTG_DTHRCTL_RXTHRLEN_7              (0x01000000UL)            /*!<Bit 7 */
#define USB_OTG_DTHRCTL_RXTHRLEN_8              (0x02000000UL)            /*!<Bit 8 */
#define USB_OTG_DTHRCTL_ARPEN                   (0x08000000UL)            /*!< Arbiter parking enable */

/********************  Bit definition forUSB_OTG_DIEPEMPMSK register  ********************/
#define USB_OTG_DIEPEMPMSK_INEPTXFEM               (0x0000FFFFUL)            /*!< IN EP Tx FIFO empty interrupt mask bits */

/********************  Bit definition forUSB_OTG_DEACHINT register  ********************/
#define USB_OTG_DEACHINT_IEP1INT                 (0x00000002UL)            /*!< IN endpoint 1interrupt bit */
#define USB_OTG_DEACHINT_OEP1INT                 (0x00020000UL)            /*!< OUT endpoint 1 interrupt bit */

/********************  Bit definition forUSB_OTG_GCCFG register  ********************/
#define USB_OTG_GCCFG_PWRDWN                  (0x00010000UL)            /*!< Power down */
#define USB_OTG_GCCFG_I2CPADEN                (0x00020000UL)            /*!< Enable I2C bus connection for the external I2C PHY interface */
#define USB_OTG_GCCFG_VBUSASEN                (0x00040000UL)            /*!< Enable the VBUS sensing device */
#define USB_OTG_GCCFG_VBUSBSEN                (0x00080000UL)            /*!< Enable the VBUS sensing device */
#define USB_OTG_GCCFG_SOFOUTEN                (0x00100000UL)            /*!< SOF output enable */
#define USB_OTG_GCCFG_NOVBUSSENS              (0x00200000UL)            /*!< VBUS sensing disable option */

/********************  Bit definition forUSB_OTG_DEACHINTMSK register  ********************/
#define USB_OTG_DEACHINTMSK_IEP1INTM                (0x00000002UL)            /*!< IN Endpoint 1 interrupt mask bit */
#define USB_OTG_DEACHINTMSK_OEP1INTM                (0x00020000UL)            /*!< OUT Endpoint 1 interrupt mask bit */

/********************  Bit definition forUSB_OTG_CID register  ********************/
#define USB_OTG_CID_PRODUCT_ID              (0xFFFFFFFFUL)            /*!< Product ID field */

/********************  Bit definition forUSB_OTG_DIEPEACHMSK1 register  ********************/
#define USB_OTG_DIEPEACHMSK1_XFRCM                   (0x00000001UL)            /*!< Transfer completed interrupt mask */
#define USB_OTG_DIEPEACHMSK1_EPDM                    (0x00000002UL)            /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DIEPEACHMSK1_TOM                     (0x00000008UL)            /*!< Timeout condition mask (nonisochronous endpointsUL) */
#define USB_OTG_DIEPEACHMSK1_ITTXFEMSK               (0x00000010UL)            /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DIEPEACHMSK1_INEPNMM                 (0x00000020UL)            /*!< IN token received with EP mismatch mask */
#define USB_OTG_DIEPEACHMSK1_INEPNEM                 (0x00000040UL)            /*!< IN endpoint NAK effective mask */
#define USB_OTG_DIEPEACHMSK1_TXFURM                  (0x00000100UL)            /*!< FIFO underrun mask */
#define USB_OTG_DIEPEACHMSK1_BIM                     (0x00000200UL)            /*!< BNA interrupt mask */
#define USB_OTG_DIEPEACHMSK1_NAKM                    (0x00002000UL)            /*!< NAK interrupt mask */

/********************  Bit definition forUSB_OTG_HPRT register  ********************/
#define USB_OTG_HPRT_PCSTS                   (0x00000001UL)            /*!< Port connect status */
#define USB_OTG_HPRT_PCDET                   (0x00000002UL)            /*!< Port connect detected */
#define USB_OTG_HPRT_PENA                    (0x00000004UL)            /*!< Port enable */
#define USB_OTG_HPRT_PENCHNG                 (0x00000008UL)            /*!< Port enable/disable change */
#define USB_OTG_HPRT_POCA                    (0x00000010UL)            /*!< Port overcurrent active */
#define USB_OTG_HPRT_POCCHNG                 (0x00000020UL)            /*!< Port overcurrent change */
#define USB_OTG_HPRT_PRES                    (0x00000040UL)            /*!< Port resume */
#define USB_OTG_HPRT_PSUSP                   (0x00000080UL)            /*!< Port suspend */
#define USB_OTG_HPRT_PRST                    (0x00000100UL)            /*!< Port reset */

