Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define USB_OTG_HPRT_PLSTS                   (0x00000C00UL)            /*!< Port line status */
#define USB_OTG_HPRT_PLSTS_0                 (0x00000400UL)            /*!<Bit 0 */
#define USB_OTG_HPRT_PLSTS_1                 (0x00000800UL)            /*!<Bit 1 */
#define USB_OTG_HPRT_PPWR                    (0x00001000UL)            /*!< Port power */

#define USB_OTG_HPRT_PTCTL                   (0x0001E000UL)            /*!< Port test control */
#define USB_OTG_HPRT_PTCTL_0                 (0x00002000UL)            /*!<Bit 0 */
#define USB_OTG_HPRT_PTCTL_1                 (0x00004000UL)            /*!<Bit 1 */
#define USB_OTG_HPRT_PTCTL_2                 (0x00008000UL)            /*!<Bit 2 */
#define USB_OTG_HPRT_PTCTL_3                 (0x00010000UL)            /*!<Bit 3 */

#define USB_OTG_HPRT_PSPD                    (0x00060000UL)            /*!< Port speed */
#define USB_OTG_HPRT_PSPD_0                  (0x00020000UL)            /*!<Bit 0 */
#define USB_OTG_HPRT_PSPD_1                  (0x00040000UL)            /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_DOEPEACHMSK1 register  ********************/
#define USB_OTG_DOEPEACHMSK1_XFRCM                   (0x00000001UL)            /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPEACHMSK1_EPDM                    (0x00000002UL)            /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPEACHMSK1_TOM                     (0x00000008UL)            /*!< Timeout condition mask */
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK               (0x00000010UL)            /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DOEPEACHMSK1_INEPNMM                 (0x00000020UL)            /*!< IN token received with EP mismatch mask */
#define USB_OTG_DOEPEACHMSK1_INEPNEM                 (0x00000040UL)            /*!< IN endpoint NAK effective mask */
#define USB_OTG_DOEPEACHMSK1_TXFURM                  (0x00000100UL)            /*!< OUT packet error mask */
#define USB_OTG_DOEPEACHMSK1_BIM                     (0x00000200UL)            /*!< BNA interrupt mask */
#define USB_OTG_DOEPEACHMSK1_BERRM                   (0x00001000UL)            /*!< Bubble error interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NAKM                    (0x00002000UL)            /*!< NAK interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NYETM                   (0x00004000UL)            /*!< NYET interrupt mask */

/********************  Bit definition forUSB_OTG_HPTXFSIZ register  ********************/
#define USB_OTG_HPTXFSIZ_PTXSA                   (0x0000FFFFUL)            /*!< Host periodic TxFIFO start address */
#define USB_OTG_HPTXFSIZ_PTXFD                   (0xFFFF0000UL)            /*!< Host periodic TxFIFO depth */

/********************  Bit definition forUSB_OTG_DIEPCTL register  ********************/
#define USB_OTG_DIEPCTL_MPSIZ                   (0x000007FFUL)            /*!< Maximum packet size */
#define USB_OTG_DIEPCTL_USBAEP                  (0x00008000UL)            /*!< USB active endpoint */
#define USB_OTG_DIEPCTL_EONUM_DPID              (0x00010000UL)            /*!< Even/odd frame */
#define USB_OTG_DIEPCTL_NAKSTS                  (0x00020000UL)            /*!< NAK status */

#define USB_OTG_DIEPCTL_EPTYP                   (0x000C0000UL)            /*!< Endpoint type */
#define USB_OTG_DIEPCTL_EPTYP_0                 (0x00040000UL)            /*!<Bit 0 */
#define USB_OTG_DIEPCTL_EPTYP_1                 (0x00080000UL)            /*!<Bit 1 */
#define USB_OTG_DIEPCTL_STALL                   (0x00200000UL)            /*!< STALL handshake */

#define USB_OTG_DIEPCTL_TXFNUM                  (0x03C00000UL)            /*!< TxFIFO number */
#define USB_OTG_DIEPCTL_TXFNUM_0                (0x00400000UL)            /*!<Bit 0 */
#define USB_OTG_DIEPCTL_TXFNUM_1                (0x00800000UL)            /*!<Bit 1 */
#define USB_OTG_DIEPCTL_TXFNUM_2                (0x01000000UL)            /*!<Bit 2 */
#define USB_OTG_DIEPCTL_TXFNUM_3                (0x02000000UL)            /*!<Bit 3 */
#define USB_OTG_DIEPCTL_CNAK                    (0x04000000UL)            /*!< Clear NAK */
#define USB_OTG_DIEPCTL_SNAK                    (0x08000000UL)            /*!< Set NAK */
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM          (0x10000000UL)            /*!< Set DATA0 PID */
#define USB_OTG_DIEPCTL_SODDFRM                 (0x20000000UL)            /*!< Set odd frame */
#define USB_OTG_DIEPCTL_EPDIS                   (0x40000000UL)            /*!< Endpoint disable */
#define USB_OTG_DIEPCTL_EPENA                   (0x80000000UL)            /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_HCCHAR register  ********************/
#define USB_OTG_HCCHAR_MPSIZ                   (0x000007FFUL)            /*!< Maximum packet size */

#define USB_OTG_HCCHAR_EPNUM                   (0x00007800UL)            /*!< Endpoint number */
#define USB_OTG_HCCHAR_EPNUM_0                 (0x00000800UL)            /*!<Bit 0 */
#define USB_OTG_HCCHAR_EPNUM_1                 (0x00001000UL)            /*!<Bit 1 */
#define USB_OTG_HCCHAR_EPNUM_2                 (0x00002000UL)            /*!<Bit 2 */
#define USB_OTG_HCCHAR_EPNUM_3                 (0x00004000UL)            /*!<Bit 3 */
#define USB_OTG_HCCHAR_EPDIR                   (0x00008000UL)            /*!< Endpoint direction */
#define USB_OTG_HCCHAR_LSDEV                   (0x00020000UL)            /*!< Low-speed device */

#define USB_OTG_HCCHAR_EPTYP                   (0x000C0000UL)            /*!< Endpoint type */
#define USB_OTG_HCCHAR_EPTYP_0                 (0x00040000UL)            /*!<Bit 0 */
#define USB_OTG_HCCHAR_EPTYP_1                 (0x00080000UL)            /*!<Bit 1 */

#define USB_OTG_HCCHAR_MC                      (0x00300000UL)            /*!< Multi Count (MC) / Error Count (EC) */
#define USB_OTG_HCCHAR_MC_0                    (0x00100000UL)            /*!<Bit 0 */
#define USB_OTG_HCCHAR_MC_1                    (0x00200000UL)            /*!<Bit 1 */

#define USB_OTG_HCCHAR_DAD                     (0x1FC00000UL)            /*!< Device address */
#define USB_OTG_HCCHAR_DAD_0                   (0x00400000UL)            /*!<Bit 0 */
#define USB_OTG_HCCHAR_DAD_1                   (0x00800000UL)            /*!<Bit 1 */
#define USB_OTG_HCCHAR_DAD_2                   (0x01000000UL)            /*!<Bit 2 */
#define USB_OTG_HCCHAR_DAD_3                   (0x02000000UL)            /*!<Bit 3 */
#define USB_OTG_HCCHAR_DAD_4                   (0x04000000UL)            /*!<Bit 4 */
#define USB_OTG_HCCHAR_DAD_5                   (0x08000000UL)            /*!<Bit 5 */
#define USB_OTG_HCCHAR_DAD_6                   (0x10000000UL)            /*!<Bit 6 */
#define USB_OTG_HCCHAR_ODDFRM                  (0x20000000UL)            /*!< Odd frame */
#define USB_OTG_HCCHAR_CHDIS                   (0x40000000UL)            /*!< Channel disable */
#define USB_OTG_HCCHAR_CHENA                   (0x80000000UL)            /*!< Channel enable */

/********************  Bit definition forUSB_OTG_HCSPLT register  ********************/

#define USB_OTG_HCSPLT_PRTADDR                 (0x0000007FUL)            /*!< Port address */
#define USB_OTG_HCSPLT_PRTADDR_0               (0x00000001UL)            /*!<Bit 0 */
#define USB_OTG_HCSPLT_PRTADDR_1               (0x00000002UL)            /*!<Bit 1 */
#define USB_OTG_HCSPLT_PRTADDR_2               (0x00000004UL)            /*!<Bit 2 */
#define USB_OTG_HCSPLT_PRTADDR_3               (0x00000008UL)            /*!<Bit 3 */
#define USB_OTG_HCSPLT_PRTADDR_4               (0x00000010UL)            /*!<Bit 4 */
#define USB_OTG_HCSPLT_PRTADDR_5               (0x00000020UL)            /*!<Bit 5 */
#define USB_OTG_HCSPLT_PRTADDR_6               (0x00000040UL)            /*!<Bit 6 */

