Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
#define USB_OTG_HCSPLT_HUBADDR                 (0x00003F80UL)            /*!< Hub address */
#define USB_OTG_HCSPLT_HUBADDR_0               (0x00000080UL)            /*!<Bit 0 */
#define USB_OTG_HCSPLT_HUBADDR_1               (0x00000100UL)            /*!<Bit 1 */
#define USB_OTG_HCSPLT_HUBADDR_2               (0x00000200UL)            /*!<Bit 2 */
#define USB_OTG_HCSPLT_HUBADDR_3               (0x00000400UL)            /*!<Bit 3 */
#define USB_OTG_HCSPLT_HUBADDR_4               (0x00000800UL)            /*!<Bit 4 */
#define USB_OTG_HCSPLT_HUBADDR_5               (0x00001000UL)            /*!<Bit 5 */
#define USB_OTG_HCSPLT_HUBADDR_6               (0x00002000UL)            /*!<Bit 6 */

#define USB_OTG_HCSPLT_XACTPOS                 (0x0000C000UL)            /*!< XACTPOS */
#define USB_OTG_HCSPLT_XACTPOS_0               (0x00004000UL)            /*!<Bit 0 */
#define USB_OTG_HCSPLT_XACTPOS_1               (0x00008000UL)            /*!<Bit 1 */
#define USB_OTG_HCSPLT_COMPLSPLT               (0x00010000UL)            /*!< Do complete split */
#define USB_OTG_HCSPLT_SPLITEN                 (0x80000000UL)            /*!< Split enable */

/********************  Bit definition forUSB_OTG_HCINT register  ********************/
#define USB_OTG_HCINT_XFRC                    (0x00000001UL)            /*!< Transfer completed */
#define USB_OTG_HCINT_CHH                     (0x00000002UL)            /*!< Channel halted */
#define USB_OTG_HCINT_AHBERR                  (0x00000004UL)            /*!< AHB error */
#define USB_OTG_HCINT_STALL                   (0x00000008UL)            /*!< STALL response received interrupt */
#define USB_OTG_HCINT_NAK                     (0x00000010UL)            /*!< NAK response received interrupt */
#define USB_OTG_HCINT_ACK                     (0x00000020UL)            /*!< ACK response received/transmitted interrupt */
#define USB_OTG_HCINT_NYET                    (0x00000040UL)            /*!< Response received interrupt */
#define USB_OTG_HCINT_TXERR                   (0x00000080UL)            /*!< Transaction error */
#define USB_OTG_HCINT_BBERR                   (0x00000100UL)            /*!< Babble error */
#define USB_OTG_HCINT_FRMOR                   (0x00000200UL)            /*!< Frame overrun */
#define USB_OTG_HCINT_DTERR                   (0x00000400UL)            /*!< Data toggle error */

/********************  Bit definition forUSB_OTG_DIEPINT register  ********************/
#define USB_OTG_DIEPINT_XFRC                    (0x00000001UL)            /*!< Transfer completed interrupt */
#define USB_OTG_DIEPINT_EPDISD                  (0x00000002UL)            /*!< Endpoint disabled interrupt */
#define USB_OTG_DIEPINT_TOC                     (0x00000008UL)            /*!< Timeout condition */
#define USB_OTG_DIEPINT_ITTXFE                  (0x00000010UL)            /*!< IN token received when TxFIFO is empty */
#define USB_OTG_DIEPINT_INEPNE                  (0x00000040UL)            /*!< IN endpoint NAK effective */
#define USB_OTG_DIEPINT_TXFE                    (0x00000080UL)            /*!< Transmit FIFO empty */
#define USB_OTG_DIEPINT_TXFIFOUDRN              (0x00000100UL)            /*!< Transmit Fifo Underrun */
#define USB_OTG_DIEPINT_BNA                     (0x00000200UL)            /*!< Buffer not available interrupt */
#define USB_OTG_DIEPINT_PKTDRPSTS               (0x00000800UL)            /*!< Packet dropped status */
#define USB_OTG_DIEPINT_BERR                    (0x00001000UL)            /*!< Babble error interrupt */
#define USB_OTG_DIEPINT_NAK                     (0x00002000UL)            /*!< NAK interrupt */

/********************  Bit definition forUSB_OTG_HCINTMSK register  ********************/
#define USB_OTG_HCINTMSK_XFRCM                   (0x00000001UL)            /*!< Transfer completed mask */
#define USB_OTG_HCINTMSK_CHHM                    (0x00000002UL)            /*!< Channel halted mask */
#define USB_OTG_HCINTMSK_AHBERR                  (0x00000004UL)            /*!< AHB error */
#define USB_OTG_HCINTMSK_STALLM                  (0x00000008UL)            /*!< STALL response received interrupt mask */
#define USB_OTG_HCINTMSK_NAKM                    (0x00000010UL)            /*!< NAK response received interrupt mask */
#define USB_OTG_HCINTMSK_ACKM                    (0x00000020UL)            /*!< ACK response received/transmitted interrupt mask */
#define USB_OTG_HCINTMSK_NYET                    (0x00000040UL)            /*!< response received interrupt mask */
#define USB_OTG_HCINTMSK_TXERRM                  (0x00000080UL)            /*!< Transaction error mask */
#define USB_OTG_HCINTMSK_BBERRM                  (0x00000100UL)            /*!< Babble error mask */
#define USB_OTG_HCINTMSK_FRMORM                  (0x00000200UL)            /*!< Frame overrun mask */
#define USB_OTG_HCINTMSK_DTERRM                  (0x00000400UL)            /*!< Data toggle error mask */

/********************  Bit definition for USB_OTG_DIEPTSIZ register  ********************/

#define USB_OTG_DIEPTSIZ_XFRSIZ                  (0x0007FFFFUL)            /*!< Transfer size */
#define USB_OTG_DIEPTSIZ_PKTCNT                  (0x1FF80000UL)            /*!< Packet count */
#define USB_OTG_DIEPTSIZ_MULCNT                  (0x60000000UL)            /*!< Packet count */
/********************  Bit definition forUSB_OTG_HCTSIZ register  ********************/
#define USB_OTG_HCTSIZ_XFRSIZ                    (0x0007FFFFUL)            /*!< Transfer size */
#define USB_OTG_HCTSIZ_PKTCNT                    (0x1FF80000UL)            /*!< Packet count */
#define USB_OTG_HCTSIZ_DOPING                    (0x80000000UL)            /*!< Do PING */
#define USB_OTG_HCTSIZ_DPID                      (0x60000000UL)            /*!< Data PID */
#define USB_OTG_HCTSIZ_DPID_0                    (0x20000000UL)            /*!<Bit 0 */
#define USB_OTG_HCTSIZ_DPID_1                    (0x40000000UL)            /*!<Bit 1 */

/********************  Bit definition forUSB_OTG_DIEPDMA register  ********************/
#define USB_OTG_DIEPDMA_DMAADDR                  (0xFFFFFFFFUL)            /*!< DMA address */

/********************  Bit definition forUSB_OTG_HCDMA register  ********************/
#define USB_OTG_HCDMA_DMAADDR                    (0xFFFFFFFFUL)            /*!< DMA address */

/********************  Bit definition forUSB_OTG_DTXFSTS register  ********************/
#define USB_OTG_DTXFSTS_INEPTFSAV                (0x0000FFFFUL)            /*!< IN endpoint TxFIFO space avail */

