Traumflug/Teacup_Firmware/cmsis-stm32f4xx.h
/********************  Bit definition forUSB_OTG_DIEPTXF register  ********************/
#define USB_OTG_DIEPTXF_INEPTXSA                 (0x0000FFFFUL)            /*!< IN endpoint FIFOx transmit RAM start address */
#define USB_OTG_DIEPTXF_INEPTXFD                 (0xFFFF0000UL)            /*!< IN endpoint TxFIFO depth */

/********************  Bit definition forUSB_OTG_DOEPCTL register  ********************/

#define USB_OTG_DOEPCTL_MPSIZ                     (0x000007FFUL)            /*!< Maximum packet size */          /*!<Bit 1 */
#define USB_OTG_DOEPCTL_USBAEP                    (0x00008000UL)            /*!< USB active endpoint */
#define USB_OTG_DOEPCTL_NAKSTS                    (0x00020000UL)            /*!< NAK status */
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM            (0x10000000UL)            /*!< Set DATA0 PID */
#define USB_OTG_DOEPCTL_SODDFRM                   (0x20000000UL)            /*!< Set odd frame */
#define USB_OTG_DOEPCTL_EPTYP                     (0x000C0000UL)            /*!< Endpoint type */
#define USB_OTG_DOEPCTL_EPTYP_0                   (0x00040000UL)            /*!<Bit 0 */
#define USB_OTG_DOEPCTL_EPTYP_1                   (0x00080000UL)            /*!<Bit 1 */
#define USB_OTG_DOEPCTL_SNPM                      (0x00100000UL)            /*!< Snoop mode */
#define USB_OTG_DOEPCTL_STALL                     (0x00200000UL)            /*!< STALL handshake */
#define USB_OTG_DOEPCTL_CNAK                      (0x04000000UL)            /*!< Clear NAK */
#define USB_OTG_DOEPCTL_SNAK                      (0x08000000UL)            /*!< Set NAK */
#define USB_OTG_DOEPCTL_EPDIS                     (0x40000000UL)            /*!< Endpoint disable */
#define USB_OTG_DOEPCTL_EPENA                     (0x80000000UL)            /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_DOEPINT register  ********************/
#define USB_OTG_DOEPINT_XFRC                    (0x00000001UL)            /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDISD                  (0x00000002UL)            /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_STUP                    (0x00000008UL)            /*!< SETUP phase done */
#define USB_OTG_DOEPINT_OTEPDIS                 (0x00000010UL)            /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_B2BSTUP                 (0x00000040UL)            /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_NYET                    (0x00004000UL)            /*!< NYET interrupt */

/********************  Bit definition forUSB_OTG_DOEPTSIZ register  ********************/

#define USB_OTG_DOEPTSIZ_XFRSIZ                  (0x0007FFFFUL)            /*!< Transfer size */
#define USB_OTG_DOEPTSIZ_PKTCNT                  (0x1FF80000UL)            /*!< Packet count */

#define USB_OTG_DOEPTSIZ_STUPCNT                 (0x60000000UL)            /*!< SETUP packet count */
#define USB_OTG_DOEPTSIZ_STUPCNT_0               (0x20000000UL)            /*!<Bit 0 */
#define USB_OTG_DOEPTSIZ_STUPCNT_1               (0x40000000UL)            /*!<Bit 1 */

/********************  Bit definition for PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_STOPCLK                 (0x00000001UL)            /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK                 (0x00000002UL)            /*!<Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP                 (0x00000010UL)            /*!<Bit 1 */

/****************************** USB Exported Constants ************************/
#define USB_OTG_FS_HOST_MAX_CHANNEL_NBR                8
#define USB_OTG_FS_MAX_IN_ENDPOINTS                    4    /* Including EP0 */
#define USB_OTG_FS_MAX_OUT_ENDPOINTS                   4    /* Including EP0 */
#define USB_OTG_FS_TOTAL_FIFO_SIZE                     1280 /* in Bytes */

#endif /* __STM32F4xx_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
